[
  {
    "Name": "Joe Bellich",
    "Year": "Pre 1990",
    "Image": "Joe_Bellich.jpg",
    "Bio URL": "Joe_Bellich",
    "bio": "\n"
  },
  {
    "Name": "Manual Boody",
    "Year": "Pre 1990",
    "Image": "Manual_Boody.jpg",
    "Bio URL": "Manual_Boody",
    "bio": "\n**Manual Boody** was one of the most beloved and respected figures in Colorado high school sports media. For over 30 years, he passionately covered the prep sports beat for the *Rocky Mountain News*, becoming a trusted voice and advocate for student-athletes across the state.\n\nManual had an unwavering belief that every athlete deserved recognition, and he made it his mission to feature as many names as possible in his coverage. His genuine interest in the students he covered elevated him to a legendary status within the prep sports community.\n\nIn addition to his journalistic contributions, Manual proudly served his country in the United States Army."
  },
  {
    "Name": "Mitchell Burns",
    "Year": "Pre 1990",
    "Image": "Mitchell_Burns.jpg",
    "Bio URL": "Mitchell_Burns",
    "bio": "\n**T. Mitchell Burns Jr.** was a towering figure in Colorado's sports history, remembered as much for his love of the game as for his remarkable longevity on the field. Known to generations of high school athletes as “the oldest umpire they’d ever seen,” Burns exuded a dignified presence and deep respect for sportsmanship.\n\nIn the spring of 1972, before a freshman baseball game at JFK High School, Coach Dennis Sullivan introduced Burns to his players with a mix of reverence and playful exasperation—an indication that Burns was something more than just a longtime umpire. That impression stuck with many.\n\nBorn June 14, 1901, in Denver, Burns graduated from the University of Denver and married Helen Hudson on his birthday in 1929. He was elected to the Colorado House of Representatives in 1932 and operated T. Mitchell Burns Insurance Agents until retiring in 1980.\n\nHis passion for sports knew no bounds. A 1974 *Denver Post* feature highlighted just a few of his remarkable achievements:\n- Umpired over 5,000 games at various levels since 1920\n- Attended every national AAU basketball tournament for three decades\n- Held season tickets to University of Denver football for 40 years\n- Owned Denver Broncos season ticket priority number 8\n- Attended every World Series for 32 years\n- Saw 20 MLB All-Star Games\n- In one whirlwind October day in 1959, he attended an Air Force football game in Denver, flew to Buffalo for a minor league championship, caught an NHL exhibition that night, and then flew to New York for the next day’s World Series opener\n\nBurns passed away on October 25, 1985, at age 84. His obituary in the *Rocky Mountain News* fittingly began with: \"long-time baseball umpire and sports enthusiast in the Denver area.\" His legacy endures not only in box scores and memories, but in the spirit of amateur sports across Colorado."
  },
  {
    "Name": "Pete Butler",
    "Year": "Pre 1990",
    "Image": "Pete_Butler.jpg",
    "Bio URL": "Pete_Butler",
    "bio": "\n**Pete Butler: A Legacy Etched in Northern Colorado Athletics**\n\nFor nearly seven decades, the name Pete Butler has been synonymous with excellence at the University of Northern Colorado. A standout student-athlete at what was then Colorado State Teachers College, Butler competed in both football and basketball before transitioning into a storied coaching career that left an indelible mark on UNC athletics.\n\nAs head coach of the men’s basketball and baseball programs, Pete Butler became a legendary figure on campus—but it was on the diamond where his legacy truly took root. From 1941 to 1967, Butler guided the Bears’ baseball team to an unprecedented 416 victories, making him the winningest coach in school history. His teams earned nine appearances in the College World Series, a testament to his leadership and strategic brilliance.\n\nIn recognition of his outstanding contributions to the sport, Butler was inducted into the American Baseball Coaches Hall of Fame in 1969. Today, his name lives on through Butler-Hancock Hall, the university’s primary athletic facility named in his honor.\n\nOne of his most memorable squads was the 1949 team, which finished the season with a remarkable 17-3 record. Dominating the Rocky Mountain Conference with an 8-0 mark, the Bears advanced to the NCAA Regionals to face powerhouse Southern California. After dropping the first game, Butler’s team rallied behind ace Harry Wise to win game two. In a dramatic final matchup, Wise gave the Bears a commanding 7-0 lead, but despite Butler’s efforts to manage the bullpen, USC mounted a late comeback to edge out an 8-7 win.\n\nStill, the story of that series—like the story of Pete Butler’s career—is one of courage, resilience, and excellence. His legacy continues to inspire generations of athletes at Northern Colorado and beyond.\n"
  },
  {
    "Name": "Walt Clay",
    "Year": "Pre 1990",
    "Image": "Walt_Clay.jpg",
    "Bio URL": "Walt_Clay",
    "bio": "\n“Walt Clay is the toughest s.o.b. I ever saw,” says former coach, official and current radio talk\npersonality Irv Brown.\nThe paragraph in the Chicago sports page of September 1946 made for interesting reading: “The Rockets\nhave a dream backfield and one nightmare.” The Chicago Rockets were beginning play in the fledging\nprofessional All-America League. Their backfield starters were quarterback Bob “Hunchy” Hornchmeyer,\nElroy “Crazy Legs” Hirsch at left halfback and Bill Daly at fullback. They were a dream, or so the writer\nfelt.\nThe nightmare was Rocket’s right halfback Walt Clay, a 6-foot-1, 228-pound ex-Marine who led\nLongmont High School to a state football co-championship in 1940 and, as a freshman, was a first-team\nAll-Big Seven fullback at the University of Colorado in 1942. “Clay is a bulldozer with forward gear only,”\nthe story went on to add. “A man with a passion for collision.”\nWalt cemented his place in Colorado sports history as a junior fullback at Longmont. In the 1940 state\nchampionship, he played despite a separated shoulder, which was taped down with a horse harness.\nYet, when Grand Junction led 6-0 with time running out, and Longmont with a first-and-goal at the 3-\nyard line, Walt got the call. He rammed over the right guard, carrying two tacklers over the goal line to\ntie the score. A nightmare indeed.\nBorn in the Shamrock Coal Mining Camp just outside Erie, Colorado, Walt was the seventh of nine\nchildren. The family moved to Longmont just as he entered grade school.\nWalt was an all-state pick in football and basketball. He not only was a brilliant and punishing football\ncollegiate fullback and defensive back, he also played guard for the AAU Denver American Legion\nbasketball team, which lost in the 1943 national finals to the Phillips 66ers.\nHe cut short his college football career to join the Marines in 1943. After the service, Walt rampaged in\nChicago and Los Angeles of the AAFL before the league folded in 1949.\nWalt went back to coach at CU where he received his degree in 1951. From there, it was off to Pueblo as\nbasketball and football coach at Centennial High School. After a nine-year stint on the sidelines for the\nBulldogs, Walt took to officiating. He was an official in basketball and wrestling for 28 years, football for\n25 and baseball and softball for 20."
  },
  {
    "Name": "Sam Corentino",
    "Year": "Pre 1990",
    "Image": "Sam_Corentino.jpg",
    "Bio URL": "Sam_Corentino",
    "bio": "\nSam Corsentino attended Lakeside/Vineland HS (now Pueblo County H.S.) graduating in 1936. He\nbegan participating actively in softball and boxing during his teenage years. Sam played for 10\nyears on local, city, and inter-city leagues in basketball, baseball and softball. He spent 10 seasons\nas the head men/women softball coach at the Pueblo Army Depot and was an assistant boxing\ncoach (five years) and an assistant coach for two years on the 29th Ammunition Squad.\nSam was named the District IV Commissioner of Babe Ruth 16/18-year-old division. He served as\nAssistant State Commissioner for Colorado Babe Ruth Baseball Association. Sam was a two-year\nmember of the Runyon Field Board of Directors (1977-79). He volunteered to help the Special\nOlympics and served 10 years as a volunteer Director for Pueblo Diversified Industries (helping\npeople who are mentally handicapped). Sam was said to be a small man in stature but big enough\nto stand up to any player or coach who challenged any of his decisions. His greatest attribute was\nhis impartiality when officiating. He took his job seriously and called the plays as he saw them but\nalways according to the book. Sam received a Life Time Membership into the Greater Pueblo\nSports Association (GPSA) in 2008"
  },
  {
    "Name": "Pete DAmato",
    "Year": "Pre 1990",
    "Image": "Pete_DAmato.jpg",
    "Bio URL": "Pete_DAmato",
    "bio": "\nPete D’Amato was a longtime baseball coach of American Legion baseball in Greeley, Colorado in 50’s\n60’s and 70’s. On the baseball field, Coach Pete D’Amato was vociferous, direct and firm. Off the field, he\nwas quiet, fun, self-effacing and not a self-promoter. He had a deep and sincere concern and love for all his\nplayers, for people.\nThere’s a saying, “Good things take time, quality takes time.” Sixty years after Pete initiated the Greeley\nHigh School Wildcat baseball program, the field was named — the Pete D’Amato Baseball Field.\nMany good and permanent tributes can be paid to Coach; however, it seems the best way to demonstrate\nhis influence during those 60 years is to mention what used to be said in the late 1940s, ’50s and ’60s.\n“Pete’s ‘Cats were the farm system for Alvin Garcia’s Greeley Grays,” so to speak.\nCoach D’Amato was a hero/mentor to many of his former players until the day he went home."
  },
  {
    "Name": "Chuck Denney",
    "Year": "Pre 1990",
    "Image": "Chuck_Denney.jpg",
    "Bio URL": "Chuck_Denney",
    "bio": "\nHall of Fame Inductee Charles (Chuck) A. Denney Jr.\n– La Junta\nCharles (Chuck) A. Denney Jr.’s life was an inspiration to all who knew him. He lived life with passion\nand the ongoing desire to help those around him. Chuck's career was in the broadcasting business in\nboth Lamar and La Junta, Colorado. As owner of the La Junta station, he was active in all aspects of\ncommunity activities, including sports broadcasting and morning talk shows. His achievements\nincluded being selected as Colorado's Broadcaster of the Year, president of the Colorado Broadcasters\nAssociation and a member of the selection committee for the Colorado Sports Hall of Fame.\nIn his free time, he was a public servant, acting as mayor of La Junta as well as Otero County\ncommissioner for eight years. Chuck's other main interest was as a Rotarian, becoming a member in\n1969. Highlights of his tenure with the club included the \"Service Above Self\" award given by Rotary\nInternational, one of only 150 honored for the award worldwide each year. He helped organize and\nfundraise Rotary's contribution of 2,800 wheelchairs to those in need in Mexico as well as participating\nin administering polio vaccines to children in Egypt.\nChuck proudly served in the 101st Airborne Division of the Army 1953-1955. He was an avid Ohio State\nfan, having been born and raised in Columbus, and loved baseball and golf. He spent several years\numpiring and was selected to umpire a Colorado State High School baseball championship game."
  },
  {
    "Name": "Mark Denzin",
    "Year": 2014,
    "Image": "Mark_Denzin.jpg",
    "Bio URL": "Mark_Denzin",
    "bio": "\nMark Denzin began umpiring in 1988 and continued until 1994 with the Colorado High\nSchool Baseball Umpires Association. During that time, he worked 3A and 5A Colorado State\nHigh School Championships. In 1990 and 1991 he worked the Mayor's Cup at Denver Mile\nHigh Stadium. Mark also worked numerous local tournaments including The Cherry Creek\nClassic, Tony Andenucio Memorial, and many American League tournaments.\nMark was invited to join Colorado Collegiate Umpire Association in 1988. Later, he moved\nto Seattle, Washington (Regional Vice-President, MDA), and was part of Seattle Collegiate\nAssociation. Then he moved to Chicago, Illinois (Regional Vice-President, MDA), and was\npart of Chicagoland Collegiate Umpires Association - President 2002-2005. Moving then to\nTucson, Arizona (National Vice-President, MDA) he was a part if Arizona Collegiate Umpires\nAssociation. Mark is currently living in McKinney, Texas (President-Ability Connection\nTexas) and is part of Texas Collegiate Umpires Association.\nMark Denzin, arguably, is the most successful CHSBUA umpire on a national scope. After his\nCHSBUA debut in 1988, he went on to work numerous post-season games and two Colorado\nState Championships. He also served two terms as a CHSBUA Denver Area Director before\nhis job took him to three different stops in the West. By this time, Mark had moved into the\ncollegiate ranks full-time and became the most successful collegiate umpire with Colorado\nties. He worked 13 Division 1 Conference tournament games in 9 Division 1 Conferences\n(Big East, Mid-America, Horizon, Big 10, Missouri Valley, Mountain West, Western Athletic,\nConference USA). He was selected for Seven games involving Korea, Mexico, Canada, and\nAustralia. He was also a fill-in at the professional level working Pacific Coast League,\nNorthwest, and Midwest Leagues. Mark also worked Northern League (Professional\nIndependent) Championship. However, he never left his CHSBUA roots, being invited to\ninstruct at CHSBUA Mile High Advanced Umpire Clinic and the CHSBUA Master Clinic."
  },
  {
    "Name": "Edmund DHaillecourt",
    "Year": "Pre 1990",
    "Image": "Edmund_DHaillecourt.jpg",
    "Bio URL": "Edmund_DHaillecourt",
    "bio": "\n"
  },
  {
    "Name": "Ervin Douglas",
    "Year": "Pre 1990",
    "Image": "Ervin_Douglas.jpg",
    "Bio URL": "Ervin_Douglas",
    "bio": "\n"
  },
  {
    "Name": "Dick Hotton",
    "Year": "Pre 1990",
    "Image": "Dick_Hotton.jpg",
    "Bio URL": "Dick_Hotton",
    "bio": "\n"
  },
  {
    "Name": "David Letofsky",
    "Year": "Pre 1990",
    "Image": "David_Letofsky.jpg",
    "Bio URL": "David_Letofsky",
    "bio": "\nHall of Fame Inductee Dave Letofsky – Aurora, Colorado\nAn Aurora baseball pioneer along with his twin brother Mert, Dave Letofsky coached from the\npee wee level to American Legion level, winning numerous league, district, regional and state\ntitles along the way. Dave was instrumental in forming youth leagues throughout Aurora and\norganizing programs for youngsters in the Denver area.\nDave coached his three sons — Jeff, Larry and Brian — from the Jaycees level through\nAmerican Legion baseball. All three ended up having successful college athletic careers. Dave\nalso was very instrumental in coaching basketball and football teams throughout Aurora,\nalthough his first love was baseball. “Big Dave” as he was known to all of those who played\nfor him was a huge influence in the lives of countless young players.\nDave also made a name for himself as an umpire, running his own umpire organization and\nofficiating at every level, from state high school championships to NCAA Division I regionals.\nDave was named as an alternate to the College World Staff a number of times. He also was a\nhigh-level softball umpire, working national fastpitch tournaments around the country.\nDave passed away in 2008 and has a wife, LaVerne, and six children, three daughters and\nthree sons."
  },
  {
    "Name": "Mert Letofsky",
    "Year": "Pre 1990",
    "Image": "Mert_Letofsky.jpg",
    "Bio URL": "Mert_Letofsky",
    "bio": "\nHall of Fame Inductee Mert Letofsky – Aurora, Colorado\nA pioneer of youth and American Legion baseball in the city of Aurora. Mert Letofsky was a\nwinner who had a huge impact on his players from the time he donned a uniform. Mert\nhelped start Legion Baseball in Aurora in 1951 and continued his involvement as a coach,\nadministrator and fan for more than 40 years until his death in 1992.\nMert helped start the Columbine Rookie League, an original semi pro league with friend\nBauldie Moschetti and was an original founder of Aurora Boys Baseball. He served in every\ncapacity for the American Legion including State Chairman and tournament director for\n20 years.\nMert coached the Columbine Rookie League for 6 years, Legion teams for 25 years, the\nDenver Freshman league for 10 years, Machebeuf for 4 years, Regis College for 4 years and\nthe Aurora Prospectors semi pro team for 7 years.\nMert’s teams won three state titles and more than 20 league championships. His teams won\nover 1000 games and 80% of his players went on and played in college. Many former players\nwent on to play professionally and countless others became coaches.\nMert was married to Alice for more than 40 years and had 6 daughters and three sons and\nmany grandkids. He always said his greatest thrill in the games was to watch his sons and all\nhis former players go on and play in college."
  },
  {
    "Name": "Melvin Martin",
    "Year": "Pre 1990",
    "Image": "Melvin_Martin.jpg",
    "Bio URL": "Melvin_Martin",
    "bio": "\nHall of Fame Inductee Melvin Martin – Commerce City\nMel Martin started his coaching career in La Jara where he was head baseball and head basketball coach\nfrom 1949 through 1953. He took over the baseball program at Adams City in 1955 and was head coach\nuntil 1977. During his reign, his teams won league championships in 1959 and 1962. They won\nco-championships in 1960,1965, and 1966. The 1959 league championship was the first league\nchampionship the school had won in any sport. In 1962, Mel was selected head coach in the annual\nDenver Post Suburban vs. Denver All-Star Game won by the suburban’s, a first.\nThe 1977 season produced one of Mel’s biggest baseball honors. He went to Miami, Florida, to be\nhonored by the American Association of College Baseball for his many years of contribution to baseball.\nMel always set a good example for his players, and they had much respect for him. Many of his ball\nplayers went on to continue their education and play college baseball. Some admired his work so much\nthat they became coaches. Many of those men received their early experiences by coaching in the Little\nLeague program that Mel ran for many years.\nUntil the time of his death in 1981, he spent many hours of time working with youth and athletes of all\nages in the recreational sports program. He coordinated activities, coached and also served as an official\nfor football, basketball, and baseball. He could be found on a field or court at most anytime.\nMartin was chairman of the math department at the school where he taught algebra, math analysis, and\ncomputer math. The baseball field at Adams City is named in his honor."
  },
  {
    "Name": "Bob Mullerberg",
    "Year": "Pre 1990",
    "Image": "Bob_Mullerberg.jpg",
    "Bio URL": "Bob_Mullerberg",
    "bio": "\n"
  },
  {
    "Name": "H_R Phillips",
    "Year": "Pre 1990",
    "Image": "H_R_Phillips.jpg",
    "Bio URL": "H_R_Phillips",
    "bio": "\nHall of Fame Inductee H.R. Phillips – Fort Collins\nH.R. Phillips entered the Air Force, attending cadet pre-flight school at Kessler AFB, Biloxi, Mississippi. He\nwas assigned to the 9th Air Force as a mechanic in Wiesbaden, Germany, the Air Force headquarters.\nIn March 1955, H.R. and his wife moved to Sterling, Colorado, where he was the County Recreation\nDirector. In 1962 the family moved to Ft. Collins, Colorado, as the first Director of Recreation and in\n1966 and became the city's first Parks & Recreation Director. He retired in 1988 after 26 years in Ft.\nCollins.\nH.R. enjoyed all sports. Skiing, canoeing, whitewater rafting, horse pact trips, camping and all kinds of\nfishing and hunting. He especially enjoyed anything to do with the mountains."
  },
  {
    "Name": "Frank Prentup",
    "Year": "Pre 1990",
    "Image": "Frank_Prentup.jpg",
    "Bio URL": "Frank_Prentup",
    "bio": "\nHall of Fame Inductee Frank Prentup – Boulder\nA full-blooded Tuscarara Iroquois, Frank “Chief” Prentup was born in Leavenworth, Kansas, to Lafayette\nF. Printup and Augusta M. Printup in 1907. His last name was spelled incorrectly as a result of a birth\ncertificate typo.\nFrank graduated from Junction City (Kansas) High School in 1926 and attended Kansas State College of\nAgriculture and Applied Science (now KSU) in Manhattan, Kansas, where he received bachelor and\nmasters’ degrees in physical education. While at KSC, he lettered in three sports -- football\n(quarterback), baseball (2nd baseman) and swimming.\nFrank went on to coach a number of sports in the Kansas High School system from 1932-40. He was so\nwell liked that faculty, staff & students at Manhattan High School, they initiated, voted for and enacted\nthe high school’s mascot name change from the Manhattan Blues to the Manhattan Indians, which\nremains to this day.\nFrank went on to become an assistant football, baseball and basketball coach at the University of\nColorado from 1941 to 1943 before joining the United States Navy in 1943, serving as a training officer\nin the Naval Flight School in the Norfolk, Virginia, area until his discharge from active duty in 1945. He\nreturned to Boulder and resumed his coaching career as an assistant football coach, assistant baseball\ncoach, and a physical education associate professor.\nIn 1947, Frank was named head baseball coach at CU and remained as an assistant in football. He spent\nthe next 22 years running the baseball program before retiring in 1969 with a record of 257-255-2. His\n1946 team was a Big 7 Conference co-champion and his 1961 team was third in the Big 8 Conference.\nFrank received the Meritorious Service Award from the American Baseball Coaches Association in 1986\nat their annual convention in New Orleans.\nPrentup Field was built in 1967 on CU’s east campus and is named in his honor. When built, it was the\nbest baseball facility in the Big 8 Conference (it is now the women’s soccer field as CU does not support\na baseball program).\nFrank was inducted into the University of Colorado Athletic Hall of Fame in 2015.\nAmong his other achievements, he co-authored the “Scientific Techniques of Batting” with Robert H.\nPomeroy in 1973, authored “Punching the Light Bag” for hand/eye coordination (for both men and\nwomen) in 1985 and was one of the original developers of rope skipping (for fun and fitness) as an\nathletic agility and stamina program for all sports. Developed an accredited PE class for same at CU (for\nmen and women), and authored a short book on the subject, “Skipping the Rope for Fun and Fitness” in\n1963."
  },
  {
    "Name": "James Roorda",
    "Year": "Pre 1990",
    "Image": "James_Roorda.jpg",
    "Bio URL": "James_Roorda",
    "bio": "\nHall of Fame Inductee James “Jim” Roorda – Denver\nJames “Jim” Roorda graduated in 1959 from Denver South High School where he was very involved\nathletically and named to the All-State baseball team as a catcher. Jim furthered his education by\nearning a B.A. degree from U.N.C. and then a master’s degree from C.S.U.\nJim’s career was focused on vocational education, teaching distributive education in both Las Animas\nand Loveland. He went on to become an associate director of vocational education at Aims Community\nCollege in its formative years. This led to him becoming a member of the state board for vocational\neducation in Denver. He finished his career with the St. Vrain Valley School District.\nJim was a very active dad who was always there for his boys and their activities, as a coach, cheerleader\nor spectator. Jim was one of the five men along with some key city council members that were\ninstrumental in planning and building Centennial Baseball fields. He was very proud of this achievement,\nknowing that thousands of young people have benefited from using this facility."
  },
  {
    "Name": "Gene Rozzelle",
    "Year": "Pre 1990",
    "Image": "Gene_Rozzelle.jpg",
    "Bio URL": "Gene_Rozzelle",
    "bio": "\nHall of Fame Inductee Gene Rozelle – Grand Junction\nGene Rozelle was born in Danbury, Nebraska and he moved to Grand Junction as a child attending local\nschools graduating from Central high in 1947. Shortly after graduating, he joined the Air Force where he\nserved his country proudly. He served four years in France before returning home to the Grand Valley.\nGene's love of sports led him to a career in sports casting. Gene was known for his love of sports, bingo, his quiet time fishing and painting.\n"
  },
  {
    "Name": "Sal Salazar",
    "Year": "Pre 1990",
    "Image": "Sal_Salazar.jpg",
    "Bio URL": "Sal_Salazar",
    "bio": "\n"
  },
  {
    "Name": "Terry Schiessler",
    "Year": "Pre 1990",
    "Image": "Terry_Schiessler.jpg",
    "Bio URL": "Terry_Schiessler",
    "bio": "\nHall of Fame Inductee Terry Schiessler – Aurora\nA fundamental pillar in Colorado baseball history, Terry Schiessler was integrally involved in all aspects\nof high school athletics from the early 1960s through the 80s. His passion was baseball.\nA three-sport all-state star from Nebraska, Terry came to Colorado and the University of Denver on a\nbasketball scholarship but ended up being a standout in both football and baseball. Upon graduation, he\nwas drafted by both the St. Louis Cardinals and Philadelphia Eagles, but chose to begin his career in the\nAurora Public Schools system in 1958.\nAfter starting his baseball coaching career at Aurora Central as a junior varsity coach, Terry became the\ninaugural head coach at Aurora Hinkley. After starting with all underclassmen, he led the Thunderbirds\nto three consecutive Centennial League championships and state playoff berths with a 72-26 record.\nIn 1968, he was named the National District 7 High School Coach of the Year and managed the Suburban\nAll-Stars in the annual Denver-Suburban game. Terry took time to complete his master's degree and\nbecame the first head coach at Metropolitan State College.\nTerry’s focus turned to administration where he became the athletic director at Aurora Central and\nNorthglenn high schools. He also served as manager in the Basin League in South Dakota from 1967-\n74. He coached players such as John Stearns, Paul Splitorff and Bob Apodaca. In 1975, he coached the\nArvada Dons.\nTerry also was a top-notch football, basketball and baseball official and was a fixture on the sidelines\nwhile working the \"chain gang\" for the Denver Broncos. He officiated state finals in all three high school\nsports and moved into the college level where he worked several years at the National Junior College\nBaseball World Series in Grand Junction. He also was the president of the Colorado High School Baseball\nUmpires Association from 1977 – 1979 and served on executive boards in basketball and football. He\nhas been inducted in myriad hall of fames."
  },
  {
    "Name": "Don Shiverdecker",
    "Year": "Pre 1990",
    "Image": "Don_Shiverdecker.jpg",
    "Bio URL": "Don_Shiverdecker",
    "bio": "\n"
  },
  {
    "Name": "Ron Sisson",
    "Year": "Pre 1990",
    "Image": "Ron_Sisson.jpg",
    "Bio URL": "Ron_Sisson",
    "bio": "\nHall of Fame Inductee Ron Sisson – Fort Collins\nRon graduated from Greeley High School and earned his BS and MS degrees from Colorado A & M (now\nCSU). Ron served in the U S Army for two years. Ron’s wisdom and sense of humor touched many in the\n31 years he dedicated to education at Windsor High School, Lesher and the opening of Lincoln. He\nfinished his career as the Principal at Fort Collins High School. Ron’s passion for sports influenced his\nplaying, coaching and officiating for baseball, basketball and football. He was a life member of the CSU\nAlumni Association and the Greater Ram Club."
  },
  {
    "Name": "Lou Spector",
    "Year": "Pre 1990",
    "Image": "Lou_Spector.jpg",
    "Bio URL": "Lou_Spector",
    "bio": "\n"
  },
  {
    "Name": "Stormy Stucker",
    "Year": "Pre 1990",
    "Image": "Stormy_Stucker.jpg",
    "Bio URL": "Stormy_Stucker",
    "bio": "\n"
  },
  {
    "Name": "George Theodore",
    "Year": "Pre 1990",
    "Image": "George_Theodore.jpg",
    "Bio URL": "George_Theodore",
    "bio": "\n"
  },
  {
    "Name": "Ed Tracy",
    "Year": "Pre 1990",
    "Image": "Ed_Tracy.jpg",
    "Bio URL": "Ed_Tracy",
    "bio": "\n"
  },
  {
    "Name": "Dick Yates",
    "Year": "Pre 1990",
    "Image": "Dick_Yates.jpg",
    "Bio URL": "Dick_Yates",
    "bio": "\nHall of Fame Inductee Dick Yates – Denver\nDenver South and Kennedy high schools and American Legion coach Dick Yates began a legacy\nthat has continued today. A Denver native, Dick attended South High School and the University\nof Denver before landing as a teacher and coach in the Denver Public Schools system. He\nbecame the head baseball coach at John F. Kennedy when the school opened in 1966. Dick\nofficially retired in 1985 after 35 years, 22 years as a head coach in baseball and football.\nHis baseball teams captured 18 city championships, eight state championships and two regional\nchampionships, including play in summer American Legion baseball. Dick entered the Colorado\nSports Hall of Fame in 2007.\nDick’s sons Scott and Shannon and grandson Rich have carried on the tradition. Scott, who\nplayed on a JFK state football championship team and went on to play at the University of\nColorado, is now the head football coach at Kent Denver where his son Rich plays. Shannon\nstarred on the 1986 Kent Denver team and went on to play at the United States Air Force\nAcademy."
  },
  {
    "Name": "John Wenglass",
    "Year": 1987,
    "Image": "John_Wenglass.jpg",
    "Bio URL": "John_Wenglass",
    "bio": "\n"
  },
  {
    "Name": "Virgil Jester",
    "Year": 1989,
    "Image": "Virgil_Jester.jpg",
    "Bio URL": "Virgil_Jester",
    "bio": "\n1989 Hall of Fame Inductee Virgil Jester – Westminster\nVirgil Jester came out of Denver North High School and became a fixture in Denver baseball. After\nattending Colorado State College of Education, he played three seasons with the Denver Bears and played\nin the major leagues with the Braves, first in Boston and then Milwaukee. He started as an infielder but\nwas quickly moved to the pitching mound because his fastball reached speeds into the 90 mph range.\nJester signed a contract with the Boston Braves in 1947 for $2,500. As he looked back on his career a few\nyears ago, he said he was born 55 years too soon, missing the big salaries that came to major-league\nbaseball.\nJester pitched in the old Denver Post tournament at Merchants Park on South Broadway. He once pitched\nagainst Hall of Famer Satchel Paige.\nIn his 21-game MLB career, he posted a 3–5 record and a 3.84 career earns run average, permitting 84\nhits and 27 bases on balls in 75 career innings pitched; he was credited with 25 strikeouts. Jester retired\nfrom baseball after the 1959 season. He was back with the Bears for his final year."
  },
  {
    "Name": "Leo Bahl",
    "Year": 1990,
    "Image": "Leo_Bahl.jpg",
    "Bio URL": "Leo_Bahl",
    "bio": "\n1990 Hall of Fame Inductee Leo Bahl – Aurora\nKnown as “Bozo”, the “Clown Prince” of umpires, Leo Bahl was not only a character but a darn good\nman in blue. Called one of the true characters of the game in Colorado baseball history, Leo was born\non Christmas Day in 1916 and passed away in 2006.\nA veteran of World War II, Leo was a postal worker for many years in the Aurora area. He officiated\nmany sports from the 1940s through the 1990s. Baseball was his real claim to fame as he was a high\nschool and college umpire. His contemporaries were CDCCA Hall of Famers Julie Carbello, Joe May, Dan\nWeikle, Joe Rossi, Dave Baker, Bud Schoepflin, Dave Letofsky and fellow 2023 inductee Keith Bailey.\nOthers included Bob Blaser, Ken Furman, Wiley Chance, Bob Westoff, Al Raglin and Bob Finney, among\nothers.\nLeo was known as a big-game official for many years having worked nearly every “big” game in the\nDenver metro area, including numerous CHSAA state championship games and summer legion state\ntournaments.\nHe was a favorite of Mert Letofsky and the Aurora Legion program and fellow hall of famer Irv Brown\nconsidered him a regular as the University of Colorado. He also was a mainstay at Colorado School of\nMines and considered head coach Jim Darden one of his dearest friends.\nLeo also was a longtime All-Star Wrestling official and was known to take some of his wrestling antics\nonto the baseball field."
  },
  {
    "Name": "Gene Bunnelle",
    "Year": 1990,
    "Image": "Gene_Bunnelle.jpg",
    "Bio URL": "Gene_Bunnelle",
    "bio": "\n1990 Hall of Fame Inductee Gene Bunnelle – Aurora\nFrancis “Gene” Bunnelle graduated from Rankin Township High School in 1945, then earned a bachelor’s\ndegree from Buena Vista College in Storm Lake, Iowa, in 1950 and a master’s degree in 1959 from Western\nState College in Gunnison and made his mark in the Rocky Mountains.\nA legendary figure in the Association from 1965 until his retirement in 1988, Gene had at various times\nduring his tenure the primary administrative responsibility for each of the sports and activities\nsanctioned by the CHSAA. His commitment to the students of Colorado is legendary and perhaps best\nrepresented by his work in developing the CHSAA ' s student council leadership workshops and\nconferences\nGene was a familiar administrator on the Western Slope, where he served as a teacher/coach at Fruita Junior\nHigh School as well as principal at Roaring Fork High School in Carbondale.\nActive in rules interpretations and officiating in multiple sports, Gene was with the Colorado High School\nActivities Association for 24 years before retiring in 1988. He was instrumental in student-leadership\nworkshops and conferences; was inducted into multiple halls of fame; was a member of numerous\norganizations and committees locally and nationally; and earned the National Federation of State High School\nAssociation’s distinguished service award in 1995."
  },
  {
    "Name": "Julius Carabello",
    "Year": 1990,
    "Image": "Julius_Carabello.jpg",
    "Bio URL": "Julius_Carabello",
    "bio": "\n1990 Hall of Fame Inductee Julius “Julie” Carabello – Denver\nJulius “Julie” Carabello was involved in baseball since growing up in Curtis Park and playing for Sacred\nHeart Elementary School and Sacred Heart High School, where he graduated in 1935.\nHe continued his involvement with baseball when he coached St. Joseph’s High School before joining the\nNavy to serve in World War II. The Navy recognized his talent and passion for athletics, assigning him\ncoaching duties for the Navy’s recreational basketball and baseball teams stationed in the Philippines\nIslands. He coached a team anchored by Dom DiMaggio, among other outstanding players serving their\ncountry.\nAfter returning from his service in the Navy, he co-founded an organization called the Junior Parochial\nLeague. The JPL provided organized athletics to Catholic elementary school students, many of whom\nwould eventually play for the Parochial League, Denver’s Catholic High School league. An iteration of the\nJPL continues today, having thrived for nearly 70 years.\nAs the co-founder and longtime director of the JPL, he introduced innovations like girl’s sports, weight-\nclassifications to boys playing football, consolation brackets for the annual postseason basketball\ntournament, and enrollment classifications to ensure competitive fairness. He was not only the face of\nthe JPL; his energy and commitment were the engine which drove the organization.\nHis passion for sports morphed into officiating and umpiring, resulting in an outstanding career as a\nbaseball umpire. Julie was rated the top umpire in the region, according to polls conducted by local and\nregional college coaches. He umpired hundreds of games for the University of Colorado, as the Umpire\nin Chief for longtime coaches Frank “Chief” Prentup and Irv Brown.\nOther colleges he worked for were CSU, AFA, DU, Wyoming and UNC. When he wasn’t umpiring these\ncolleges, he worked for the Boulder Collegians, National Baseball Congress tournaments, Denver Post\nTournaments at Merchants Park, and an event he cherished, the Junior College World Series in Grand\nJunction. He served as UIC for Sam Suplizio in the Junior College World Series for many years. He also\nworked NCAA Regional Tournament games in Albuquerque and Salt Lake City.\nJulie was invited to Florida to train as a professional umpire, but family obligations prevented him\npursuing this opportunity. But he found the thrill of calling balls and strikes for major league players in\nexhibition games in Denver, when he was hired to umpire major league teams which annually played\nexhibition games at Bears Stadium after they broke camp from spring training. He was the alternate\numpire for the Denver Bears, filling in occasionally for an injured or ill minor league umpire. He was also\nthe UIC for a barnstorming MLB “All Star” game which found its way to Denver a couple times in the\nmid-1950s.\nJulie founded and was the President of the Rocky Mountain Umpires Association for many years, leading\nand enhancing the status and professional development of umpires across the Front Range. After Rocky\nMountain Umpires Association, Aurora Umpires and Umpires Association of Colorado combined, Julie\nbecame the first president CHSBUA and presided from 1963 to 1975.\nHe was awarded a Pioneer Award by the Colorado Rockies in 1997, recognizing his impact on baseball in\nColorado. This award is a permanent enshrinement in the press room at Coors Field.\nIn addition to coaching, he was an area sub-scout for the Pittsburgh Pirates and the New York Mets for\nclose to two decades.\nCarabello passed away in 2008, but his impact on baseball – especially umpiring - lives on today"
  },
  {
    "Name": "Warren Kettner",
    "Year": 1990,
    "Image": "Warren_Kettner.jpg",
    "Bio URL": "Warren_Kettner",
    "bio": "\n1990 Hall of Fame Inductee Warren Kettner – Denver\nWarren Kettner may have been born on a farm, but his true love became teaching and instructing\nbaseball and many other activities.\nThe native of Good Thunder, Minn., Warren’s educational base began forming at a young age. He\nattended St. Paul's Lutheran Elementary School and Truman High School before enrolling into Lower\nColumbia Junior College in Longview, WA.\nAfter enlisting in the Army and serving two years in South Korea (1954-55), Warren returned to\nValparaiso (Ind.) University to finish his education (1959) where he majored in history. That same year,\nhe began teaching and coaching at Lutheran High School in Denver. He taught in the social science field-\ngeography, world history, international relations, economics and was the head of the physical education\ndepartment.\nWarren then started becoming involved in many other areas, all sports related. He started the cross-\ncountry and wrestling programs at Lutheran and organized and served as director of the sports medicine\nprogram for 35 years. He was an assistant coach in basketball and football and served as the athletic\ndirector for 10 years at Lutheran. While Warren’s involvement in school and outside activities were\nintense, it was in baseball where he made his mark.\nWarren became the head baseball coach at Lutheran in 1963 and was a fixture in the program for the\nnext 25 years. His highlights were numerous:\n• Overall record—213 wins, 156 losses\n• Six Metro League championships (one was a tie)\n• Four state semifinal appearances Metro League coach of the year in 1980\n• District coach of the year nominee in 1985\n• Served on the state baseball committee\n• Worked with Willie White and Del Peterson on all-star selection committee\n• Metro League Hall of Fame member"
  },
  {
    "Name": "Irv Moss",
    "Year": 1990,
    "Image": "Irv_Moss.jpg",
    "Bio URL": "Irv_Moss",
    "bio": "\n1990 Hall of Fame Inductee Irv Moss – Denver\nIrv Moss, who has a sports writer at the Denver Post for nearly half a century, he won't divulge when he\nstarted there, has seen virtually every side of sports from youth baseball to high school to college and\nthe pros.\nA Denver West graduate, Irv went on to continue his education at Colorado A&M (now Colorado State\nUniversity in Fort Collins) and the University of Denver. He went on to serve in the United States Army\nwhere his writing career actually began at a public information office in Germany.\nIrv returned to Denver and starting working at night at the Denver Post in the editorial area. That's\nwhere he befriended sports editor Chuck Garrity, who offered Moss a position in the sports department.\nHe's been an institution ever since.\nIrv started covering high school sports and graduated to coverage of the University of Wyoming and the\nUnited States Air Force Academy. He was a general assignment reporter for Colorado State University\nand also dabbled with coverage of the University of Colorado. He's also covered the Nuggets, Broncos\nand Rockies during his career.\nHe was instrumental in starting up the Denver vs. Suburban all-star baseball game originally held at\nBears Stadium. The event was sponsored by the Denver Post.\nIrv points to Eric Young's leadoff home run in the bottom of the first inning in the Colorado Rockies'\ninaugural home game at Mile High Stadium as \"one of the most electrifying sports days I've ever been\naround.\" Irv speaks so fondly of players who have crossed his path with special mention of Goose\nGossage, Fred Steinmark and Don Sessions!"
  },
  {
    "Name": "Lou Nolin",
    "Year": 1990,
    "Image": "Lou_Nolin.jpg",
    "Bio URL": "Lou_Nolin",
    "bio": "\n"
  },
  {
    "Name": "Edward Stevens",
    "Year": 1990,
    "Image": "Edward_Stevens.jpg",
    "Bio URL": "Edward_Stevens",
    "bio": "\n1990 Hall of Fame Inductee Ed Stevens – Arvada\nEd Stevens began forming his legacy at a young age on the South Side of Chicago. Following the death\nof his father, at the age of 13, he was forced to drop out of school to work full time to support his\nmother and two brothers. When he was 19, his family moved to Golden.\nEd dedicated his life to softball and baseball. He played softball in one of the most competitive leagues\nin Denver and eventually turned to umpiring and coaching.\nFor more than three decades, he was considered one of Colorado's top high school and college umpires.\nHe also was a nationally recognized ASA fast pitch softball umpire — becoming the only man to have\nplayed (1957) and umpired (1971) in a national tournament.\nHe served many years as a member of the board of directors for AABC baseball and was commissioner\nof many local leagues as well as tournament director for countless state and regional tournaments.\nEd was one of the pioneers of Arvada Junior Baseball. He coached his son's 10-year-old team as well as\nB Legion team for Arvada High School. He also coached in the summers, winning back-to-back\nAmerican Legion state championships in 1980 and 1981 — a first in Colorado history."
  },
  {
    "Name": "Bill Vincent",
    "Year": 1990,
    "Image": "Bill_Vincent.jpg",
    "Bio URL": "Bill_Vincent",
    "bio": "\n1990 Hall of Fame Inductee Bill Vincent – Arvada\nBill Vincent was born May 12, 1927 in Denver, Colorado. Bill was a longtime Denver area sports\nofficial and teacher.\nBill graduated from Wheat Ridge High School in 1945 and earned Bachelors and Master’s degrees in\neducation from the University of Denver while playing football.\nBill taught in the Denver Public Schools for 34 years before retiring in December, 1984.\nHis sports officiating career covered virtually all amateur levels and spanned 46 years. Bill was the\nsecond president of CHSBUA from 1975-1977. He was the co-founder of the Umpires Association of\nColorado and was assigning secretary for U.A.C. umpires and assigned for the northern league.\nBill had the nickname “wheels” as football official due to lack of speed on the field. He co-founded the Carnation Bowl, a championship game for Jefferson County youth football.\n"
  },
  {
    "Name": "Frank Zele",
    "Year": 1990,
    "Image": "Frank_Zele.jpg",
    "Bio URL": "Frank_Zele",
    "bio": "\n1990 Hall of Fame Inductee Frank Zele Jr.\n– Denver\nFrank William Zele Jr. was born in Hasting, CO and graduated from Trinidad High School with the class\nof 1937. He also graduated from Trinidad State Junior College and then the University of Denver with a\nB.A. in Accounting. Frank was in the Navy from 1937-1945. He worked at the Air Force Finance Center\nin Denver and Colorado State Dept. of Labor in Lakewood until his retirement. He was an umpire for\n38 years and a rancher all of his life."
  },
  {
    "Name": "Bill Helman",
    "Year": 1991,
    "Image": "Bill_Helman.jpg",
    "Bio URL": "Bill_Helman",
    "bio": "\n1991 Hall of Fame Inductee Bill Helman – Denver\nWhen an institution retires your jersey number, that’s proof positive of your impact.\nThat’s what transpired for William (Bill) Helman, a baseball coach and athletic director who took\nMetropolitan State College in Denver to new heights.\nAfter coaching baseball at Metro State from 1979-1992, Bill stepped down to focus on his duties as\nathletic director. His career coaching record at the school was 338-293-2.\nIn April of 1995, the Metro State athletic department honored Bill by retiring his baseball jersey, No. 1,\nbetween games of a doubleheader against Mesa State. He became only the second athlete or coach to\nhave his or her jersey retired in the history of Metro State athletics.\nAfter earning his bachelor’s degree in business administration in 1967 from the Citadel in Charleston,\nSouth Carolina, Bill joined the U.S. Air Force where he served nine years and resigned with the rank of\nCaptain. He earned two master’s degrees from the University of Northern Colorado in recreation and\nadministration in 1977 and business administration in 1978.\nBill’s teams were always competitive and could hit. The Roadrunners were the NAIA team batting\nchampions in 1981 and runners-up in 1987. More than 50 of his players were named to All-American,\nall-region and all-league teams and several went on to play professionally.\nHe was the founder of the Metro State Indoor Youth Baseball Clinic, honored by the Colorado High\nSchool Baseball Umpires Association (CHSBUA) for Outstanding Service to Colorado High School Baseball\n(1990), was instrumental in establishing the Denver Cup-City Championships (1987-1992) and a great\nfundraiser for the Metro State baseball program during his coaching career."
  },
  {
    "Name": "Mark Junge",
    "Year": 1991,
    "Image": "Mark_Junge.jpg",
    "Bio URL": "Mark_Junge",
    "bio": "\n"
  },
  {
    "Name": "Willie White",
    "Year": 1991,
    "Image": "Willie_White.jpg",
    "Bio URL": "Willie_White",
    "bio": "\n1991 Hall of Fame Inductee Willie White – Littleton\nWillie White has the distinction of earning a World Series ring from the Philadelphia Phillies as a\nmember of their scouting staff for nearly two decades. While that's quite an achievement, Wilie has\ncertainly contributed to baseball on many other fronts.\nThe head baseball coach at Littleton High School from 1970-1990, Willie also coached in the summers.\nHis high school teams won two state championships. The field at Littleton High School is named for him.\nA charter member of the CHSBCA and Dugout Club, Willie was the back bone of the Colorado High\nSchool All State Baseball games for many years that they were played at Englewood High School. He has\nserved on numerous district, state and local selection committees.\nCoaching honors include being named Mr. Baseball by CHSAA in 1990 and CHSAA coach of the year in\n1991. He's also a member of the South High School Hall of Fame and an honorary member of the\nColorado Baseball Umpires Association.\nWillie is married to Margaret and has three daughters, two sons and nine grandchildren."
  },
  {
    "Name": "Art Wollenweber",
    "Year": 1991,
    "Image": "Art_Wollenweber.jpg",
    "Bio URL": "Art_Wollenweber",
    "bio": "\n1992 Hall of Fame Inductee Art Wollenweber – Sheridan\nArt Wollenweber was named the Colorado High School Coaches Association Coach of the Year in 1987,\nthe former Sheridan High School coach achieved plenty.\nArt garnered achievement awards for 250 and 300 victories and in 1979 was named National High\nSchool Athletic Coaches Association District 6 Coach of the Year and ventured to Florida to claim the\naward.\nArt was presented the Metro League Hall of Fame award in 1984, earned a national high school coaching\ngold award in 1987, a CHSCA Hall of Fame award in 1989 and was athletic director of the year for the\n1988-89 school year.\nArt played on the 1949 Northern Colorado squad that made it to the NCAA Regional's before dropping a\nthree-game series to Southern California.\nHe was also able to coach his sons while at Sheridan in the 1960’s and 70’s."
  },
  {
    "Name": "Joe Brooks",
    "Year": 1992,
    "Image": "Joe_Brooks.jpg",
    "Bio URL": "Joe_Brooks",
    "bio": "\n"
  },
  {
    "Name": "Charlie Chainhalt",
    "Year": 1992,
    "Image": "Charlie_Chainhalt.jpg",
    "Bio URL": "Charlie_Chainhalt",
    "bio": "\n1992 Hall of Fame Inductee Charlie Chainhalt – Denver\nCharlie Chainhalt is a guy who has been around the block. He was a standout athlete at Denver Manual\nHigh School and went on to play baseball for the Colorado Teacher's College (University of Northern\nColorado). He was signed to a professional contract by the Legendary Cobe Jones, who was scouting for\nthe Giants.\nCharile's major league debut with Charlotte, in the Carolina League. He later played briefly with the New\nYork Giants long enough to “catch on to a few tricks” as he puts it.\nHe returned to Denver in 1946 and became a player-coach for Joe Alpert's in the old Metro Denver Semi-\nprofessional League. He recalls playing at Merchant's Park in the Denver Post Tournament and hitting\nagainst Satchel Palge. *I fouled one ball, that was It.”\nCharlie coached the 1977-78 National Championship team Axom Auto Company handled the likes of big\nleaguers Nick Capra and John Stearns. Charlie was fiery and feisty and gets things fired up. He has been\nknown to have a few choice words for those who raise his ire.\nCharlie's outlook on the game sums it up \"Baseball has always been a pleasure and also a job. I enjoy\nbeing around the kids.”"
  },
  {
    "Name": "John DeSiato",
    "Year": 1992,
    "Image": "John_DeSiato.jpg",
    "Bio URL": "John_DeSiato",
    "bio": "\nHall of Fame Inductee John DeSiato – Denver\nStill a fixture in Aurora, John DeSiato made his mark by coaching some of the best high school players in\nColorado history.\nJohn, who still works as the manager of Aurora Public Schools Stadium, started out at Hinkley in 1969 as\nan assistant coach under Terry Schiessler, whom he knew from their time together playing at the\nUniversity of Denver. John took over in the early ’70s and guided the team to Centennial League titles in\n1972, 1973 (when the Thunderbirds lost in the semifinals, but placed third) and 1975.\nThe championship breakthrough came in 1979, when a team loaded with juniors who had played\ntogether the previous season, finally put it together with Brian Fisher at the forefront.\nIn 11 seasons at Hinkley, John compiled a 140-71-1 record. He coached in the annual Denver Post\nSuburban vs. Denver all-star game in 1972, 1973 and 1975.\nHe was selected District 7 Coach of the Year in 1979 by the American Association of College Baseball\nCoaches.\nJohn went on to coach the likes of future major leaguers Brian Holman and Danny Jackson.\nHe was born in Denver and played baseball at Denver North High School and the University of Denver.\nJohn is married to Roseann, has two daughters and one son."
  },
  {
    "Name": "Francis Ford",
    "Year": 1992,
    "Image": "Francis_Ford.jpg",
    "Bio URL": "Francis_Ford",
    "bio": "\n"
  },
  {
    "Name": "Mike Kronkright",
    "Year": 1992,
    "Image": "David_Kronkright.jpg",
    "Bio URL": "Mike_Kronkright",
    "bio": "\n1992 Hall of Fame Inductee Mike Kronkright – Grand junction\nMyron Myles “Mike” Kronkright was born Oct. 4, 1922 in Litchfield, Nebraska. He married Ellen S.\nSwanson in Loup City, Nebraska and served in the U.S. Marines in the South Pacific, New Caledonia and\nGuadalcanal during World War II. He was also involved with the Navajo Code Talkers.\nThe Kronkrights moved to western Colorado in 1950 and it was a love of sports that got Mike involved in\nofficiating. Mike was involved the newly-formed Grand Junction Football Officials Association. His\nfootball officiating career launched in 1956. He covered area high school and Mesa Junior College games\nand worked Rocky Mountain Athletic Conference games after Mesa became a four-year institution.\nFootball was just the beginning for Mike — he went on to become a multi-sport referee and umpire.\nMike began umpiring baseball games in 1958, working high school and college games. He was a member\nof Colorado High School Activities Association playoff baseball officiating crews for much of his career,\nincluding 10 state championships and three all-state games. He officiated the Junior College World\nSeries for two years and was an alternate for several more.\nAs an accomplished basketball referee, he worked 27 straight Gunnison Valley League tournaments and\na few of the state basketball tournaments, including four championship games and two all-star games.\nMike was considered one of the state’s elite officials. Among the many aspects to his career that sets\nhim apart from others was his unselfish work in working with younger officials. Because of his work with\nthe younger officials, Colorado has achieved a reputation for quality officiating statewide.\nThe National Association for Basketball Officials adopted a pregame conference sheet developed by\nMike in the 1970s. “I think that was one of my most rewarding endeavors when the national group\nrecognized me that way,” he said in a story detailing his career.\nMike retired from basketball court and football field duties in 1986 but remained active in officiating,\nassigning football and basketball officials for area schools. Mike said that he has enjoyed the time spent\nofficiating and was lucky to work as long as he did. He said watching “the progression of sports as they\ngrew and changed. Just being a part of that process was very rewarding”.\nThe Grand Junction City Council passed a resolution in August, 1988 to rename the Pomona Park softball\nfields the “Kronkright Softball Complex.” A story said Mike had officiated about 1,000 varsity basketball\ngames, 600 varsity football games and “about the same number” of softball and baseball games.\nEven after “retirement,” Mike still donned the softball umpires’ uniform twice a week to keep his love\naffair with sports going."
  },
  {
    "Name": "Harry Wise",
    "Year": 1992,
    "Image": "Harry_Wise.jpg",
    "Bio URL": "Harry_Wise",
    "bio": "\n1992 Hall of Fame Inductee Harry Wise – Englewood\nKnown for his ability to keep his field in the Denver suburb of Englewood groomed to near-perfection,\nHarry Wise was a baseball coaching legend both as a high school and American Legion and Basin League\ncoach. The field at Englewood High School is appropriately named Harry Wise Field!\nHarry Wise Field was the home to the Colorado Baseball Coaches All State Games for many years and\nHarry was the only groundskeeper for all those years!\nHarry coached for 41 years in Colorado amassing over 500 wins during his tenure at Englewood High\nSchool. His teams were a constant in the league and state playoffs over the years. His 1960 team was a\nrunner up to eventual champion Denver South. Harry‘s son, Mike pitched and played for him in the\nearly 1970’s!\nHarry also managed the Winner baseball club in the Basin League, which was one of the top college\nbaseball leagues in the 1960’s and 1970’s. The Basin League was a hotbed for top college players and\nfuture major leaguers. Harry was the closer on those teams which included future major leaguers and\nMLB World Series pitchers Jim Lonborg and Jim Palmer.\nHe played for the 1949 Colorado State College (now UNC) club that made it to the NCAA regional’s. He\npitched and beat Southern California in the second game of the three-game series and started Game 3,\nleaving with a 7-0 lead. But the Bears dropped the game 8-7. Nevertheless, Wise was named to the All-\nAmerica team for the 1949 season"
  },
  {
    "Name": "Roger Kinney",
    "Year": 1993,
    "Image": "Roger_Kinney.jpg",
    "Bio URL": "Roger_Kinney",
    "bio": "\n1993 Hall of Fame Inductee Roger Kinney – Denver\nColorado has been a part of Roger Kinney’s life from day one!\nBorn and raised in Denver, Roger’s involvement in sports started in the early 1950s as a standout\nbasketball and baseball player at East High School where he led the city’s prep league in batting. He\ncontinued his baseball career at the University of Colorado where he earned a bachelor’s degree in\n1960.\nAn accountant with a master’s degree from the University of Denver in 1964, Roger started his “behind\nthe scenes” involvement in the Colorado sporting community in the 1960s as a member of the Metro\nSports Committee.\nAfter assuming the leadership of the Metro Sports Committee along with becoming the president of the\nColorado Sports Hall of Fame, Roger organized the effort to bring the NCAA national basketball\ntournament to Denver and McNichols Sports Arena.\nWith the help of Colorado Sports Hall of Famers Vince Boryla, Eddie Crowder and Bill Daniels along with\nthe likes of President Gerald Ford, Mayor Federico Peña, Johnny Dee, Dick Eicher, Arnie Ferrin and Bob\nLee, Roger’s stewardship led to Denver’s hosting NCAA regionals in 1985 and 1989 before staging the\n“Final Four” in 1990.\n“We wanted to do something to put Denver back into the national spotlight after we had turned down\nthe 1976 Winter Olympics,” said Roger in a 2010 Denver Post article by Irv Moss. “We were told to try to\ndo something special with our bid. We had a committee member hand-carry our bid and personally\npresent it to each of the selection committee members.”\nRoger’s Metro Sports Committee involvement also led him to his contributions in bringing a Major\nLeague Baseball franchise to the “Centennial State”. He was a member of the Metro Stadium Authority\nalong with being the executive director of the Denver Baseball Commission.\nOnce MLB awarded Denver a franchise in 1991, Roger became the first employee of the Colorado\nRockies where he served as the club’s executive director of the Colorado Rockies Foundation and\ndirector of Community Outreach Programs until 2003.\n“The baseball campaign was different,” Kinney said in the Denver Post article. “In both cases, we had\nwell-meaning people, and everybody worked together. The Final Four is the greatest basketball\ntournament in the world. Major-league baseball has been a reward for Denver. The impact of the two\nhas been pretty darn exciting.”\nRoger said his “accounting background had led me into a community service project where I could\ncombine business with my passion for sports. I know that that the success of the national basketball\ntournaments had a positive impact for Denver, especially for future sports events, tourism and the\nconvention business.”\nAs former Denver journalist Sam Adams wrote in his recommendation for Kinney’s induction into the\nColorado Sports Hall of Fame, “The man has 100 hands, it seems, all having been put to great use over\nthe years – from playing infield at East and CU, to pointing toward new opportunities to enhance\nColorado’s presence on the national sporting scene.”"
  },
  {
    "Name": "Dick Cartin",
    "Year": 1993,
    "Image": "Dick_Cartin.jpg",
    "Bio URL": "Dick_Cartin",
    "bio": "\n1993 Hall of Fame Inductee Dick Cartin – Lakewood\nRichard “Dick” Daniel Cartin was born in Watertown, New York, July 19, 1941 and he served in the US\nNavy for four years. Dick spent most of his adult life in Lakewood, Colorado, and was a teacher of High\nSchool Alternative Education in Jefferson County for 30 years. He was recognized by News Center\n4/Rocky Mountain News as a “Teacher Who Makes a Difference” and he received the Wheat Ridge\nChamber of Commerce “Outstanding Educator Award”. Dick was one of the founding members of\nJefferson County Colorado Sports Officials in the 1970’s.\nDick came to retire in Cedaredge six years ago to be closer to the incredible fishing and has since poured\nhimself into this town he grew to love. He was passionate about being a force for good in Cedaredge.\nDick served on the Cedaredge Board of Trustees, the Planning Commission, he was an integral part of\nthe “Adopt-A-Highway” program, and he delivered meals to seniors in need and folks homebound with\nCOVID. After retiring, Dick continued working with students developing and implementing alternative\neducation programs and mentoring. Dick enjoyed the beauty of cross-country skiing, hiking, fishing, and\ncamping on the Grand Mesa."
  },
  {
    "Name": "Ernest Cavalieri",
    "Year": 1993,
    "Image": "Ernest_Cavalieri.jpg",
    "Bio URL": "Ernest_Cavalieri",
    "bio": "\n"
  },
  {
    "Name": "Nick Vitale",
    "Year": 1993,
    "Image": "Nick_Vitale.jpg",
    "Bio URL": "Nick_Vitale",
    "bio": "\n"
  },
  {
    "Name": "Wiley Chance",
    "Year": 1994,
    "Image": "Wiley_Chance.jpg",
    "Bio URL": "Wiley_Chance",
    "bio": "\n"
  },
  {
    "Name": "Vic Damon",
    "Year": 1994,
    "Image": "Vic_Damon.jpg",
    "Bio URL": "Vic_Damon",
    "bio": "\n"
  },
  {
    "Name": "Jim Darden",
    "Year": 1994,
    "Image": "Jim_Darden.jpg",
    "Bio URL": "Jim_Darden",
    "bio": "\n1994 Hall of Fame Inductee Jim Darden – Denver\nJim Darden has established his reputation as a basketball player with the original Denver Nuggets and as\na college basketball coach at Colorado School of Mines.\n“When I was 17, we’d just won the Wyoming (high school) state baseball championship. I was selected\nas third baseman on the All-District team and had a chance to sign with the Cleveland Indians. My folks\nwouldn’t hear of it. They said no, I was too young and I was going to college.”\nTo the University of Wyoming in particular, where he was a member of the 1943 NCAA championship\nbasketball team. For the better part of that season, Darden was a starting guard, playing in the shadow\nof All-American running mate Kenny Sailors. However, he did not play in the tournament itself. Those\nwere World War II years and Darden was inducted into the Army infantry before season’s end.\nDischarged in 1946, he joined the Denver Nuggets, who played in the then powerful Amateur Athletic\nUnion circuit. “In 1946, the two best basketball teams in the country were the Phillips 66ers and the\nDenver Nuggets,” Darden says flat out.\nWhen professional basketball in the form of the National Basketball League, came to Denver in 1949,\nDarden signed on. “But to tell you the truth, I made more money playing AAU ball,” he says. As a high\nscoring Nugget guard, Darden was runner-up as Rookie of the Year to Dolph Schayes.\nYou know, of all the things I’m most proud of,” says Darden, “the thing that I think is my real claim to\nfame, is that I played (competitive) softball until I was 50.” Darden also reflected on the start of his 35\nyears of basketball and baseball coaching at Mines that began in 1954. He became a fixture at the\nGolden, Colorado school. Starting the 1988-89 season, Darden had won 367 basketball games, 19th on\nthe all-time NAIA career chart. He has been selected as the Rocky Mountain Athletic Conference Coach\nof the Year five times and NAIA District 7 Coach of the Year three times.\nWhile Darden’s accomplishments as a player and a coach speak for themselves, it is fitting that he is\ninduction in the Colorado Sports Hall of Fame as a man who embodies the best of sport—fierce,\ncompetitive fire, but always a gentleman."
  },
  {
    "Name": "Lou Nedbalski",
    "Year": 1994,
    "Image": "Lou_Nedbalski.jpg",
    "Bio URL": "Lou_Nedbalski",
    "bio": "\n1994 Hall of Fame Inductee Lou Nedbalski – Denver\nLou Nedbalski was born Jan. 9, 1916, in Denver. He and Leila Cheney met at a dance in 1939 at the\nold Crystal Hall, and were married Jan. 14, 1940, in Denver. They have a daughter and son with five\ngrandsons.\nLou Nedbalski was quick to tell a joke. But he was Silent Sam when it came to talking about himself\nand his heroics. Like the time he saved a fellow firefighter's life. No one knew until John Horan told\nthe story. There was a fire on Larimer Street in the 1950s. Horan's grandfather was trapped in a\nbuilding that collapsed. Lou went into the ruins and hauled the elder Horan to safety.\nLou, a retired Denver assistant fire chief, had many nicknames in his life - \"Ned\" when he played\nbaseball and basketball at Manual High School and in his early 20s; \"Sluggo\" when he was a\nheavyweight boxer; \"Cool Lou\" when he was a Denver firefighter.\nHe was quite the athlete, and was fond of telling people, \"If it's worth playing, it's worth winning.\"\nBut he turned down an athletic scholarship at Regis College to support his family.\nHe grew up by the stockyards near Globeville. Life was tough, and he had to work early on. He sold\nnewspapers in front of the Cathedral of the Immaculate Conception. Later, he was a plumber.\nHe learned to pinch pennies because he had to. It became a joke later in life.\nFor instance, in 1982 he had to go for a department physical at the old Denver General Hospital, All\nthe parking spaces for city officials were full, so Lou paid 25 cents at a parking meter, and then\nwrote a letter of complaint to parking officials. Lou was reimbursed. His boss, Jack King, received a\nresponse from Milo Schram, assistant administrator of the city's treasury division. \"At the time I\nreceived your request, I could not believe that a Denver fire chief could be so hard up as to miss a\nlousy quarter,\" Schram wrote.\n\"However, when you informed me that the fire chief was 'Cool Lou' from old Globeville, we knew\nthat we had trouble.\" Schram said city employees checked 214 parking meters before finding Lou's\nquarter. And they knew it was his because \"his thumb and fingerprint had thoroughly squashed the\nedge of the coin.\"\nBut Lou was also generous, said his grandson, Terry Nedbalski, who said his grandfather \"wore the\nsame suit for 20 years, and wouldn't spend a dime on himself, but would literally give his family the\nshirt off his back.\"\nLou joined the fire department in 1941. Two months later, he was drafted into the Army and served\nas a firefighter in Italy during World War II. Most firefighters have second jobs that they work on\ntheir days off. Lou was no different. He was a baseball umpire and basketball referee at the high\nschool and college levels. Lou taught himself to play piano and guitar."
  },
  {
    "Name": "Don Cimaglia",
    "Year": 1995,
    "Image": "Don_Cimaglia.jpg",
    "Bio URL": "Don_Cimaglia",
    "bio": "\n"
  },
  {
    "Name": "Sid Peretti",
    "Year": 1995,
    "Image": "Sid_Peretti.jpg",
    "Bio URL": "Sid_Peretti",
    "bio": "\n"
  },
  {
    "Name": "Bob Westhoff",
    "Year": 1995,
    "Image": "Bob_Westhoff.jpg",
    "Bio URL": "Bob_Westhoff",
    "bio": "\n"
  },
  {
    "Name": "Bud Best",
    "Year": 1996,
    "Image": "Bud_Best.jpg",
    "Bio URL": "Bud_Best",
    "bio": "\n1996 Hall of Fame Inductee Warren P. \"Bud\" Best – Greeley\nWarren P. \"Bud\" Best has been an educator, coach and official since he left Wayne State College\nNebraska after serving on active military duty in the South Pacific during WWII as a flight engineer on a\nNavy patrol bomber. He was a high school and college head coach in football, basketball, swimming\nand track and also played semi pro baseball. Bud was a four year college letterman in football\nbasketball and track and held the 100 yard dash record for over 30 years at Wayne State.\nBud started umpiring in 1961 after serving as a coach on the Colorado State College baseball team and\nworked several high school and American Legion play-off and state games. Bud was an educational\nadministrator for the University of Northern Colorado from 1967-1985 and has been recognized as an\noutstanding college and high school football and basketball official. He is honored in the Wayne State\nHall of Fame along with Greeley Baseball Umpires Association Award for many years of service and\ndedication as an assignor and official."
  },
  {
    "Name": "Jim Dorsey",
    "Year": 1996,
    "Image": "Jim_Dorsey.jpg",
    "Bio URL": "Jim_Dorsey",
    "bio": "\n1996 Hall of Fame Inductee Jim Dorsey – Littleton\nJim Dorsey umpired Colorado high school, American Legion and college baseball from 1961 to 1981.\nHis high school on-field experience includes 15 years of playoffs and three state tournaments, along\nwith several American Legion playoffs. He also worked the Western Athletic Conference, RMAC and\nDenver University.\nJim left umpiring due to the workload in the Sheridan High School administration. He has served in\nmany capacities with CHSBUA, including Local Director, Executive Committee, Assignor and State\nPresident from 1979 - 1981. Jim still observes/assesses over 40 games per season, assigns officials for\nMetro League, and credits Julius Carabello for contributing the most to his umpiring career."
  },
  {
    "Name": "Richard Fanning",
    "Year": 2007,
    "Image": "Richard_Fanning.jpg",
    "Bio URL": "Richard_Fanning",
    "bio": "\n2007 Hall of Fame Inductee Richard 'Dick' L. Fanning – Colorado\nSprings\nDick has kept very busy throughout his life. He taught for 32 years, 30 for the Air\nAcademy School District. He coached high school baseball for 16 years as a head coach,\nand 9 years as an assistant or volunteer coach. Dick has won over 800 games between\nhigh school, Legion A, Connie Mack and Babe Ruth baseball games. In 1982, Dick\ncoached for The National Sports Festival, West Team in Indianapolis, Indiana. He was\nalso a scout for the Milwaukee Brewers from 1993 until 1999.\nOn a light note, Dick unofficially took the first Colorado high school baseball team to\nArizona to practice during spring break. He said he \"took some heat for that.\"\nDick was a member of the Colorado Springs Umpire Association from 1968 until 1975\nand a 25-year member of the American Baseball Coaches Association. He served as\nDistrict Chairman for 6 years on the High School Committee of the American Baseball\nCoaches Association and the National High School Committee of the American Baseball\nCoaches Association, All American Committee.\nDick has many accomplishments and honors. He was Colorado Springs Baseball Coach\nof the Year 1980, 1984 and 1989. He was Colorado Baseball Coach of the Year 1989 and\nvoted the District 6 Coach of the Year by the American Baseball Coaches Association in\n1989. His team won the State Baseball Championship that year as well. Dick was\nselected as Mr. Baseball 1992 by the Colorado High School Baseball Coaches\nAssociation. He was twice voted Volunteer Coach of the Year by the American Baseball\nCoaches Association for his volunteer efforts coaching his high school team in the\nsummer.\nDick's contributions are also many. He was vice-president of the Colorado H.S. Baseball\nCoaches Association in 1983 and then President of the association in 1984. He served\non the Colorado H.S. Activities Association Baseball Committee in 1983-84. He spoke on\ntwo occasions at the Colorado H.S. Baseball Coaches Clinic and written three articles on\nbaseball for the Colorado H.S. Coaches Association. Dick served four years on the\ncommittee to select the Top 40 Seniors to play in the Senior All Star Game held annually\nat Coors Field.\nDick attended Shawnee Mission North High School in Shawnee Mission Kansas and\ngraduated in 1959. He played baseball at Kansas University from 1962-64 where he\nalso earned his B.S. Dick eventually went to Adams State in Alamosa, Colorado and\nearned his Master’s in 1983. He also spent 3 years in the U.S. Army as a 2nd Lieutenant\nto the Captain. Dick and wife Susan for 39 years now and they have two children."
  },
  {
    "Name": "Tom Freed",
    "Year": 1996,
    "Image": "Tom_Freed.jpg",
    "Bio URL": "Tom_Freed",
    "bio": "\n1996 Hall of Fame Inductee Tom Freed – Las Animas\nTom Freed started his umpiring career in 1960 and retired in 1984. He coached little league and\numpiring in Las Animas and other southeastern towns. At that time, umpires contacted the high\nschools for games and the pay was $10 to $15 per game (no mileage). Umpires often lined the fields,\nput bases in place and cleared the field. Tom joined the Lamar Umpire Association in 1964 and the La\nJunta Umpires in 1971. He worked regional, district and state tournaments along with Otero and\nTrinidad Junior College Baseball.\nThroughout his career he worked at the VA Hospital in Ft Lyons until retiring in 1980. Then a substitute\nteacher and administrative assistant at Las Animas High School and has been municipal judge from\n1973 until the present time."
  },
  {
    "Name": "Joe Rossi",
    "Year": 1996,
    "Image": "Joe_Rossi.jpg",
    "Bio URL": "Joe_Rossi",
    "bio": "\n1996 Hall of Fame inductee Joe Rossi – Arvada\nPresenter, Bud Schoepflin\nJoe started umpiring in the summer of 1959 and began doing high school games in 1960 and college in\n1962. He umpired in numerous high schools, A and B Legion, Stan Musial, Semi-pro and college baseball\ngames. He worked state playoffs and championship games in every baseball division. Joe was best\nknown as a low zone umpire in the state of Colorado and was able to keep that reputation throughout\nhis career. Now retired from the U.S. Postal Service, he is the CHSBUA Honorary Chairman and active in\nthe high school umpire assessment program and was on the committee to organize the CHSBUA in 1963"
  },
  {
    "Name": "Howard Dunbar",
    "Year": 1997,
    "Image": "Howard_Dunbar.jpg",
    "Bio URL": "Howard_Dunbar",
    "bio": "\n1997 Hall of Fame Inductee Howard Dunbar – Cheyenne, Wyoming\nThe late Howard Dunbar began his career as a sports official during a tour of duty with the U.S. Air\nForce, then called the Army Air Corps, shortly after the end of World War II. During this time, he\nserved as Sports Commissioner for baseball, softball, basketball, and volleyball for U.S. personnel.\nUpon his transfer to Warren Air Force Base in Cheyenne, he continued to officiate high school sports in\nWyoming as well as working in Nebraska and Colorado.\nHoward also worked in the Western Athletic Conference as a football official. After a career spanning\n59 years, Howard retired from officiating after a career which saw him work softball for 50 cents per\ngame (1934; the sport's second year) and where he assisted in the founding of the Eastern Wyoming\nSports Officials Association (in 1980).\nHis legacy to the sport also includes the naming of a sports facility in his honor. Dunbar Field was\ncreated by Cheyenne City Council resolution in 1994 in honor of Howard's \"outstanding citizenship\nand contributions of time, energy and spirit to improve the quality of life in Cheyenne through its\nsporting activities.\"\nHoward died December 30, 1993 and is survived by his wife, Gwen and a family of two girls and one\nboy."
  },
  {
    "Name": "Cliff Hendrick",
    "Year": 1997,
    "Image": "Cliff_Hendrick.jpg",
    "Bio URL": "Cliff_Hendrick",
    "bio": "\n1997 Hall of Fame Inductee H. Cliff Hendrick – Denver\nH. Clifford Hendrick was one of the first of the new breed of \"young lions\" to come upon the officiating\nscene during the 1970's. The son of the town doctor, and a former standout basketball player at\nRoaring Fork High School in Carbondale, Colorado, Cliff joined CHSBUA in 1970 and quickly\ndistinguished himself as the sport's top \"rookie\" arbiter.\nIn 1971 he was selected to his first postseason playoff, beginning an unbroken string of tournament\nselections which was to last until his retirement from high school baseball in 1990. But before he\n\"hung 'em up,\" Cliff worked the state tournament from 1982-90, including five state championship\ngames.\nCollegiately, Cliff worked in the Big 8 and WAC and was assigned 1986 Western Athletic Conference\nChampionship Series in San Diego, California. For nine years, beginning in 1983, Cliff was also an\nalternate umpire for the American Association (Professional AAA) working with big leaguers like Drew\nCoble (American League Crew Chief) among others.\nAdministratively, Cliff served as supervisor of umpires for The University of Wyoming, assigned the\nHigh School All-Star games for several years, organized the Honorary Group inductions, as well as\nserving as Denver area director for the CHSBUA and supervisor of umpires for the Skyline League and\nFront Range League. Cliff has been a science teacher in the Cherry Creek schools since 1974."
  },
  {
    "Name": "Ed Underwood",
    "Year": 1997,
    "Image": "Ed_Underwood.jpg",
    "Bio URL": "Ed_Underwood",
    "bio": "\n1997 Hall of Fame Inductee Edward \"Eddie\" Underwood – Ft. Morgan\nEdward \"Eddie\" Underwood was a past Commander of Harold Dehaan Post #19, Fort Morgan\nColorado Department of the American Legion. He was widely known for his dedication to Legion\nBaseball, serving as local chairman in Fort Morgan for over 35 years, in addition serving as State Legion\nChairman for 15 years, in 1976, he organized the State \"C\" program so that boys in a younger age\ngroup could begin taking part in Legion Baseball Along with organizing 26 State Legion Tournaments.\nHe was the force behind the local Fort Morgan program, stumping all over town lining up coaches,\numpires and sponsors. To pay the bills, he set up Bingo games on Sunday and Wednesday nights at the\nLegion Club and solicited donations from local businesses. He always said that, \"We do it for the kids.\nWithout the support of the community and the Legion Post, the program never could have kept going\non.\nEd had three boys and two grandsons who played in the Legion Baseball Program at Fort Morgan. The\nAmerican Legion Baseball program lost a great man when Ed passed away Feb. 2, 1994."
  },
  {
    "Name": "Howard Wentz",
    "Year": 1997,
    "Image": "Howard_Wentz.jpg",
    "Bio URL": "Howard_Wentz",
    "bio": "\n1997 Hall of Fame Inductee Howard Wentz – Aurora\nHoward Wentz started officiating in the Army while stationed in Germany in 1963. He retired 21 years\nlater when, as Howard writes, \"My mind would say, 'Get down in position behind the catcher' and my\nknees would say 'To heck with it. Just let it go'.\" In between times, Howard worked little league\nbaseball at Fitzsimons Army Hospital, Girls Fastpitch Softball, American Legion Baseball, as well as\nbaseball in the Rocky Mountain Athletic Conference:\nHis list of mentors and associates in the sport reads like a \"Who's Who\" in Colorado Baseball, from his\ninvolvement with the Rocky Mountain Umpire's Association and men like Julie Carabello and David\nLetofsky who demonstrated how \"the mechanics of hard-working umpires” paid off in the respect of\nthe coaches to his performances in front of legendary baseball coaches like John DeSiato, Terry\nSchiessler, and the irascible Harry Wise, who as Howard writes, \"was noted for eating umpires alive!\"\nHoward's influence extended to his oldest son who now umpires high school and college baseball in\nWashington State, and he still enjoys watching the professional men in blue blow a call now and then;\nproof positive, as Howard writes, \"To err is human, to 'SELL IT IS DIVINE.' \""
  },
  {
    "Name": "Ken Furman",
    "Year": 1998,
    "Image": "Ken_Furman.jpg",
    "Bio URL": "Ken_Furman",
    "bio": "\n1998 Hall of Fame Inductee Ken Furman – Boulder\nKen Furman is perhaps the single most influential person the Colorado High School Baseball Umpire\nAssociation has known. His unparalleled wealth of knowledge and experience, both as a coach,\numpire, and athletic administrator has helped to shape the direction the CHSBUA has taken as an\norganization. His calming influence as both an advisor and mentor has guided the careers of many top\nofficials currently working today.\nKen has literally done it all, and has served with distinction in every capacity. His resume is indicative\nof the respect and confidence he has engendered in those with whom he has been associated. Ken has\nserved in executive capacities as the President of The Colorado High School Coaches Association\n(1970-71). The Boulder Valley Coaches Association, and The Colorado High School Baseball Umpires\nAssociation (1981-84). He was appointed Colorado High School Baseball Rules Interpreter (1989-1997)\nby the CHSBUA Board and was also a two-term Area Director for Boulder/Longmont study group.\nAs an official, Ken's career accomplishments have set a standard of unmatched achievement and\nexcellence. He has been selected to work 16 Colorado State High School tournaments in basketball\nand has worked one NCAA Division I Regional Final (1986). He has been a fixture at the Colorado High\nSchool Baseball Championships for 15 years, and was a charter member of The Colorado Collegiate\nUmpire Association as well.\nAs an educator, Ken has been closely involved with student council and athletic administration. He is a\n29-year member of NBA. CEA and the Boulder Valley Education Association. He is also a member of\nPhi Delta kappa, and was listed in the 1956 edition of Who's Who in American Universities and\nColleges as an undergraduate at The University of Denver where he received his BA. Ken also holds an\nMS University of Colorado (1976), as well as a Type D Administrator Certificate.\nTom Smith of Boulder, a CHSBUA Past President writes of Ken, \"His professional leadership and\ninvolvement has been the largest contributing factor on CHSAA and its programs. Ken's Total\ninvolvement as a teacher, coach, sponsor. referee and umpire has had a positive effect on literally\nthousands of young people and adults.\" A final, lasting tribute to Ken Furman occurred earlier this\nyear. Ken Furman was inducted into the CHSAA Hall of Fame."
  },
  {
    "Name": "Joe Maciel",
    "Year": 1998,
    "Image": "Joe_Maciel.jpg",
    "Bio URL": "Joe_Maciel",
    "bio": "\n1998 Hall of Fame Inductee Joe Maciel – Colorado Springs\nJoe Maciel joined the CHSBUÃ when it was formulated in 1963 and served as or of the first Area\nDirectors for the Colorado Springs group. Joe set the pace early in assisting new officials and evaluated\nthem during actual games.\nThe Army sent Joe Europe for three years in 1968 and he continued his umpiring career overseas\nreceiving the opportunity to work the Army European championship in 1970. Joe return to Colorado\nand rejoined CHSBUA in 1971 in Colorado Springs. He moved to Grand Junction for two years in 1989\nand served as Secretary of that group. When returned to Colorado Springs, he was able to work\nanother three years before knee replacement surgery cut short his almost 30 year umpiring career.\nJoe worked state championship games in 1989 and 1990. He always had a go philosophy and baseball\nsense. Joe applied the rules in a firm and tactful manner a was known for his hustle."
  },
  {
    "Name": "Bob Ferguson",
    "Year": 1999,
    "Image": "Bob_Ferguson.jpg",
    "Bio URL": "Bob_Ferguson",
    "bio": "\n1999 Hall of Fame Inductee Bob Ferguson – Fort Collins\nBob Ferguson has umpired it all from T-Ball all the way up through College. He also umpired in all\nkinds of weather, just like the mailman, in snow, rain, wind and sunshine. One of Bob’s favorite stories\nabout windy games was one year at Rocky Mountain High the wind was blowing so strong that two\nsheets of 4x8 Cellotex came flying across the field. Needless to say, the game was called.\nAnother memorable day was back in the early 70's, Bob was working the plate for a game between\nPoudre & Boulder and when he went down to cover a play at 3rd base, he fell flat on his face. Bob\nhave worked numerous state playoff games. He was Northern Area Director for a number of years.\nOver the years, Bob worked with the Ft. Collins Park and Recreation in their athletic programs. He\nretired from teaching and umpiring about the same time in 1989. Bob was responsible for bringing\nMike Brady into umpiring.\nBob kept busy in retirement by driving a city bus 3 days a week and working for a drywall company."
  },
  {
    "Name": "Bill Lind",
    "Year": 1999,
    "Image": "Bill_Lind.jpg",
    "Bio URL": "Bill_Lind",
    "bio": "\n1999 Hall of Fame Inductee Bill Lind – Colorado Springs\nBill Lind played baseball in Windsor Colorado and was in the Navy for four years. He attended UNC in\nGreeley Colorado and graduated in 1964 with a BA and got an MA in 1967. Bill taught and coached\nBasketball, Baseball and Football.\nBill’s experience as an umpire started with High School Baseball in La Junta in 1972. He worked games\nin Lamar for about four years doing Junior College games during round robin tournaments. Bill did\nHigh School games in and around La Junta for about six years. He then moved to Colorado Springs in\n1979 and started back umpiring there in 1980 and worked until 1996.\nBill served as area director for the Colorado Springs group and helped with a few state clinics. He also\nofficiated Basketball and Football for a number of years. Bill enjoyed the time spent with athletics and\nhave had many wonderful experiences with all of the sports."
  },
  {
    "Name": "Steve Usecheck",
    "Year": 1999,
    "Image": "Steve_Usecheck.jpg",
    "Bio URL": "Steve_Usecheck",
    "bio": "\n1999 Hall of Fame Inductee Steve Usechek, Jr. – Northglenn\nSteve Usechek, Jr. became a member of the Rocky Mountain Umpires Association in about 1968. He\nmaintained membership in RMUA until the CHSBUA formed in the early 1970's. Steve umpired in all of\nthe metropolitan area conferences in high school baseball through 1984. Steve also umpired games for\nthe local colleges and universities including conference games in the Western Athletic Conference and\nthe Big Eight.\nAn important accomplishment for Steve in his career was that he umpired state championship games in\nall classifications of high school baseball at one time or another. Steve served as the assigning\ncommissioner for the Skyline and Front Range high school leagues for several years. He endeavored to\ngive many young umpires the opportunity to work through the ranks as junior varsity and eventually\nvarsity level umpires. He was regarded as an assignor who was fair and gave deserving umpires a chance\nto break in the high school baseball.\nThe umpiring career of Steve Usechek came to an end in 1984 when he accepted positions on the\nbasketball officiating staff of the Western Athletic Conference and the football officiating staff of the Big\nEight. He has continued to work football for the past fifteen years and has worked may bowl games\nincluding the Freedom Citrus, Copper, Las Vegas and Sugar Bowl (twice) games. He was also an alternate\nin the 1994 Rose Bowl.\nSteve has been married to Florence for 34 years and has three daughters and two granddaughters. He\nretired from the Boulder Valley School District in 1998 after a 31-year career as a special education\nteacher. Currently he works for Indian Peaks and The Ranch Country Club golf facilities."
  },
  {
    "Name": "Chris Dittman",
    "Year": 2000,
    "Image": "Chris_Dittman.jpg",
    "Bio URL": "Chris_Dittman",
    "bio": "\n2000 Hall of Fame Inductee Chris Dittman – Westminster\nChris Dittman began umpiring high school baseball in 1972. 16 years later he retired as an active\numpire having been elected to work eight state baseball tournaments, including four state\nchampionship finals at the 5A level. In between, he was recognized as one of the top arbiters in the\nDenver Metro area having been selected as the Baseball Official of the Year by the Jefferson County\nAthletic League.\nHe was also a charter member of the Collegiate Baseball Umpires Association (1979) and remained an\nintegral part of that association for nine years. During Chris' tenure as an active umpire, he helped\ntrain, recruit and advise many of the current men in blue who comprise the Colorado Collegiate\nUmpire Association. Chris jokingly refers to himself as an \"idol\" to one member of that group in\nparticular. It was his guidance and support as one of the respected veterans which was instrumental\nin the formation of the CCUA, the organization from which Rocky Mountain Athletic Association\numpires are selected, as well as arbiters working The Mountain West Conference, Western Athletic\nConference and Big XII Conference.\nAfter Chris hung up his gear as an umpire, he moved into the coaching ranks as the Head Coach of\nRegis University, and also assumed the position of Director of Athletics. As an Athletic Director, Chris\nwas an important voice in the formation of the RMAC baseball conference which opened up many\nopportunities for outstanding Denver umpires to move into the collegiate ranks.\nProfessionally, Chris has come full circle. After a stellar career at Westminster High School, he\nattended Wichita State University (BA 1967) and The University of Colorado (MA 1971). He taught at\nRanum High School and Coached baseball (circa 1975). He returned to \"Westy\" as athletic director and\nis currently the principal at Westminster High School."
  },
  {
    "Name": "Leroy Garzonio",
    "Year": 2000,
    "Image": "Leroy_Garzonio.jpg",
    "Bio URL": "Leroy_Garzonio",
    "bio": "\n2000 Hall of Fame Inductee Leroy Garzonio – Aurora\nLeroy Garzonio started his officiating career over 50 years ago. He began officiating in Illinois in 1948.\nHe married Josephine Campeggio in 1951, and she knew that it was a part of the marriage vows to\naccept officiating sports as part of their life style. Leroy was stationed in the service in Germany and\nKorea, but still kept up his avocation. He later returned to the states and was registered in Michigan,\nIllinois, Missouri and Colorado where he resided since 1975.\nIn Aurora, Leroy officiated in the sports of football, basketball, baseball and softball, both at the high\nschool level and with the Aurora Parks & Recreation Department. Whenever asked to do a game at\nany level, he would never turn it down. His dedication to sports was overwhelming in that he attended\nall meetings for officials and never made excuses for his schedules. All assignors knew him well, and\nwould call on him for makeup games. He even had his equipment stolen from his car, but managed to\nborrow equipment from other officials to do the games.\nLeroy was well liked by all, and was more than willing to help younger officials with rules and\ninterpretations. He was honored by the Parks & Recreation Department of Aurora for his outstanding\nservice, and received the Pioneer Award in Football in 1999 from the Colorado Football Officials\nAssociation.\nWhen Leroy wasn't officiating, he was in his boat on the water fishing. He always told his wife, Jo, that\nhe would return when the fish stopped biting, sometimes not returning home until the night hours. Jo\nsaid she guessed he had another ball game, and that was just an excuse to stay outside.\nLeroy worked his last ball game in the fall of 1998, and passed away on Dec. 14, 1999, in Aurora,\nColorado after a lengthy illness at the age of 83 years. He will be remembered as an official who \"after\nhe was made, they threw away the mold.\" But now we feel that in Heaven, God has his pitchers,\ncatchers, infielders, outfielders and his sports fans. Now God's team is complete: He has his umpire!\nLeroy Garzonio, both as an official and human being, will be missed."
  },
  {
    "Name": "Frank Messenger",
    "Year": 2000,
    "Image": "Frank_Messenger.jpg",
    "Bio URL": "Frank_Messenger",
    "bio": "\n2000 Hall of Fame Inductee Frank Messenger – Fort Collins\nFrank Messenger has umpired from Tobacco Road to South Boulder Road, and in his 27 years as an\numpire he has served on more committees than a senior member of Congress. Among the more\ninteresting accomplishments of Frank's career is the fact that he has umpired high school playoff\ngames for seven straight years, in both North Carolina and Colorado.\nHe has been an advisor to the top umpire groups in the Denver Metro area having served as President\nof the Rocky Mountain Umpires Association, and sat on the board of directors of the Rocky Mountain\nSports Officials Association. He was also a member of the Colorado Baseball Umpires Association\nExecutive Committee.\nWhen not tied up in committee meetings, Frank also has seen action on the softball diamond. As a\nmember of the Amateur Softball Association, he has worked nine state tournaments and four regional\ntournaments. The Denver Recreation Department also tabbed Frank to conduct umpire training\nclinics.\nWhen Frank retired from active umpiring, his involvement in athletics didn't end. Many veteran\numpires remember Frank coaching at several schools in the Metro League. He guided his girls\nbasketball teams to two state tournaments, and was named Metropolitan League Coach of the Year in\n1990 and 1991, as well as Denver Post Coach of the Year in 1990. As a baseball coach, Frank was\nMetropolitan League Coach of the Year in 1995. The crowning achievement of his coaching career was\nhis election into the Metropolitan League Hall of Fame.\nFrank has been very active with youth outside of his duties as a teacher and a coach having worked as\na camp counselor and recreation director. He graduated from Regis High School and received his\ndegree from Regis College (BA Sociology/PE). He holds a Colorado Teaching Certificate with\nendorsements in elementary education and junior high mathematics. Frank is currently teaching and\ncoaching at Elbert High School and makes his home in Elbert, Colorado with his wife, Nancy."
  },
  {
    "Name": "Del Petersen",
    "Year": 2000,
    "Image": "Del_Petersen.jpg",
    "Bio URL": "Del_Petersen",
    "bio": "\n"
  },
  {
    "Name": "Richard Chandler",
    "Year": 2001,
    "Image": "Richard_Chandler.jpg",
    "Bio URL": "Richard_Chandler",
    "bio": "\n2001 Hall of Fame Inductee Richard Chandler – Golden\nRichard Chandler left the farm in Yuma for Colorado State Teachers College, now UNC,\npacking his tennis shoes and favorite jump shot. It was not long after graduation that his\nlove of athletics found him patrolling the hardwood packing a whistle and striped shirt. But,\nhis job as an educator left plenty of time for him to pack a few more things in his duffel bag-\nthings like a chest protector, leg guards and catcher's mask. So, during summers, with the\nfarm chores done, it was only natural for him to start calling balls and strikes.\nRich umpired for 31 years and distinguished himself as a top arbiter, both in baseball and\nsoftball, in the Denver Metro area. For twenty years, Rich was a fixture at the CHSAA State\nTournament working five big school (SA-6A) championship games, his last in 1995 with\nveteran Joe Rossi and promising young rookie, Tom Pontarelli. Rich also worked the 3A\nclassification championship game for 6 straight years before that. All in all, Rich has worked\n11 CHSAA State High School Baseball Championship games, a tenure virtually without\nparallel in Colorado baseball umpiring circles. He was also a standout college baseball\numpire, working games in the Western Athletic Conference for 17 years and Big 8 baseball\nfor 8 years.\nRich has recently retired from a very successful teaching career where he established\nhimself as a top basketball coach as well as athletic administrator. He also handled the\nprincipal's job for several Jefferson County summer school sessions. In his spare time, he\nteaches driver's education and can be seen white-knuckling it along the highways and\nbyways of Denver.\nRich served as a Denver Director for the Colorado High School Baseball Umpires Association\nfrom 1985-88 and has recently retired from his post as Athletic Director at Standley Lake\nHigh School. While at Standley Lake he directed a restructuring of the athletic department\nwhich led to JEFFCO championships and state rankings in both baseball and wrestling.\nRich currently works as a football official in the Western Athletic Conference and will be\npart of the CHSBUA Umpire Evaluation Committee next year. He lives in Golden, Colorado\nwith his wife Cynthia."
  },
  {
    "Name": "Richard Hawkins",
    "Year": 2001,
    "Image": "Richard_Hawkins.jpg",
    "Bio URL": "Richard_Hawkins",
    "bio": "\n2001 Hall of Fame Inductee Richard Hawkins – Aurora\nRichard Hawkins is a man who has seen a lot of action, both on and off the baseball field.\n\"Hawk\" is a veritable treasure trove of American Military History having seen action in\nthree major wars, from World War II to Korea to Vietnam. Although most of his umpiring\nbrethren were used to seeing him in the standard blue uniform of the umpire. Hawk's\ncomrades in arms knew him best as a top-drawer Chief Master Sergeant who served our\ncountry for 28 years in The United States Air Force. Hawk turned to the \"Wild Blue Yonder\"\nafter a four-year hitch in the United States Army during which he saw action as a machine\ngunner in the European Theatre of Operations, from D-Day to V-E Day and every other day\nin between.\nHawk's reasons for turning in his combat fatigues for the Air Force blues, 54 years ago, did\nnot suggest his love of baseball. As Hawk recalls, it was during a break in the overcast\nduring his involvement in the famous Battle of the Bulge when the Air Force was able to\nresupply and provide air support to a combat ground force slugging it out with the Nazis.\n\"They really saved our asses that day,\" Hawk recalled, explaining his switch to the Air Force.\nWith Hawk's Army Air Corps enlistment came his involvement with baseball. Hawk’s career\nfrom Army machine gunner, to flyboy umpire came in 1950 when he was stationed at Scott\nAir Force Base where he saw slightly less hazardous duty working the Clinton County\nBaseball League. It was not long until an overseas military assignment prompted his entry\ninto military and local Japanese College baseball and three appearances at the Far East\nWorld Series, armed with only a plate brush and ball-strike indicator, in 1952.\nAfter attending the George Barr Umpire School in Japan, Hawk returned stateside and\nworked as a Florida State League reserve umpire. Another transfer sent Hawk to California\nwhere he worked high school, college, and semi-pro ball before being sent half a world away\nwhere he worked baseball in Okinawa from 1960-64. A highlight of Hawk's Okinawa tour\nwas his assignment to the Detroit Tigers vs. Military All-Stars game in 1961. After Hawk\nconquered Okinawa, he returned to California and a successful high school and college\ncareer where he was selected to work the CIF Baseball Championships. A quick tour in\nVietnam was followed by more California baseball and another CIF Championship\nassignment.\nHawk finally made it to Colorado in 1976 and distinguished himself as a top arbiter working\nhigh school and Rocky Mountain Athletic Conference baseball. For many years Hawk was a\nfixture in the Men’s Senior Baseball League as well as local legion baseball. In 1992, Hawk\nwas drafted again into international service working Olympic Baseball when Team USA\nbattled Team Cuba at Denver's Mile High Stadium in front of a record crowd of over 66.000.\nOn a much smaller scale, but equally as important, Hawk worked high school playoffs in\nvirtually every league in the Denver Metro Area for over 25 years. He served as the Denver\nDirector for CHSBUA, was a valuable clinician at CHSBUA Master Clinics, and was a \"Top\nSergeant\" for many new umpires and got them through their first battle action on the\nbaseball diamond. Hawk is still active as an evaluator for CHSBUA and lives in Aurora with\nhis wife Doris."
  },
  {
    "Name": "Gordon Cooper",
    "Year": 2002,
    "Image": "Gordon_Cooper.jpg",
    "Bio URL": "Gordon_Cooper",
    "bio": "\n2002 Hall of Fame Inductee Gordon R. Cooper – Rifle\nGordon was born on April 1, 1930 in McGill Nevada. He was married to Vonda G. (Larson)\nCooper in 1951. They had two children; Gordon Steven Cooper was born in 1957 followed\nby Shawn Roger Cooper in 1959. His education began at White Pine County High School in\nEly, Nevada in 1948. Gordon was later awarded a B.A. Degree at the University of Denver in\n1952. He played football and baseball. He was All Conference in football and baseball for 3\nyears. He was second string All-American in his senior year in football and set an NCAA pass\nreception record for 106 catches over three vears ending in 1952.\nIn 1952, Gordon was drafted in the 7th round by The Detroit Lions. He played three\nexhibition games and then was drafted into the U.S. Army. Gordon spent 18 months in\nGermany, returning to The University of Denver in 1955 to secure his Master's Degree and\nthen on to receive his M.A. Degree in 1956.\nIn the fall of 1956, he started coaching and teaching at Rifle High School, Rifle, Colorado. He\ncoached football, baseball, and track. During that time, he had one Track State\nChampionship (1963) one Football State Championship (1973) and one tie for Football\nState Championship (1961), two State Championships in baseball (1981 and 1985). He also\ncoached wrestling for a few years having four individual State Champions. Gordon was\nvoted AA Coach of the Year in baseball (1981, 1984 and 1986.) In 1999 Gordon was\ninducted into the Colorado High School Coaches Association Hall of Fame and in 1987,\nGordon retired from Rifle High School."
  },
  {
    "Name": "Pat Haggerty",
    "Year": 2002,
    "Image": "Pat_Haggerty.jpg",
    "Bio URL": "Pat_Haggerty",
    "bio": "\n2002 Hall of Fame Inductee Pat Haggerty – Denver\nPat Haggerty was born in June, 1927 in Denver, Colorado and lived until December, 1994.\nHe taught and coached at Abraham Lincoln High School.\nPat graduated from North High in 1944. He served a short time in the Navy and then went\nto Greeley for three years and then signed a pro-baseball contract with Detroit. He won a\nbatting title in 1950 with the Toledo Mud Hens in the Southern Association. He played his\nfinal years with the Denver Bears.\nPat became an official during the off-seasons in pro-baseball. He officiated high school and\ncollege basketball and worked many state tournaments. He refereed football for high\nschool, college (Skyline, Big 8 and WAC) and worked the Orange Bowl. He went into the NFL\nin 1962 and was the Referee in three Super Bowls. When Pat retired from the NFL, he was\nthe referee with most years worked. He has been acknowledged as one of the finest\nbasketball and football officials in the country (USA). Pat gave many speeches about his\ncareer as an NFL referee.\nHe was the first baseball coach at Lincoln High School and retired in 1990. He led the\nLancers to three city championships and two times as state runners-up. Pat Haggerty was a\nfine leader of young people in his coaching days. Pat is in the Denver Public Schools Sports\nHall of Fame."
  },
  {
    "Name": "Jim Jenkins",
    "Year": 2002,
    "Image": "Jim_Jenkins.jpg",
    "Bio URL": "Jim_Jenkins",
    "bio": "\n2002 Hall of Fame Inductee Jim Jenkins – Westminster\nJim Jenkins was born and raised in Westminster, Colorado. He graduated from Westminster\nHigh School in 1959. He went on to Colorado State University. After he graduated from CSU,\nJim began his teaching and coaching career at Ranum High School. He coached baseball at\nRanum from 1968 to 1982. He enjoyed unprecedented success at Ranum. His overall won-\nloss record during his nineteen-year coaching career was 255-76-2. He won one state\nchampionship, finished second once and third once. His teams won ten Skyline League\nchampionships. He was selected as Skyline Coach of the Year four times. He was also\nselected as the District and State Coach of the Year once.\nMany of Jim's players went on to play college baseball and several played professionally. Jim\nwas always honest and fair to his players. He very rarely yelled at umpires and never at his\nkids. He was a student of the game and always was willing to incorporate new coaching\nstrategies during preparation for the season. One example was the use of the double\nsqueeze, which he used successfully several times. In one playoff game against a team with\ngreat talent, he had his players bunt six times in a row because his scouting report said this\nteam did not play the bunt well. Ranum scored four runs and went on to win the game and\nadvance to the final four.\nJim was a credit to high school baseball and is most deserving of induction into the CHSBUA"
  },
  {
    "Name": "Ron Piotraschke",
    "Year": 2002,
    "Image": "Ron_Piotraschke.jpg",
    "Bio URL": "Ron_Piotraschke",
    "bio": "\n2002 Hall of Fame Inductee Ronald Piotraschke – Colorado Springs\nRonald Piotraschke graduated from Colorado University in 1954 with a Bachelor of Science\nDegree in Physical Education and started umpiring baseball in Jefferson County with the\nUmpire's Association of Colorado under tutelage of Bill Vincent. Ron learned quickly\nworking midget and junior games with the one-umpire system. Fees were four dollars per\ngame and the usual schedule carried a double header on Saturday followed by another on\nSunday. Ron worked his way up to Legion A and B and finally to semi-pro at the Jefferson\nCounty Fairground. Ron also worked fast pitch softball around the Denver and Englewood\narea.\nAt Cheraw School near LaJunta, Ron was responsible for starting the baseball program and\ntaught there for nine years. He then moved to England for four years and on to Colorado\nSprings where George Theodore and Bob Mullenberg guided his career.\nWhile in Colorado Springs, Ron worked several Class A Tournaments and many district and\nregional games including 3A to 5A championship games. His college games included the Air\nforce Academy and Colorado College. Ron was also responsible for getting the Metro League\nto adopt the three-umpire system for its league tournament. Perhaps his greatest\ncontribution to Colorado Springs officiating was serving as the baseball and softball\nassignor for 17 years retiring in 1994.\nRon was a successful teacher in Colorado for 29 years. He now lives in Fort Collins with his\nwife, Alice. They have two children, Mike and Julie, and one grandson, Sam. He still works\nhigh school softball."
  },
  {
    "Name": "Raymond Powe",
    "Year": 2002,
    "Image": "Raymond_Powe.jpg",
    "Bio URL": "Raymond_Powe",
    "bio": "\n2002 Hall of Fame Inductee Raymond Powe – Colorado Springs\nDuring a 34-year high school officiating career which ran from 1976 to 1999, Ray Powe\nmade significant contributions to five sports. In addition to our national pastime, Ray\nworked football (19 years), basketball (17 years), softball (13 years) and volleyball (five\nyears).\nRay began umpiring youth baseball as a member of the U.S. Army in Germany in 1966. Over\nthe following decade he missed two seasons due to two separate Vietnam tours. When he\nretired from active duty at Fort Carson in 1976, he brought eight years of experience to high\nschool baseball.\nRay soon became one of the most steady and respected umpires in the Colorado Springs\nassociation. He worked district playoffs for ten years, regional playoffs for five years. He\nearned three invitations to state championship games, last appearing behind the plate for\nthe 1996 2A finale. He also worked semi-pro games for the Athletes in Action in the 1980's\nand for Colorado College until their program met its Title IX demise."
  },
  {
    "Name": "Gary Baker",
    "Year": 2003,
    "Image": "Gary_Baker.jpg",
    "Bio URL": "Gary_Baker",
    "bio": "\n2003 Hall of Fame Inductee Gary Baker – Denver\nGary Baker graduated Cathedral High School where he played football, basketball, and\nbaseball. He attended the University of Denver and played freshman football in 1960 (last\nyear DU had football), In 1961-62, Gary attended Mesa Junior College in Grand Junction and\nplayed football in 1961. In 1964, he graduated from the University of Denver with a BA in\nEducation.\nGary’s coaching career included stops at Saint Francis High School in Denver in 1965-66,\nHolyoke High School in Holyoke in 1966-67, Cathedral High School in Denver in 1966-67,\nand Aurora Public Schools: Aurora Central – Aurora Hinkley and Junior High in 1969-80.\nGary umpired High School baseball for 15 years and refereed boys and girls High School\nbasketball for 18 years. He also officiated in the NCAA for 6 years. Gary also umpired one\nsummer season of the Grand Junction Semi-Pro League as well as a season of the Alaska\nSemi-Pro League while partnered with Emit Ashford."
  },
  {
    "Name": "Ross MacAskill",
    "Year": 2003,
    "Image": "Ross_MacAskill.jpg",
    "Bio URL": "Ross_MacAskill",
    "bio": "\n2003 Hall of Fame Inductee Ross MacAskill – Colorado Springs\nRoss MacAskill umpired across the United States starting in 1971 in Virginia, while he was\nstationed with the USMC. Then in 1973-75 Umpire in California and finally finishing his\ncareer in Colorado Springs from 1976-2002. Some of Ross’ accomplishments include the\nBabe Ruth Regional 1980 World Series, Burlington Colorado, the 1983 Olympic Sports\nFestival, Colorado Springs, and am Area Director for CHSBUA in 1987-88. Ross was a state\nchampionship umpire for a couple of games in the late 1980’s as well as in 1992, 1994,\n1997, 2002.\nSome of Ross’ fondness memories were: the players who make it to the Major Leagues, the\nweather challenges during the Colorado High School baseball season, the coaches who gave\nso much to the players they coached, changing from an outside chest protector to an inside\nprotector, working the high school all-star games at Mile High Stadium and Coors Field, the\ndays when he thought triple headers were fun, believing that what he did was important\nand made a difference, being a part of an avocation where integrity was critical, watching\nhis sons grow up to love the game of baseball, trying to do his best so that the boys who\nplayed could do their best, the fine men who he was privileged to umpire with on the field,\nstill searching for the perfect game, and his wife watching him (anonymously) in the stands\nat his first game in 1971 and at his last game in May 2002."
  },
  {
    "Name": "Al Raglin",
    "Year": 2004,
    "Image": "Al_Raglin.jpg",
    "Bio URL": "Al_Raglin",
    "bio": "\n2004 Hall of Fame Inductee Al 'Rags' Raglin – Denver\nAl Raglin graduated from Brooker T. Washington High School in Atlanta, Georgia in 1950.\nHe then enrolled for a year at Metro State College of Denver. In 1951, Al entered the\nmilitary. He was stationed at Lowry Air Force Base and then went on to the Air Force\nAcademy Financial Centers' 9th Aerospace Wing in Colorado Springs where he retired in\n1976.\nAl umpired from the 1960's until his retirement in 1997 and his name was well known at\nnumerous A & B playoffs in the 60’s and 70’s. He had numerous state playoffs and honors in\nall classifications. Al was in the Big Eight officiating for many years. He was in the WAC and\nhad playoffs in the mid-80's. Al was also involved in the Northern Colorado Division\nPlayoffs.\nAl's contributions to the sport consisted of such wonderful things as working in the Denver\nPublic Schools after school sports activities. He volunteered to work anger management\nclasses and gave of his time to the church group with young children and middle school ages\nas well."
  },
  {
    "Name": "Jim Schaefer",
    "Year": 2004,
    "Image": "Jim_Schaefer.jpg",
    "Bio URL": "Jim_Schaefer",
    "bio": "\n2004 Hall of Fame Inductee James A. (Jim) Schaefer – Frederick\nJim was born and raised in the Nebraska Farmlands. He and his wife, Arla, moved to\nColorado in 1968, and recently moved to Frederick from the metro area where they plan to\nretire. Arla is a retired registered nurse, and knew just how to treat some of the 'aches and\n'pains' as well as some of the complaints he might bring home. He emphasized the\nimportance of staying fit for all sports officiating and giving the kids your best shot at any\nlevel. He became known as \"Bud Lite\" by many coaches and players because of his\nacquaintance and officiating experiences with Bud Schoepflin.\nJim graduated from Bertrand High School, Nebraska in 1963. He attended Kearney State\nCollege in Kearney, NE from 1963-1965. Jim graduated from the University of Minnesota,\nMinneapolis in 1967 with a BS in Mortuary Science & Forensic Anatomy. He became the\nDeputy Coroner of Arapahoe County. He has also been a member of the National\nTransportation Safety Board (NTSB) crash investigations crew for 12 years. He has worked\nat Lockheed Martin Corporation. (25 yrs), and is the Lead for Engineering Administration,\nLMC Space Systems Company. He retired from officiating all sports due to work, physical,\nand personal reasons, but stays active by evaluating crew members. Jim married Arla on\n8/27/1966, in Nebraska. They have 3 children and many grandchildren, not to mention all\nhis friends\nJim served as a state officer for the baseball umpires association as well as the Colorado\nFootball Officials Association and Colorado High School Basketball Officials. His affiliation\nwith the American Legion State Tournaments involved many trips around the state of\nColorado to participate in/and speak to tournament dignitaries at a gathering the evening\nbefore the games would begin. He would then umpire games and evaluate other umpires\nwho worked with him.\nJim's accomplishments include being selected for approximately 18 State High School\nTournaments at all classifications, numerous American Legion and Connie Mack State and\nregional tournaments, and Five appearances at the Connie Mack World Series in\nFarmington, NM.\nJim also succeeded at the college level as an umpire in the RMAC umpire for 18 years with\nmany conference tournaments, the MOUNTAIN WEST Conference for 6 years, the WAC for\n11 years working conference tournaments in California and Hawaii, the JUCCO World Series\nTournament in Grand Junction, and the NCAA Div. II World Series, 1998, Montgomery, AL."
  },
  {
    "Name": "Bud Schoepflin",
    "Year": 2004,
    "Image": "Bud_Schoepflin.jpg",
    "Bio URL": "Bud_Schoepflin",
    "bio": "\n2004 Hall of Fame Inductee Earl \"Bud\" Schoepflin – Westminster\nBud was born and raised in the Denver area. He joined the Marine Corp. and served from\n1951 thru 1954 in a helicopter squadron. He also spent some of his time in the gymnasium\nweight room lifting weights and exercising which he still enjoys today. He emphasizes the\nimportance of staying fit for all sports officiating and giving the kids your best shot. He had\nthe reputation of whipping your butt if you got out of line for questioning his decision, but\nalways listened to your explanation (and then threaten to whip you again!). His nickname\nbecame \"Popeye\" or the guy with the big \"Pipes”\n.\nBud served as a state officer for the baseball umpires association as well as the football\nofficials association. He also served as the assigner for the WAC and RMAC. His affiliation\nwith the American Legion State Tournaments involved many trips around the state of\nColorado to participate in/and speak to tournament dignitaries at a gathering the evening\nbefore the games would begin. He would then umpire games and evaluate other umpires\nwho worked with him.\nBud graduated from St. Joe's High School in Denver, Colorado in 1951. Bud married Bev on\n5/15/53, in Denver. Together they have six children and many grandchildren, not to\nmention all his friends.\nUndoubtedly Bud's biggest contribution was that of a Mentor to other officials. He had a\nknack of knowing how to speak to coaches, players, and other participants. You would not\nonly figure out a 'new' method of communication, but would share it with others. Bud has a\n'true, hard & honest' work ethic and attitude. No one was fairer with all participants\ninvolved with the game of baseball. BASEBALL IS BETTER BECAUSE OF BUD!\nBud's honors include being selected for approximately 22 State High School Tournaments in\nall classifications as well as numerous American Legion and Connie Mack State and regional\ntournaments. At the college level Bud umpired the Big 8 Conference for 10 years, RMAC for\n12 years, WAC for 11 years including California and Hawaii and the JUCCO World Series\nTournament in Grand Junction for 14 years."
  },
  {
    "Name": "Bob Meisner",
    "Year": 2005,
    "Image": "Bob_Meisner.jpg",
    "Bio URL": "Bob_Meisner",
    "bio": "\n2005 Hall of Fame Inductee Robert 'Bob' W. Meisner – Golden\nBob graduated from Berkley High School in Berkley, California in 1953 where he played\nmany sports including baseball, football, and basketball. While in high school he earned all\nNorth California honors in baseball and basketball. He went on to play baseball while\nacquiring degrees credited at several colleges from the mid-50's through the 70's including:\n• Received an Associate’s Degree from Oakland City College in Oakland, California\n• Played baseball while attending the University of Southern California in Los Angeles\nbefore signing and playing for the Yankee organization for 10 years during the 50's\nand 60's\n• Received both Bachelors and Master’s Degrees from the University of Northern\nColorado in Greeley-graduated 1962\n• Degree in Administration from Colorado State University\nBob's contributions to the world of sports have been exciting and very beneficial to many\npeople. For many years he was a speaker for, as well as a participant in various high school\nbaseball clinics including the 'University of Denver' baseball clinic.\nBob taught and coached at Arvada High School before retiring from the Jeffco School District\nafter 27 years. He was the head baseball coach as well as a coach for the Arvada High\nSchool's tennis and football teams. Bob also started and coached the girls softball program\nat Arvada HS. Bob was awarded Coach of the Year in 1972, 1977 & 1979.\nFor 25 years, Bob conducted yearly tryout camps for the Major League Scouting Bureau in\nvenues for high school, the American Legion and college baseball players. The camps were\nheld in Denver, Colorado Springs, and Pueblo and as well as in Wyoming, Kansas, and\nMontana. He scouted for the Yankees, Reds, Cardinals, and Rangers.\nBob had a few more notable accomplishments\n• In 1959 while in the US Army, he won the 2nd Army Championship for Fort Knox,\nKentucky.\n• In the 1960's & '70's, Bob coached and taught kids and high school players at the Irv\nBrown Baseball Schools.\n• For 20 years, Bob was a scoring official at Arvada High School and the state\nwrestling tournaments in CO.\n• In 1996 the CHSBUA awarded Bob the Mr. Baseball Award.\n• Coached CHSAA Baseball All-Star Teams & Denver Post All-Star Game"
  },
  {
    "Name": "Don Carlsen",
    "Year": 2006,
    "Image": "Don_Carlsen.jpg",
    "Bio URL": "Don_Carlsen",
    "bio": "\n2006 Hall of Fame Inductee Don H. Carlsen – Denver\nDon Carlsen was born on October 15, 1926 in Chicago, Illinois. He passed away on\nSeptember 23, 2002. Don led a celebrated life.\nAfter graduating from East High School in 1944, Don went into the Navy for two and a half\nyears. When he was released from the Navy, he played pro baseball for six years. During this\ntime Don also attended Pepperdine College in Los Angeles, California and then went on to\ngraduate with a B.S. from Denver University in 1956. He also taught algebra at Smiley Junior\nHigh School in 1956, He was with the Cubs and Pirates in the major leagues and Los Angeles\nand Hollywood in the AAA Coastal League, Tulsa in the Texas league and New Orleans and\nNashville in the Southern League. Surgery to the elbow ended his career.\nDon assisted Bill Reed, the Denver Bear's radio announcer as. his color man in 1956 and\n1957. While attending East High School he umpired for the Old Timers League during the\nsummer and his call to fame came when an umpire for the Denver Bears became ill and he\nwas called to take over. Warren Spahn was the opposing coach and conflict over a call made\nby Don in left field became an issue. We still laugh at that one! From 1954-1974, he coached\nYouth Baseball and Legion A for Burt Chevrolet and one year of semi-pro baseball.\nDon was a member of the Big Brothers for 5 years and served on the Board.\nRyne Duren (MLB relief pitcher) and Don started the Ryne Duren Celebrity Golf\nTournament and they raised thousands of dollars over the years, 1989-2000, for the cause.\nIn 1973, he was the DAC Athlete of the Year and in 1999, Don was inducted into the\nColorado Handball Hall of Fame. He also became one of the recipients to be inducted into\nthe Colorado Sports Hall of Fame in 2001."
  },
  {
    "Name": "Ernie Kozacek",
    "Year": 2006,
    "Image": "Ernie_Kozacek.jpg",
    "Bio URL": "Ernie_Kozacek",
    "bio": "\n2006 Hall of Fame Inductee Ernest \"Ernie\" B. Kozacek – Lakewood\nErnie attended high school at Merrit Hutton in Thornton, Colorado and graduated in 1967.\nHe went on to Western state College in Gunnison, Colorado and graduated from there with a\nB.S. in 1971. 'Big E' joined the high school ranks in 1972 when CHSAA was being formed for\nofficials in all sports. He officiated high school baseball from the years of 1972 through\n2003. Ernie was the Assignor for the United Pacific and Mile Hi leagues for many years.\nErnie’s first year in Jeffco was with Bill Vencent and Mel Schwartz assigning. The assignor\nfor Denver was Mr. Wilson and Julie Carrabello was at Metro. The pay was a big seven\ndollars and fifty cents for varsity and four dollars for JV. Our uniforms were a white shirt\nand tie with double-breasted jacket and slacks.\nThe next thirty plus years, Ernie enjoyed a good schedule and worked many districts and a\nfew regional games. He was an assignor for many years as well as the replacement for most\n'no shows'. Ernie was grateful and thankful for the many experiences."
  },
  {
    "Name": "Joseph Massaro",
    "Year": 2006,
    "Image": "Joseph_Massaro.jpg",
    "Bio URL": "Joseph_Massaro",
    "bio": "\n2007 Hall of Fame Inductee Joseph L. Massaro - Pueblo, Colorado\nJoe attended Centennial High School in Pueblo, Colorado graduating in 1963. He earned a B.A. from\nSouthern Colorado State in 1967, From there Joe attended Adams State College in Alamosa, Western\nState College in Gunnison and the University of Northern Colorado in Greeley. Joe began his career in\n1967 when he was an assistant baseball coach for Centennial High School. He went on to coach for 32\nyears before retiring in 1999. He was Head Coach at Centennial from 1981-1971 where he coached S-CL\nBatting Championships in 1973 and 1978.\n1981-85 found him at the University of Southern Colorado as assistant baseball coach. He was Head\nBaseball Coach at Central High School from 1986 until 1999 where he led the team to 1988 -S-CL\nChampions and also City Champions, 1989 - City Champions, 1990 - Will Rogers League Champions, 1996\n- State Regionals, 1999-S-CL Champions.\nJoe has professional affiliations with the American Baseball Coaches Association, the National High\nSchool Baseball Coaches Association and the Colorado High School Baseball Coaches Association and he\nwas on the Pueblo Runyon Field Board of Directors from 1967 until 1992. Joe has assisted with baseball\nclinics and camps as well as the construction and maintenance of baseball facilities of Centennial and\nCentral High Schools, the University of Southern Colorado and the Pueblo Runyon Field Complex. He\nalso assisted with the major League Scouting Bureau Professional tryout camps.\nMr. Massaro has a long list of honors and achievements. In 1988 he was voted South-Central League\nCoach of the Year, and in 1992 the Boettcher Foundation awarded him the Teacher Recognition Award,\nABCA - Century Club (100 wins). Joe was inducted into the Greater Pueblo Sports Hall of Fame in 1995.\nIn 1997 his honors consisted of the American Baseball Coaches Association District VII Regional Coach of\nthe Year (six state area CO, NM, AR, UT, NEV, ID & MON), ABCA-30 Year Achievement Award, and a\nCHSCA-Level 2 Achievement Plaque.\n1999 brought the National High School Baseball Coaches Association 200 Victory Club and in 2002, Joe\nwas inducted into Pueblo Centennial High School Athletic Hall of Fame. To add to this long list, in 2002\nJoe wrote an article in the NFHS Officials' Quarterly (winter 2002) \"How it's Coached - How it's Called\"\n(How it's Coached - pitcher picked - offs at first base). Alongside his wife Gail, Joe has had many\naccomplishments. GO - GO - JOE!"
  },
  {
    "Name": "Bob Ottewill",
    "Year": 2006,
    "Image": "Bob_Ottewill.jpg",
    "Bio URL": "Bob_Ottewill",
    "bio": "\n2006 Hall of Fame Inductee Robert \"Bob\" Ottewill – Denver\nBob Ottewill attended Huntington High School, Long Island, New York in 1964. He went on\nto earn a B.A. in English from Ohio Weslyan University in 1968. From there, Bob attended\nthe University of Denver from 1968-72 where he completed 45 hours toward a degree in\nEnglish Literature. In 1987, he completed a (Type D) Certificate in M. Ed/Administrative\nfrom Colorado State University.\nFrom 1968 until 1972, Bob taught English/Basketball Coach at Kearney Junior High School\nin Commerce City. From the years of 1970-72, Bob was a part-time sportswriter for The\nDenver Post. In 1972, he began with CHSAA under the title of Administrative Assistant. In\n1986, Bob was named Associate Commissioner while becoming Aurora Commissioner in\n1990.\nBob has served as a member of the National Federation of State High School Associations\nBasketball, Football, Baseball and Softball Rules Committees over the last 20 years. He has\nbeen an official for High School Basketball and College Basketball as well. Bob has been\nCommissioner of the Colorado Whiffleball Federation from 1970 until the present and in\n1998 he was an Honorary Chairman at the Colorado All-State Games.\nBob has made outstanding contributions during his career and has been awarded: the Al\nSchalge Memorial Award in 1995, a Certificate of Appreciation from Denver Association of\nBlack Basketball Officials in 1994, a Friend of Broadcasting Award from the BA in 1990 and\nin the same year inducted into the Metro League Hall of Fame.\nOther key accomplishments under Bob’s CHSAA tenure include the addition of many sports\nincluding: girls swimming, skiing, basketball, cross country, softball, soccer, golf, field\nhockey, girls and boys lacrosse, volleyball, and ice hockey."
  },
  {
    "Name": "Robert Blaser",
    "Year": 2007,
    "Image": "Robert_Blaser.jpg",
    "Bio URL": "Robert_Blaser",
    "bio": "\n2007 Hall of Fame Inductee Robert 'Bob' S. Blaser – Westminster\nBob has enjoyed a long career in sports. He graduated from Ranum High School in Westminster,\nColorado in 1972 where he played both baseball and football. He was an all-conference\nshortstop for their 19-1 team that finished 3rd in state, losing in the semi-finals 2-1 to Pueblo\nCentral (who eventually became state champions). Bob was also an all-conference quarterback\nplaying for father Loren Blaser (successful football coach at Ranum from 1961-1974).\nBob attended college at the University of Utah in Salt Lake in 1973 and then on to Mesa College\nin Grand Junction in 1974 where he received an Associate Degree. He received his Bachelor’s\nDegree in Business Administration at the University of Southern Colorado, Pueblo in 1976.\nHe played 4 years of college football, 1 year for Mesa JC & 2 years for the University of Southern\nColorado. The career highlight was when he played in the 1974 JUCO World Series and made\nthe all-tourney team.\nBob has spent the last 21 years as a Colorado high school umpire of which 19 have included\nplayoff games. His list of accomplishments include: 4 State Championships (the last one was in\n1995 - Cherry Creek vs. Arvada West), Roy Halliday vs. Darnell MacDonald.\nBob was the Area Director for Colorado High School Baseball Umpires Association for 2 years!\nHe is employed as a sales representative for Denver Athletic Supply.\nBob has had many successes, including his 30 year marriage to Debbie (formerly Debbie\nMonaco - sister to successful umpire John Monaco). He has 4 children; sons Bryan (assistant\nbaseball coach at Mountain Range High School), Corey (currently in his 6th season as a minor\nleague umpire and is also a crew chief in the AA Eastern League), Craig and daughter Deenna."
  },
  {
    "Name": "Robert Campbell",
    "Year": 2008,
    "Image": "Robert_Campbell.jpg",
    "Bio URL": "Robert_Campbell",
    "bio": "\n2008 Hall of Fame Inductee Robert 'Bus' Campbell – Fort Morgan\nRobert “Bus” Campbell was born in Fort Morgan and moved to Denver when he was 8 years old.\nHe died from an unfortunate fall at the age of 87. He is survived by his wife Helen, Daughters\nPatricia, Cindy, and Sandy; and his son, Gary. Another son, Randy Campbell, who coached\nbaseball at Heritage High School, died in 1987.\nBus graduated from Denver Manual High School in 1939 where he lettered in three sports\nincluding baseball, basketball, and football. He became a member of Manual State Basketball\nChampions in 1938.\nAfter high school, Bus became a member of the United States Coast Guard from 1942 until 1945.\nHe attended the University of Denver and graduated in 1959 with a Bachelor’s degree in Health,\nPhysical Education and Recreation.\nFor the next 22 years, Bus worked as a physical education teacher in the Littleton Public\nSchools, and in 1970 his efforts earned him the honor of Littleton Public Servant of the Year.\nWhile teaching, Bus also maintained careers as a major league talent scout and a local pitching\ncoach. It was as a pitching coach that he distinguished himself as one of the best in the business.\nBus coached with numerous organizations including local high schools, colleges, the American\nLegion and High School baseball. Soon becoming involved with the program at the University of\nColorado and eventually becoming a key member of the highly successful Boulder Collegians\nSemi-Pro baseball team.\nHe began scouting in 1951 with the Milwaukee Braves and his career as a major league talent\nhunter spans 30 years with five different clubs. Many a young Colorado man got his chance in\nprofessional baseball because of Bus Campbell.\nBus was scouting for the Blue Jays when he began working with the Arvada 14-year-old Roy\nHalladay in 1995. Toronto drafted Halladay in the first round out of Arvada West High School.\nThat Christmas, Halladay gave a grandfather clock to Bus \"because he's like a grandfather to\nme.\" Roy spoke regularly with Bus about pitching fine points after his games, which Bus\nwatched regularly via the satellite dish Roy gave to him.\nAs a pitching coach, Bus has distinguished himself as a man without peer in Colorado. No less\nthan 82 of his former pupils have gone on to pitch professionally in the Major Leagues. Some of\nthat long list includes Roy Halladay, Burt Hooton, Mark Huismann, Scott Elarton, Jamie Moyer,\nBrian Fisher, Bob Welch, Brad Lidge, Danny Jackson, Ed Lunch, Craig Lefferts, Tim Lollar, Jay\nHowell, Mark Knudson, Mike Trujillo, Darrel Akerfelds, George Frazier, Clint Zavaras, Steve\nBusby, Dick Ruthven, and Nick Willhite.\nIn 1985, 25 former Campbell pupils pitched in the Major Leagues, winning 107 games, and\nsaving 80 more. They appeared in a total of 731 major league games!\nDuring a reception in Colorado Springs honoring Gossage’s election to the Baseball Hall of\nFame, Rich \"Goose\" Gossage made special mention of Bus. He said most pitchers who came out\nof this area lost one of their biggest mentors. \"Bus Campbell was at the top of the chart as a\npitching coach and as a person. He broke down pitching in terms that everyone could\nunderstand. I didn't meet Bus until later in my career, but he helped add three of four years to\nmy career.\"\nBus Campbell is unique among nominees for this prestigious honor. He does not have a head\ncoaching record, nor is he a household name. He has preferred to remain in the background,\ngaining all his satisfaction from the success of those with whom he has worked. He has never\nsought any kind of reward for this work; instead, he settles for quiet satisfaction when he sees\nformer pupils achieving widespread acclaim. To compliment the established players, he adds a\nnew crop of Campbell pupils he was proud to coach like Mark Langston, Danny Jackson, and\nBrian Fisher.\nIt has been well publicized that Colorado has turned out more than its fair share of professional\nbaseball players. It is no coincidence that most of them are pitchers; Bus Campbell has been a\nmajor reason. Many of us owe our careers to him."
  },
  {
    "Name": "Rich Czernicki",
    "Year": 2008,
    "Image": "Rich_Czernicki.jpg",
    "Bio URL": "Rich_Czernicki",
    "bio": "\n2008 Hall of Fame Inductee Richard Czernicki – Broomfield\nRichard “Z-Man” Czernicki was a graduate of Northglenn High School. In 1972, he participated\nin 4 sports - football, baseball, basketball, and track. He played 5 years of college football - 2\nyears at Mesa Junior College in Grand Junction, Colorado and 3 years at Western State College in\nGunnison, Colorado. Richard played for the NAIA, National Championship in the fall of 1976.\nThey lost to Texas A&I 52-14.\nRichard graduated from Western with a B.A. in Physical Education with a minor in English\nLiterature. He taught for 28 years at Northglenn High School before retiring in 2005. He\ncoached football for 8 years, basketball 8 years and baseball for 2 years at Northglenn High\nSchool. Richard also coached Junior Varsity basketball and compiled a 105-38 record with 5\nLeague Championships. He has accrued many honors in his officiating years. He worked for 23\nyears in high school baseball. He also worked 18 years officiating high school football and\nbasketball and 5 years in high school girls' softball. Richard has also worked in 5 state finals, 8\nsemi-finals and has had 20 years of state tournament experience and worked 11 years of\ncollege baseball.\nIn 1995, Richard was voted Umpire of the Year for the Denver area. He was crew chief of the\nColorado High School All-State Games for 4 years. He umpired 13 state finals between baseball,\nfootball, and basketball.\nA contribution to the game included Richard receiving grant money from school district #12 for\nhaving an officials' class for baseball/softball umpires and for basketball officials. They worked\nthese classes into our intramural programs at Northglenn High School. This went very well for 2\nyears.\nSome significant games or situations that Richard was involved in:\n• (1993) Triple play during the state final game between Lamar and Lajunta.\n• (1995) Plate Umpire in the State Finals (Arvada West H.S, vs. Cherry Creek H.S. - Roy\nHalliday vs. Darnell MacDonald)\n• (1998) Plate Umpire with 35 K's out of 42 outs (Highlands Ranch H.S. vs. A. Hinkley\nH.S.) Game was 1 hour, 5 minutes.\n• Plate Umpire for the Boulder H.S. vs. Fairview H.S. with 4 out calls at the plate in the\n1st inning.\n• (2001) Plate Umpire for Fairview H.S. vs. Overland H.S. with 3 batter interference\ncalls in 1/2 innings."
  },
  {
    "Name": "Arny Karraker",
    "Year": 2008,
    "Image": "Arny_Karraker.jpg",
    "Bio URL": "Arny_Karraker",
    "bio": "\n2008 Hall of Fame Inductee Arny Karraker – Cortez\nArny Karraker was born in Holyoke, Colorado in 1954 and now presides with his wife Patti in\nCortez, CO. He graduated from high school in 1972 after attending Montezuma Cortez High\nSchool, RE-1. He then went on to attend Western State College in Gunnison, Colorado in 1972.\nArny has had the honor of being selected to umpire numerous District and Regional playoff\ngames in his 25 or so years of umpiring. He was selected to umpire a State Championship Game\nin 2008 and has also umpired games in New Mexico, Utah, and Arizona, He has also umpired\nRegional and State Championship Games for Connie Mack, AABC and Farmington, New Mexico.\nIncluded as one of his many contributions as a leader, Arny has held the position of Area\nDirector in Cortez since the association was formed. He said it was \"mostly because no one else\nhad the time for it\" but not so sure of Arny. He has been involved with baseball on the local level\nsince 1985 (give or take a year of two.)\nArny Karraker always wanted to be the oldest active umpire in the state of Colorado. Sadly, his\nhealth issues have forced him to step down from an active position."
  },
  {
    "Name": "Ernie Ortiz",
    "Year": 2008,
    "Image": "Ernie_Ortiz.jpg",
    "Bio URL": "Ernie_Ortiz",
    "bio": "\n1998 Hall of Fame Inductee Ernie Ortiz – Aurora\nErnie Ortiz has a lifetime of military experience which, coincidently. prepared him for an outstanding\ncareer as a sports official. A retired Army Sergeant First Class, Ernie first distinguished himself athletically\nin the \"Squared-Circle\" as an award winner boxer. Early in his career he squared off against another\npugilistic standout, Richard \"The Hawk\" Hawkins. While the exact outcome of this historic first meeting\nhas been lost to history and formidable duo as umpires working high school and college baseball\ntogether in the Denver Metro area.\nErnie's further preparation for umpiring came during the Korean Conflict as he served his tour of duty as\na military policeman stationed in Hawaii. Ernie's successful athletic career in the service led him into\nofficiating, and during his second tour of duty in Europe, Ernie was assigned as a sports official. He\ndistinguished himself in this capacity as well and was named to an elite crew of umpires who worked\ngames involving major league ballplayers fulfilling their military obligations on the ball field. Ernie kept\nthe peace in games involving the best the Army. Navy, and Marines had to offer, as well as working\ncontests involving The University of Hawaii and teams from the Caribbean.\nPerhaps as a result of this experience. Ernie found himself in Cuchi, Viet Nam training young recruits in\nguerrilla warfare tactics during his final tour of duty in 1966. Entering civilian life, Ernie became a\nstandout arbiter in the Denver area working baseball and softball games at the high school and college\nlevel. Besides his membership in The Colorado High School Baseball Umpire Association, Ernie was also a\ncharter member of The Colorado Collegiate Umpire Association.\nToday. Ernie still remains active, and reports that \"the wheels are still working\" but says he misses the\ncamaraderie and competition on the athletic turf. However, Ernie's military and officiating career\nexperiences are still put to good use as he and his wife Eva have eight children, twenty-two\ngrandchildren, and six great grandchildren to keep under control."
  },
  {
    "Name": "Carl Zele, Jr",
    "Year": 2008,
    "Image": "Carl_Zele.jpg",
    "Bio URL": "Carl_Zele_Jr",
    "bio": "\n2008 Hall of Fame Inductee Carl L. Zele, Jr. – Littleton\nCarl Zele, Jr. graduated from Englewood High School in 1972. He began umpiring in 1973 while\nattending C.U. Boulder. While pursuant to a music career, he was always athletic as well. He\nchanged his major two times. Deciding that baseball needed \"more athletic umpires\", and\nthinking what better summer job could there be than working in baseball while getting paid.\nCarl made one quick call to Bill Vincent and spawned a new career.\nFrom the first high school game in 1974 until 2002 (arguably the finest athletic overall in\nCHSBUA) Carl Zele became a student of the game. He began gathering information from the\nlikes of Irv Brown, Dal Ward, Coach Dave Wardell, Frank \"Chief\" Prentup and experience\nthrough Jon MeSherry, Eric Gregg, Nick Bremigan, Joe Brinkman, and Rich Garcia.\nCarl began refereeing Colorado High School Basketball during this time, completing ten years of\nservice. If that were not enough, he also refereed the CHSGSUA through 2004.\nWhile attending the Bill Kinnamon Pro-Umpire School in 1978, Carl began working a lot of\ngames like no other. From playing and coaching many, many games, league finals, state, district,\nregional and National tournaments to working numerous games with guys like Ken Zenter,\nWillie Milton, Joe Bellich, Nick Emeterio and Floyd Ewing, Carl lived and worked with a desire\nto learn and with a determination to be right with poise and dignity, which he felt was needed\nin maintaining the code of ethics of baseball and the CHSBUA - Which are as follows:\n1. Never cancel a game unless (a) you are sick or; (b) dead\n2. Always try to be the best (or at least look the best)\n3. It is a whole lot harder to remain calm and keep poised then to mouth-off.\nThrough the countless finals, state, district and regional tournaments, Carl Zele, Jr. was able to\nbecome one of the many CHSBUA \"Men in Blue\" that make the game as good as it is."
  },
  {
    "Name": "Mike Brady",
    "Year": 2009,
    "Image": "Mike_Brady.jpg",
    "Bio URL": "Mike_Brady",
    "bio": "\n2009 Hall of Fame Inductee Michael L. Brady - Ft. Collins, Colorado\nMike Brady graduated from Fort Collins High School in 1970 where he and his wife Mala still reside\ntoday. After High School, Mike went to serve in the United State Marine Corps from 1971 through 1973.\nUpon his return Mike attended the University of Northern Colorado, Greeley and graduated in 1978 with\na BS in Recreation.\nMike began umpiring in 1975 and continued until 2005. He worked for Bud Schoepflin and Dan Weikle in\nNCAA Baseball for quite a few years, and he is still working High School and NCAA Softball. Mike has a\nlong list of accomplishments in baseball. He has had the honor of being selected to umpire numerous\nDistrict and Regional playoff games and State Championship games in several conferences over the\nyears. His first State Playoff game was in 1981 but his most remembered game was a semi-final game\nwith Sean Grogan and Jim Kerr that went 17 innings and lasted about 4 1/2 hours.\nMike has been a leader throughout his exciting career. He was Area Director for the Fort Collins Area\nUmpires. He has led clinics and administered the tests for both summer ball and high school in Fort\nCollins and Loveland. Mike was a clinician for the State Master Meetings at various stations over the\nyears and has evaluated many umpires; often recommending them to the State Office Districts,\nRegionals and State Playoff games. One of his most outstanding accomplishments was to serve as\nPresident Elect, President and Past President for CHSBUA."
  },
  {
    "Name": "Irv Brown",
    "Year": 2009,
    "Image": "Irv_Brown.jpg",
    "Bio URL": "Irv_Brown",
    "bio": "\n2009 Hall of Fame Inductee Irv Brown – Broomfield\nThere are few people in Colorado sports like Irv Brown. A former high school and college coach\nand official turned radio and television broadcaster, Irv has established himself among the most\nknowledgeable people in Colorado sports history. He and wife Pat live in Broomfield.\nIrv is a graduate of Denver's North High School and the University of Northern Colorado. He\ncoached for 25 years at the high school level and at Metropolitan State College and the\nUniversity of Colorado. He has served as Commissioner of the former Colorado Athletic\nConference and as supervisor of officials for three collegiate conferences.\nThroughout his career, however, Irv never forgot his high school sports roots and has given\nmuch of his personal and professional time to promote prep athletics.\nWhile coaching three sports at Arvada High School, Irv's 1964 baseball team won the state title,\nlosing only seven games all year. He was inducted into the Colorado Sports Hall of Fame in 2001\nand was listed 39th among Sports Illustrated's list of Colorado's 50 Greatest Sports Figures for\nhis officiating.\nPerhaps more well-known now for his work on radio and television, Irv was one of the nation's\npremier basketball officials, having worked six Final Fours. Just a few years back, he was\nrecognized as one of the 20 most influential officials in the country. In 1995, Irv received the\nCHSAA's Distinguished Service Award for promotion of high school sports.\nIrv now hosts a talk show with long-time partner Joe Williams on KKFN Radio (950 AM) from 2-\n6 each day. He has worked as a youth baseball consultant Denver's professional sports teams\nconducting clinics across the state. Irv continues to broadcast games in a variety of sports for\nseveral networks and on local cable. He remains one of the most productive mentors of\nbroadcast talent in the state. He is a member of the Air Force Academy football broadcast teams.\nThe Colorado Rockies gave him their Pioneer Award for his work, and he broadcast the first\ntaped ESPN event and the first ESPN live event in ESPN history. Both events were football\ngames as ESPN first began."
  },
  {
    "Name": "Frank DeAngelis",
    "Year": 2009,
    "Image": "Frank_DeAngelis.jpg",
    "Bio URL": "Frank_DeAngelis",
    "bio": "\n2009 Hall of Fame Inductee Frank DeAngelis - Thornton, Colorado\nFrank DeAngelis was a graduate of Ranum High School in Westminster, Colorado in 1971. He went on\neducationally to earn a BA from Metro State College in 1978, an MA from the University of Colorado,\nDenver in 1984 and also a Certificate from the University of Phoenix, Denver in 1994. Today, he and wife\nEvelyn live in Thornton.\nFrank has 17 years of High School coaching experience in the Jefferson County School District. He was a\nVarsity Assistant for 1 year at Jefferson Senior High, 2 years at Wheat Ridge Senior High and another\nyear at Columbine Senior High School. Frank became the Head Baseball Coach at Columbine Senior High\nSchool where he won 3 League Championships and 2 State Championships in his 13 years there. He also\nhad 17 years of Summer League Baseball as Head Coach where he won 10 League Championships and 1\nState Championship.\nMr. DeAngelis has accrued many honors and awards including:\nNational Coach of the Year, Region 7\nColorado High School Coaches Association - Baseball Coach of the Year\n2 Years as the Rocky Mountain News & Denver Post Baseball Coach of the Year\nJefferson County Board of Control Make Coach of the Year\nThree Years Jefferson County Baseball Coach of the Year\nSelected to Coach in the Colorado Rockies High School All State Game\n6 Years selected to Coach the Jefferson County Baseball All Star Team in the State All Star Game\nColorado High School Baseball Coaches Association Mr. Baseball\nUniversity of Notre Dame People Who Makes a Difference\nColorado Athletic Directors Association Outstanding School Administrator of the Year to\nColorado Interscholastic Athletic\nSelected to carry The Olympic Torch in The Torch Relay 2002 Winter Olympics\nJefferson County Association of Educational Office Professionals (JCAEOP) Administrator of the\nYear\nFrank's contributions are many. He was the organizational head for an array of committees:\nPresident of the Colorado High School Baseball Coaches Association\nBaseball Committee Director of Columbine and Chatfield Little League Baseball Camps\nDirector of All State Baseball Games Colorado State Baseball Committee Chairperson for\nBaseball\nColorado High School Activities Association Committee Member Classification and League\nOrganizing Committee (CLOC\nCoordinator of All State Baseball Games in conjunction with the Colorado Rockies School\nImprovement Committee\nBaseball Committee Member for Colorado High School Activities Association\nRegional Representative for the American Baseball Congress Columbine Building Representative\nand Scholarship Committee Member for the Colorado High School Coaches' Association"
  },
  {
    "Name": "Thomas Severtson",
    "Year": 2009,
    "Image": "Thomas_Severtson.jpg",
    "Bio URL": "Thomas_Severtson",
    "bio": "\n2009 Hall of Fame Inductee Thomas 'Sev' W. Severtson – Thornton\nThomas Severtson is a Colorado native, born in Denver on May 30, 1948. He and wife Belinda\nlive in Denver today. He graduated from East High School in 1965 and then went on to attend\nthe University of Northern Colorado in Greeley where he received his MA in 1971.\nAt present, Sev has the responsibility and honor to be the Dean of Students at Rangeview High\nSchool. In fact, Sev has had the pleasure of receiving many honors over the years. He was\npresented two prestigious honors is 1994, the first being the Colorado Baseball Coach of the\nYear, and the second was the AABC District Seven Coach of the Year Award. He has received the\nDenver Public Schools Coach of the Year honor a total of six times over the years. His status and\ncoaching recognition are almost unheard of with a total of 338 wins and only 100 losses.\nSev has also been recognized at several State and Local Baseball Clinics as a Speaker and\nClinician. His level of integrity is virtually unprecedented."
  },
  {
    "Name": "Fritz Johnstone",
    "Year": 2010,
    "Image": "Fritz_Johnstone.jpg",
    "Bio URL": "Fritz_Johnstone",
    "bio": "\n2010 Hall of Fame Inductee Frederick Fritz R. Johnstone – Sterling\nFrederick “Fritz” Johnstone was born in Seattle, Washington on December 14, 1944.\nFritz graduated from Sauk Rapids High School, Sauk Rapids, Michigan in 1963. In his\nlater years he lived in Sterling, Colorado with his wife Sharon, until his death on\nNovember 15, 2009.\nFritz officiated high school sports (including basketball and football) for over 30 years.\nHe became a baseball umpire in 1979 and continued his service throughout his entire\nlife.\nDuring his career Fritz served as Area Director for each of three sports. He was a\nteacher, coach, and mentor for many new officials in the state of Colorado.\nOver the years, Fritz worked numerous District, Regional and State Tournaments.\nDuring the summers, Fritz worked the local legion and other summer baseball\nprograms. He was also an assignor for many Northeast Colorado High Schools and\nvarious summer programs.\nEven after Fritz retired, he never left the sport. He enjoyed NJC baseball games and even\ndrove their bus to the away games. He also drove on their annual spring trip to Arizona.\nUntil his death, Fritz never missed a local high school game. He would always want to\ngo to watch, evaluate and give advice to the officials that were working the game."
  },
  {
    "Name": "Richard Mauro",
    "Year": 2010,
    "Image": "Richard_Mauro.jpg",
    "Bio URL": "Richard_Mauro",
    "bio": "\n2010 Hall of Fame Inductee Richard Joseph 'Blue Blaze' Mauro –\nLittleton\nRichard graduated from North Denver High School, Denver, Colorado in 1948. He now resides\nin Littleton, Colorado with his wife Marie.\n'Blue Blaze' has a long list of contributions to community athletics. He umpired for a total of\neighteen years in the high school and college/ university venues.\nRichard became a member of the Rocky Mountain Umpires Association during those eighteen\nyears of service, and became President of that association for two years. He was on Board of\nDirectors for two years as well.\nRichard coached Northside Community Centers B-Legion Team for five years where he took the\nteam on to win two League Championships and one State Championship.\nWhile acting Assistant Coach to Ron Mitchell, he helped to take the Metz Lumber Girls' Softball\nTeam to three State Championships and a seventh place win in the Nationals in San Antonio,\nTexas.\nRichard has a long list of accomplishments which include umpiring at Bears Stadium in three All\nStar games.\nHe represented the umpires at a C.H.S.A.D. meeting asking for an increase in pay for High School\nBaseball Games and was successful in accomplishing his mission."
  },
  {
    "Name": "Robert Schnabel",
    "Year": 2010,
    "Image": "Robert_Schnabel.jpg",
    "Bio URL": "Robert_Schnabel",
    "bio": "\n2010 Hall of Fame Inductee Robert Schnabel – Arvada\nRobert Schnabel graduated from Cathedral High School in Denver, Colorado in 1956. In 1962 he\nattained a Sales, Speech and Human Engineering degree from Sales Training, Inc. Bob presides\nwith his wife Barbara in Arvada, Colorado.\nBob was an accomplished baseball player himself. He was fortunate enough to play for the\nDenver Bears in the West Texas, New Mexico League for one year.\nAs an umpire, Bob worked in the venues of Little League, softball, high school, college and semi-\npro as well.\nRobert also worked in three high school All Star games and was asked to work a Bears baseball\ngame by Julius Carabello."
  },
  {
    "Name": "Bruce Bradshaw",
    "Year": 2011,
    "Image": "Bruce_Bradshaw.jpg",
    "Bio URL": "Bruce_Bradshaw",
    "bio": "\n2011 Hall of Fame Inductee Bruce Bradshaw – Pueblo/Colorado\nSprings\nBruce Bradshaw was born on March 15, 1957 in Pueblo, Colorado to Janice and Robert\nBradshaw, Sr. Bruce graduated from Central High School. He had a master's degree in\neducation and mass communications. Bruce lived in Pueblo, Colorado until his unexpected\ndeath on June 8, 2010.\nBruce loved sports. In high school he played basketball and football, and during the summer\nmonths he played baseball. In later years when time permitted, Bruce loved playing golf,\ntraveling and photography.\nBruce was an English teacher for 20 years at Wasson High School District No. 11. He was also\nactive in the AVID program there. He was the head boys' basketball coach, as well as the golf\ncoach at Wasson.\nBruce umpired for CHSBUA since 1992. He was the Area No. 3's Director of the Colorado High\nSchool Baseball Umpire Association for about 6 years. He also officiated several Colorado State\nChampionships. Bruce spent countless hours over 15 years at Runyon Field as the assignor for\nthe Andenucio Baseball Tournaments.\nBruce was very well-known around the state of Colorado and he was a mainstay for Southern\nColorado baseball organizations and tournaments."
  },
  {
    "Name": "Dave Schmidt",
    "Year": 2011,
    "Image": "Dave_Schmidt.jpg",
    "Bio URL": "Dave_Schmidt",
    "bio": "\n2011 Hall of Fame Inductee David Schmidt – Littleton\nDavid Schmidt was born in Pittsburgh, Pennsylvania on June 6, 1947 to John and Marge\nSchmidt. David moved to Colorado in 1980 with Diane and they married in 1982. Shortly after,\nthey opened a Stamp Store West packing store. Their daughter Mindy was born in 1985. David\npassed on May 31, 2008.\nDavid graduated from Chartiers Valley High School in 1965 and continued his higher education\nat Robert Morris College. He graduated with a major in education.\nDavid had a long and distinguished career. He began coaching Little League in Pennsylvania and\nthen began umpiring both baseball and softball after moving to Colorado. He taught umpire\nschool and became an umpire assignor to both the Metropolitan and Skyline leagues. David held\nmany positions in his life including softball and baseball umpire as well as a basketball referee.\nDavid also held the Annual 4th of July Tournament at Dakota Ridge High School.\nDavid received many awards in his career including:\n• Mr. Baseball Award from the Colorado High School Baseball\nCoaches Association in 2005.\n• Honorary Member of the Colorado High School Softball Umpire\nAssociation in 2005\n• Distinguished Service Award 2006-2007\nHe was a fine man and a big contributor to the baseball community."
  },
  {
    "Name": "Jack Smith",
    "Year": 2011,
    "Image": "Jack_Smith.jpg",
    "Bio URL": "Jack_Smith",
    "bio": "\n2011 Hall of Fame Inductee Jack Smith – Rifle\nJack Smith was born on October 17, 1935 in Coaldale, Colorado and now resides with his wife\nBarbara in Rifle, Colorado. Jack graduated from Florence High School, Florence, Colorado in\n1953. In 1960 he attained a BA from Western State College in Gunnison, Colorado.\nJack has acquired a long list of honors in his lengthy career. He taught school in Rifle for 27\nyears. Jack was also a coach during those 27 years; a coach of many hats. He coached the Rifle\nHigh School football team to State Championships in both 1961 and 1973. He coached\nbasketball for both girls and boys, and in 1986 he took the girls team to 2nd in State. His\nbaseball team were the State Champions in 1981 and 1985. While accomplishing all that, Jack\nalso coached track & field.\nJack has been a member of the Colorado State Umpires for 20 years. He has been a part of both\nRegional and State Playoffs including a 4A Western Slope All-Star game. He, along with Gordon\nCooper and Glenn Curns, has started over 16 Umpires Associations."
  },
  {
    "Name": "Bruce Grigsby",
    "Year": 2012,
    "Image": "Bruce_Grigsby.jpg",
    "Bio URL": "Bruce_Grigsby",
    "bio": "\n2012 Hall of Fame Inductee Bruce Grigsby – Montrose\nBruce Grigsby was born in Glendale, California on September 7, 1946. He graduated from\nBurbank High School, Burbank California in 1964. Bruce continued higher education at\nCalifornia State University Northridge, Northridge, California graduating with a bachelor’s\ndegree in 1969. He then went on to St. John's College in Santa Fe, New Mexico receiving his\nMaster's in 1995.\nBruce had a very long and distinguished career spanning many years in both umpiring and\nteaching. As a teacher at Montrose High School, he had a great passion for teaching and a\ngreater compassion for his students. As a matter of fact, many students have said he was the\nbest teacher they ever had. Bruce loved the opera and often took groups of students to the Met\nor a Broadway Show in New York City. He wanted to share and educate them on the diversity of\npeople, music, and travel. It would turn out to be an experience of a lifetime for the students.\nBruce is always someone who was always prepared. He studied the rules, knowing them\nbackwards and forward. He had a unique quality of being able to read the words and put them\ninto a picture everyone could understand. He was a great teacher for new and inexperienced\nofficials, and he treated the players with respect. Bruce has officiated so many games in both\nbaseball and basketball they are hard to count. He also coached football and was head baseball\ncoach for several years.\nAs a husband, father, educator, friend and yes baseball umpire, Bruce Grigsby has earned the\nhonor to be inducted into the Umpires Baseball Hall of Fame."
  },
  {
    "Name": "Leonard Varriano",
    "Year": 2012,
    "Image": "Leonard_Varriano.jpg",
    "Bio URL": "Leonard_Varriano",
    "bio": "\n2012 Hall of Fame Inductee Leonard Varriano – Greeley\nLeonard “Len” Varriano was born in Moorhead, Minnesota on September 22, 1930. He\ngraduated from Dilworth High School in Dilworth, Minnesota in 1948. Len graduated from\nMoorhead State College in 1954 with a bachelor’s degree. He continued his college education at\nthe University of Northern Colorado, Greeley where he attained a master’s degree in 1968.\nLen not only umpired games but he was a baseball coach as well. He coached at Rothsey High\nSchool in Minnesota in 1955. He also coached at Greeley Central and he coached Legion B. Len\nplayed four years of college baseball. He also played Semi-Pro Baseball in Minnesota and\nCanada from 1952 until 1954.\nLen's baseball umpire career continued from 1965 until 1992. As an umpire he worked in\nmany championships including Class 2A, Class 3A (for ten years), Legion B (for ten years),\nand a Legion Championship in Arvada, Colorado. He worked playoff games in all 1A, 2A and\n3A divisions. Len was also the Area Director for six years. He has been very dedicated to\nbaseball."
  },
  {
    "Name": "John Walsh",
    "Year": 2012,
    "Image": "John_Walsh.jpg",
    "Bio URL": "John_Walsh",
    "bio": "\n2012 Hall of Fame Inductee John P. Walsh – Greeley\nJohn Walsh was born on November 25, 1943, in Anaconda, Montana. He attended Anaconda\nCentral High School where he graduated in 1962. John then went to study at Carroll College\nin Helena, Montana and received a bachelor’s degree in 1966. He continued to the\nUniversity of Montana in Missoula to achieve a teaching certificate in 1967 and on to\nSpokane, Washington's Gonzaga School of Law for another year.\nJohn's baseball umpire career lasted from 1971 until 1999 in the State of Colorado where he\numpired state tournaments in all classifications. He worked in three Legion C State\nTournaments, three Legion A State Tournaments and two Legion B State Tournaments. He\nalso umpired innumerable District State Tournaments and Summer Legion Programs.\nAs well as being an accomplished umpire, John also played four years of College Baseball at\nCarroll College in Montana and two years of SemiPro Baseball in Southwestern Montana.\nSome of John's many accomplishments include serving as Area Vice President for four years,\nPresident of CFOA from 1999-2000 and he was the Area Director for Colorado High School\nBasketball Association for six years. He also received the Greeley Baseball Umpires\nAssociation Appreciation Honors Award for Years of Service and Dedication to Baseball in\nNorthern Colorado on March 30th, 2000. A very accomplished man."
  },
  {
    "Name": "Bob Jones",
    "Year": 2013,
    "Image": "Bob_Jones.jpg",
    "Bio URL": "Bob_Jones",
    "bio": "\n2013 Hall of Fame Inductee Bob Jones – Kansas City, MO\nBob retired from the Kansas City, Missouri Police Department in 1995. He currently works\nat Raytown Middle School in KC. Bob and his wife Debbie have been married for 38 years\nand have 2 children, Bryan, and Kristen.\nBob Jones began his officiating career in 1978 working High School games and the MLB.\nFrom 1979 through 1991, Bob worked every Big 8 and Big 12 tournament game played -\n121 straight playoff games. In 1991 Bob became 1st Supervisor for the Big 8 and eventually\nBig 12. He held that position until 1996. In 2001 he became the Coordinator of Umpires for\nthe Missouri Valley Conference. His distinguished career includes 15 NCAA Division 1\nRegionals - Super Regionals and 3 NCAA Division 1 College World Series. He has continued\nto work the Mile High Camp since 1980.\nBob first came to Denver as the NCAA Regional Advisor/Evaluator. He is responsible for\nhelping 3 CHSBUA members gain assignments into the NCAA Division 1 post-season. More\nthan that, he planted the seed which eventually grew into the Mile-High Advanced Umpire\nClinic and the UTEP Program as three individuals, with Bob's guidance, began the umpire\ndevelopment program, which has become the hallmark of excellence for over 25 years.\nWithout Bob's input and continued participation, the clinic would have never prospered\nand become the successful event it is today, nor would have the UTEP training program\never gotten off the ground. Bob has helped train virtually 75 percent of the CHSBUA\numpires registered in Denver. His proficiency in all phases of umpiring, from mechanics to\nhandling situations, helped over 300 umpires increase their ability and raise the ability level\nof the entire Colorado High School Baseball Umpires Association. He is a trusted advisor,\nexcellent teacher, and friend to all the umpires in the CHSBUA."
  },
  {
    "Name": "Ed OConnor",
    "Year": 2013,
    "Image": "Ed_OConnor.jpg",
    "Bio URL": "Ed_OConnor",
    "bio": "\n2013 Hall of Fame Inductee Ed O'Connor – Arvada\nEd O'Connor graduated from Holy Family High School in 1971 and then attended Metro\nState College (Business major). Ed and his wife Susan reside in Arvada, Colorado and he\ncontinues to work for the Denver Post where he has been a dedicated and valued employee\nsince 1976.\nHis officiating career began in 1980 on the baseball diamond and continued until 2010.\nDuring that time Ed accumulated approximately 59 playoff games and 3 state\nchampionships. Ed worked at all levels of high school and legion baseball, along with the\nvarious other leagues MSBL, NABA, Connie Mack, and Stan Musial.\nThere were other sports he officiated in including basketball from 1983 until 2008 and\nFootball from 1980 until 2012. He officiated 2A and 3A State Championships, American\nLeague State Championship playoff games, and the Men's Senior league from 1985 until\n2010.\nThese were Ed’s 2010 Baseball Goals\n• Study. learn, and fully consider rules\n• Achieve proper game control.\n• Work, mentor, and teach new officials.\n• Work well with diverse groups of people\n• Do not become an old fart official.\nEd's professional approach to his officiating will leave a lasting effect on those who have had\nthe privilege to work with him."
  },
  {
    "Name": "Tom Smith",
    "Year": 2013,
    "Image": "Tom_Smith.jpg",
    "Bio URL": "Tom_Smith",
    "bio": "\n2013 Hall of Fame Inductee Tom “Tozzi\" Smith - Boulder, Colorado\nNominated by Chuck Smith Presented by Dick Piland\nTom Smith was born in Flint, Michigan and now resides with his wife Hilary in Superior, Colorado. They\nhave 2 children, Alannah Rose Blaze and Jenna Hilary Smith. Tom attended St. Michael's High School in\nFlint where he lettered 7 times: 2 for football playing quarterback, 3 for baseball as catcher, and 2 for\nbasketball as guard. He graduated from St. Bernard in Cullman, Alabama with a Bachelors in English\nLiterature in 1966, where he also played 2 years of baseball. He went on to grad school at Eastern\nMichigan University with studies in Physical Education, M.S. Health and Recreation. His post grad\neducation was at the University of Colorado where he obtained a Type D Administration Certificate.\nTom's career began at Father Lopez High School in Daytona Beach, Florida where he taught English and\nwas the Head Baseball Coach, Assistant Football and Basketball coach for 3 years. He went on to Boulder\nHigh School teaching English, Assistant Baseball, Basketball, and Head Swimming Coach for 4 years. His\nnext move was to Fairview High School teaching English as Department Chair, JV Baseball, Dean of\nStudents, Athletic/Activities Director for 26 years. Tom's current assignment of 3 years is at Holy Family\nHigh School where he is Dean of Students, AP and Athletic Director.\nTom was a baseball umpire for 40 years from 1972 until 2012. During that time, he was in 4 State\nChampionship Finals and 6 Semi-Finals. Tom was President of CHSBUA from 1995 until 1997 and won\nthe Ken Furman Memorial Award in 2004. He has also been a softball umpire for 25 years, continues\ntoday, and has been in 4 Finals and 4 Semi-Finals. He was a Basketball Referee for 25 years also engaged\nin Finals and Semi-Finals and continues as Secretary/Treasurer from 2011 to present.\nMr. Smith has been awarded into the Michigan High School Athletic Association Hall of Fame, the\nMichigan High School Football Coaches Hall of Fame, and is a Charter Member of the Flint Sports Hall of\nFame.\nWhile Tom is very skilled and productive in all areas, his greatest passion is believed to be officiating. He\nstarted umpiring when an additional income for his family was essential and retired some 40 years later\nwith the challenges and pride of accomplishment as his motivators. He expanded tasks to include\nbasketball, and later softball. Tom routinely rushed from a busy day teaching and/or administrating at\none school, to officiating a key game (after a rushed drive) at another school. He reveled in being able to\nprovide a quality service in a very difficult profession.\nHe would wear the pride of a job well done as well as the torture on a call missed. No coach, player or\nfan ever lived or died any game more passionately than Tom. Even in his retirement he confesses to\nmissing the adrenalin flow of calling a crucial game. It is hard for him to just sit and watch a game and\nenjoy it the way he did for so long, either behind the plate or on the bases. With his long resume of\nworking far into the playoffs, it is obvious others have been impressed by his credentials.\nThe biggest influence in Tom's life was his father, Tom Smith Sr, as he was to thousands of students and\nathletes. He was a legendary coach and teacher at Flint St. Michael's for 38 years. His mother and father\nwere married for 63 years and died within 11 days of each other. In Tom's words, \"They instilled the\nvalues and principles that I continue to live by.\""
  },
  {
    "Name": "Dan Cholas",
    "Year": 2014,
    "Image": "Dan_Cholas.jpg",
    "Bio URL": "Dan_Cholas",
    "bio": "\nDan grew up in the small mining and fruit growing town of Paonia. He graduated in 1961 and during his\nHigh School years he achieved All-Conference and All-State honors and was a State Champion in the\ndiscus. A four year, four sport athlete he began his educational career at Mesa Jr. College in Grand\nJunction. After two solid years as the Mavericks fullback and kicker, he transferred to the University of\nUtah and finished at what is now SCU-Pueblo where he had two outstanding years in football.\nDan graduated from CSU-Pueblo in 1966 and had several try-out offers in football as a place kicker and\nrunning back. He chose the Denver Broncos in 1966 and again in 1968. The dream of becoming a\nprofessional football player finally ended and Dan became a Teacher, Coach and Athletic director for 32\nyears with 29 of them in the Delta School district. From 1970 to 1973 he was the head football and\nbaseball coach at Ignacio High School.\nUpon his return to Delta, he started out at the freshman level and advanced over the years to becoming\nthe head football and assistant baseball coach. During his tenure as the Athletic Director at Delta High\nSchool, he was the tournament director for the 1-A Mountain League Baseball and Volleyball\ntournaments for 25 years. He was also the Director for several Regional Baseball tournaments.\nDan has umpired for 40 years and attended the Arizona Umpiring Academy for 11 years. He was\nhonored as a Stagg member and a life time scholarship. Dan umpired in three state championship finals\nand several semi and regional games. In 1998 and 1999, Dan umpired in two Babe Ruth World Series,\nheld in Florida, and was the UIC in 1999. The biggest influence in Dan's teaching and umpiring career\nhave been his family; his wife Doris, son Peter and daughter Danna. They always gave their support and\nviews."
  },
  {
    "Name": "Don Stengel",
    "Year": 2014,
    "Image": "Don_Stengel.jpg",
    "Bio URL": "Don_Stengel",
    "bio": "\nDon Stengel was a stand-out high school baseball player at Highland High School (now\nSkyview) graduating in 1978. He now resides in Loveland with his lovely wife Patti. He has\nfive children: Candace, LeeAnn, Jennifer, Deidra, and Casey.\nStengel played Independent Professional Baseball in Idaho Falls and worked as a\nprofessional scout with the Atlanta Braves and the Kansas City Royals. Don handled head-\ncoaching responsibilities at South High School, Golden High School, and the Academy of\nCharter Schools. He was also a coach with the Englewood Redbirds (Stan Musial-Semi-\nProfessional League) for 12 years where he assisted the legendary Hans Robinson.\nDon began umpiring in 1985 with the Colorado High School Baseball Umpires Association\nand eventually served as an area director with Dan Weikle and Don Rolfe in 1989. He was a\nfounding member of the Colorado Collegiate Umpire Association and worked collegiately in\nthe Western Athletic Conference and the Rocky Mountain Athletic Conference.\nDon was a fixture at the high school post season tournaments and worked six state\nchampionship games, including a memorable game between Lamar and La Junta which\nlasted 15 innings. His crew mates were Dan Ringsby and Dave Baker."
  },
  {
    "Name": "Paul Babkiewich",
    "Year": 2015,
    "Image": "Paul_Babkiewich.jpg",
    "Bio URL": "Paul_Babkiewich",
    "bio": "\nPaul loved the game of baseball. He played ball at Wheatridge High School where he was a\nthree-time letterman and team captain. Paul graduated in 1974. He went on to Colorado\nState University on a baseball scholarship and graduated in 1978. He was a team captain\nduring his junior and senior years. Paul would always say he graduated with honors and\nachievement, but we all knew better.\nPaul was married to Heidi, his college sweetheart, for 35 years. He had 3 children, Brittany,\nBrandon, and Tyler. He had 2 grandchildren Sophia and Easton.\nAfter graduation Paul began his career with Gallo Wines. He stayed in that industry for 36\nyears, the last 20+years with Republic National Distributing where he became a vice\npresident overseeing sales and operations for their wine and beer divisions in Colorado. He\nwas highly respected and well known nationally in the industry.\nPaul became a High School Baseball official in 1997. He knew the game and worked very\nhard to improve and excel as an umpire. His brother Frank always enjoyed the games that\nthey worked together. They officiated the games at a high level and had great fun doing\nthem, regardless of the level of play. Paul always felt the players and coaches deserved his\nbest effort. He had knowledge of the game and how the coaches expected the game to be\nplayed. He was taken from us way too soon."
  },
  {
    "Name": "Ross Barlow",
    "Year": 2015,
    "Image": "Ross_Barlow.jpg",
    "Bio URL": "Ross_Barlow",
    "bio": "\nRoss Barlow was born in Omaha, Nebraska on October 16, 1953. He attended Monte Vista\nHigh School graduating in 1972 and continued higher education at Adams State College in\nAlamosa, Colorado where he received a Bachelor's degree in 1979 and an MA in 1980. Ross\nnow resides in Monte Vista, Colorado.\nRoss had a long and distinguished career. He was a high school umpire for 33 years,\nbeginning in 1977 when he umpired in the 4A State Championship, Semi-Final, and\nRegionals. There were many years of umpiring high school playoffs, mostly in the southern\npart of the state, starting in 1988. He umpired in 2A, 3A, 4A, 5A and Semi-Finals from 1989\nthrough 1999, including high school All-State games in 1993 and 1996. Ross worked\nsummer high school ball for over 25 seasons. He also worked 7 Connie Macks World Series\nBall in Farmington, New Mexico with 4 Championship Plates.\nThere were many awards he received in his career including:\n• Area Director in Monte Vista and Alamosa for 20 years\n• Training of umpires in Area 13 in Monte Vista and Alamosa for 20 years.\n• Umpire Evaluator for over 30 years\n• Assignor for high school baseball and basketball for 16 years in the San Luis Valley."
  },
  {
    "Name": "Terry Garvey",
    "Year": 2015,
    "Image": "Ray_Garvey.jpg",
    "Bio URL": "Terry_Garvey",
    "bio": "\nTerry Garvey graduated in 1966 from Hinkley High School where he played for the\nrenowned Terry Schiessler. He attended Mesa Junior College in Grand Junction. After school\nat Mesa Terry came home hoping to find a coaching job in the Aurora American Legion\nprogram. A former coach of Terry's and an umpire as well, Bob Finney had other ideas and\ngot Terry started in umpiring youth baseball games.\nThis started a career that lasted nearly 40 years. Terry had some terrific men in his career\nthat helped him along the way. His rules mentor in those early days was Dave Letofsky who\nwould meet with Terry and others for hours over his kitchen table going over the rules of\nthe game. Mert Letofsky gave Terry his start in college baseball working in the RMAC in the\nearly 1980's. Terry continued working college baseball in the area for the next 20 years. He\nworked in the RMAC and WAC. One of Terry's memories was working a Grand Canyon vs\nDenver University game that was something like 46-12. Terry recalls that the DU catcher\nhad 13 RBI's that day.\nTerry worked numerous state playoffs over the years in high school baseball. His summer\nbaseball tourney history is long and storied. He worked his first A legion State\nchampionship with Joe Rossi and Terry Schiessler. Numerous state and regional Legion and\nAABC tourneys would follow over the years.\nTerry was one of the original \"A\" teamers that in the early 1980's helped form the Colorado\nCollegiate Baseball Association in. In 1984, Terry was selected to umpire the USA Olympic\nTeam vs Japan that played at Mile High Stadium. Terry, along with Keith Bailey, are the only\n2 men who played at Mile High and umpired a game at the stadium as both played in the\nDenver Suburban All Star games as High School Seniors. Terry also umpired in the MLB\nLegends Baseball game.\nTerry's career brought many a smile to players and coaches and partners who graced the\nbaseball fields across the Front Range. In particular, the nights at Aurora Central, Littleton,\nLowry Air Force Base and Fitzsimmons Army Fields and the endless days at Cherry Creek,\nHinkley and Gateway High Schools where Terry spent so many memorable games.\nTerry has been married for 46 years to Donna and has two sons, Michael and Caz and is\ngrandpa to three grandchildren."
  },
  {
    "Name": "Keith Bailey",
    "Year": 2016,
    "Image": "Keith_Bailey.jpg",
    "Bio URL": "Keith_Bailey",
    "bio": "\nKeith Bailey is the finest umpire that CHSBUA has ever produced. He has an exceptional resume both as\na player, umpire, and administrator. He served as an Denver Area Director and CHSBUA State President\nfrom 1991 to 1993. He was a founding member of the Colorado Collegiate Umpire Association, authored\nthe first CHSBUA umpire instructional handbook which became the blueprint for the Mile-High\nAdvanced Umpire Clinic, helped draft the initial proposal (accepted by the CHSBUA Executive\nCommittee) for the Umpire Training, Evaluation, and Promotion (UTEP), and was a highly sought-after\nspeaker and clinician at many CHSBUA Master Clinics.\nAs a ballplayer, few Colorado baseball players can compare. After a stellar prep career for Hinkley High\nSchool under the legendry John DiSiato, Keith enrolled at The University of Northern Colorado and\npitched Tom Petroff's Bears into the NCAA College World Series. He played professionally for the San\nFrancisco Giants and served as a professional scout for Chicago Cubs. As an administrator, Keith served\nas the umpire coordinator for both the United States Air Force Academy and The University of Northern\nColorado. He also coordinated umpire assignments for the Cherry Creek Diamond Club for many years.\nKeith has been a distinguished CHSBUA representative in nearly every high school tournament there is.\nHe worked CHSBUA post-season for nine years including three state championship games. He was\ntabbed by the American Baseball Congress (AABC) for many post-sea-son assignments including The\nConnie Mack Colorado State Championships, High Plains Regionals, and five straight appearances at The\nConnie Mack World Series in Farmington, New Mexico. He also was tabbed for post-season duties at the\nnext level of competition and worked Colorado Stan Musial post-season games for seven years\nculminating in his appointment to the Stan Musial World Series in Battle Creek, Michigan. He was named\nthe AABC National Umpire of the Year in 1994.\nAt the collegiate level, Keith has no peer in the state. Again, his curriculum vitae is second to none. He\nhas worked top collegiate conferences including the Western Athletic Conference, The Mountain West\nConference, The Big XII Conference, The Pacific 10, and the Rocky Mountain Athletic Conference. Keith\nwas selected to work the National JUCO World Series, The WAC championships (1997). The MWC\nchampionships (2002-2011), and 11 straight NCAA Division 1 Regional Tournaments.\nKeith's international experience includes Team USA vs. Japan (Mile High Stadium 1984), the USA\nOlympic Baseball Festival (1995), and Team USA v. Cuba in front of a record-setting 66,000 fans (Mile\nHigh Stadium 1990). Keith was also tabbed by professional baseball having worked as a AAA alternate\nfor 13 years and the Colorado Rockies v. Colorado Springs Sky Sox (1996).\nBesides Keith's Hall of Fame honor tonight, he was also named to the UNC Athletics Hall of Fame in\n1974. He is currently the City of Aurora Parks and Recreation Supervisor for Youth Development. He is\nmarried to Marlis (37 years), has two grown children, Jeff and Korri (John Treaes), twin grandsons Josh\nand Matt and granddaughter Abby"
  },
  {
    "Name": "Doug Graham",
    "Year": 2016,
    "Image": "Doug_Graham.jpg",
    "Bio URL": "Doug_Graham",
    "bio": "\nDoug is a Colorado native and graduated from Arvada West High school. He has had a\ndistinguished career as an association leader serving a total of 12 years. He was elected a\nDenver Area Director in 2000 and served as CHSBUA President from 2008-2010. He was\nalso instrumental in developing the new umpire rules training program.\nAs an umpire, Doug worked numerous playoff games and three state championship games.\nHe also worked in the Rocky Mountain Athletic and Mountain West Conferences.\nDoug has also served his country in the US Air Force and is an Iraq War veteran. We thank\nhim for his service."
  },
  {
    "Name": "Richard \"Dick\" Reininger",
    "Year": 2016,
    "Image": "Dick_Reininger.jpg",
    "Bio URL": "Richard_Dick_Reininger",
    "bio": "\n2016 Hall of Fame Inductee Richard ‘Dick' Reininger – Brighton\nOriginally from Johnstown, PA, Dick has served as a distinguished official in a\nvariety of sports. In addition to umpiring baseball and softball, he has officiated\nfootball, basketball, volleyball and almost roller derby.\nHe had the honor of working the first game at Jefferson County Stadium and at\nPrairie View High School. Dick also raised an umpire family and has worked the\nState All Star game twice with his sons Craig and Travis.\nDick was the primary CHSBUA umpire educator for many years. In addition to\nleading the instruction for new umpires in the Denver area, he taught clinics\nthroughout the state concentrating on Northern Colorado and including Aspen\n(during ski season).\nHis other contributions to education include teaching at AIMS Community College\nand he served his community as a City Councilman in Brighton, Colorado for eight\nyears."
  },
  {
    "Name": "Lee Rosa",
    "Year": 2016,
    "Image": "Lee_Rosa.jpg",
    "Bio URL": "Lee_Rosa",
    "bio": "\nAs an Athletic Director, Lee was the umpire's best friend, always ensuring they were taken\ncare of .... protected. He has tallied 64 years of supporting Aurora athletics. Lee's career in\neducation began in 1953 as a Physical Education teacher at Crawford Elementary in Aurora.\nHe then on to Aurora Junior High School in 1957, where he coached football. Lee was at\nAurora High School in 1961, where he coached golf and eventually became the Athletic\nDirector. He also found time to coach Legion baseball in the summers.\nLee was a distinguished football and basketball official and was hired by CHSAA in 1975 as\nan umpire observer/evaluator for post-season assignments in baseball, football and\nbasketball.\nLee was an accomplished athlete and was signed by the Pittsburgh Pirates in 1955 as a third\nbaseman. As an avid golfer, he claims to have 10 holes-in-one, but none have been captured\non video.\nLee was previously inducted into the Aurora Central Hall of Fame and is a highly respected\nsupporter of high school athletics and sports officials of all sports.\nHe is a respected leader known for his background, knowledge of officiating and his\nengaging spirit."
  },
  {
    "Name": "Randy Holmen",
    "Year": 2017,
    "Image": "Randy_Holmen.jpg",
    "Bio URL": "Randy_Holmen",
    "bio": "\nRandy Holmen is a 1972 graduate of Broomfield High School. He received a BA in Business\nat Southern Colorado State College in Pueblo, Colorado where he was also a four - year\nstarter in baseball. In 1985, Randy received a Master’s Degree from Adams State College\nand Principal/Superintendent Licensure in 1989 from Western State College in Gunnison,\nColorado. He has been a teacher, coach, Athletic Director, and/or Superintendent since\n1979. Randy is currently the Superintendent at Genoa-Hugo School District.\nIn 1976, Randy became registered by CHSAA to umpire in the Pueblo Association. He has\numpired on all levels from youth (including Babe Ruth and Legion), high school, junior\ncollege (baseball and women's softball), college softball (fast and slow pitch).\nRandy became affiliated with the Southeast Colorado Umpires Association in Lamar,\nColorado in 1979. From 1976 to 2010, he worked annually in various classifications of\nDistrict baseball. He also worked beyond District baseball at the regional level for at least 20\nof those years. He has worked many quarter-final and semi-final games during his 34 years.\nIn 2004, Randy worked the 4A State Championship Game between Broomfield and Niwot; in\n2007 he worked the 13-15-year-old Jr. Babe Ruth World Series in Jamestown, New York;\nand in 2009 he worked the 10-year-old Cal Ripken World Series in Lamar, Colorado."
  },
  {
    "Name": "Tim Kardatzke",
    "Year": 2017,
    "Image": "Tim_Kardatzke.jpg",
    "Bio URL": "Tim_Kardatzke",
    "bio": "\nTim Kardatzke umpired his first ball game in 1976 while living in Toledo, Ohio. He and his wife\nJan moved to Broomfield, Colorado in 1983 and he began working CHSAA baseball.\nTim worked baseball games for 39 years, most of those years with a full varsity assignment. He\nretired in 2015. In addition to baseball, Tim has been officiating volleyball since 1977 and\nremains active in that sport today. He has also been a Leader in the Boy Scouts for many years.\nTim has been a public-school teacher since 1971 and continues today as an active substitute\nteacher.\nTim was a significant contributing member to Area 10 Boulder/Longmont during his CHSBUA\ncareer. He worked two State Championships and about 15 Regional assignments."
  },
  {
    "Name": "Dennis Smith",
    "Year": 2017,
    "Image": "Dennis_Smith.jpg",
    "Bio URL": "Dennis_Smith",
    "bio": "\nDennis Smith was educated at Rocky Ford High School where he played baseball, football, and\nbasketball. He went on to attend Otero Jr. College. He served in the United States Army and is a\nVietnam War Veteran. Dennis is the longest serving County Treasurer in Colorado (38 years to\npresent). He is married to Cindy and has 4 children and 6 grandchildren.\nDennis began officiating in 1975. He worked baseball for 32 years which included three State\nChampionship games. Dennis was also involved in basketball for 38 years including working 15\nState Tournaments, and football for 36 years working three State Championship games. He\nserved as Area Director in all three sports over 25 years.\nAdditionally, Dennis worked High School girls softball, Babe Ruth baseball for over 20 years and\nworked two Babe Ruth World Series Tournaments. He was inducted into the Football and\nBasketball Hall of Fame and received the Gene Bunelle Basketball Award in 2016."
  },
  {
    "Name": "Neil Devlin",
    "Year": 2018,
    "Image": "Neil_Devlin.jpg",
    "Bio URL": "Neil_Devlin",
    "bio": "\nNeil Devlin is a native of Phoenixville, Pennsylvania, which is a suburb on the northwest side of\nPhiladelphia. He went to grade school at St. Ann's, Phoenixville and High School at St. Pius X in\nPottstown, PA.\nNeil's Newspaper and Media experience is extensive. He worked for The Evening Phoenix from\n1977-80; the Aurora Sentinel, Aurora Sun and Associated Press from 1980-82; The Denver Post\nfrom 1982-90, a stringer for Neighbors sections, covering high school sports which included desk\ncopy editing, layout and handling wires in addition to helping with the colleges and pros; a prep\nsports editor, from 1990-2016, covering all of Colorado's 300-plus high schools including game\nstories, blogs, columns, news stories, notes and features. He handled a budget, oversaw photo\nand video assignments; regularly spoke to high school classes; and active in web content design.\nHe is currently the Sports Information Director at Mullen High.\nNeil also worked with and appeared on Channel 9 and Channel 4; a contributor to Mile High\nSports magazine, Colorado Preps website, Boulder Daily Camera, Prep Baseball Report-Colorado\nand WoodyPaige.com. In addition, he has made radio, webcast, and podcast appearances into\nthe hundreds.\nNeil is married to Holly who is a 6-time swim champion at Cherry Creek and works in the library\nat Rangeview High in Aurora. Their sons: Ryan, 34, is a Special Olympian and a graduate of\nGateway, Aurora; and Rory, 29, was a U.S. Army Captain and Jag Officer in the Reserves and\nNational Guard, who served outside of Kabul with Special Forces. He is a graduate of Smoky Hill\nin Aurora, Creighton University and DU Law School."
  },
  {
    "Name": "Myran Dunker",
    "Year": 2018,
    "Image": "Myron_Dunker.jpg",
    "Bio URL": "Myran_Dunker",
    "bio": "\nMyran Dunker was born in Missoula, Montana and raised in Akron, Colorado where he\ngraduated high school. The U.S. Air Force, which he served honorably from 1980 to 2000, took\nhim to Buckley ANG Base in Aurora and then to Peterson AFB in Colorado Springs. He began\nofficiating basketball in 1976 and baseball in 1988. During this time, he also had the opportunity\nto officiate three State Final Baseball Games.\nHe contributed to the CHSAA baseball program in multiple ways. First, he served as the Colorado\nSprings Area Director from 1996 to 2004 and then as CHSBUA President from 2005 to 2007. He\ncapped off his umpiring career as President of the Colorado Springs Umpires Association from\n2011 to 2016.\nMyran revised the Colorado Springs Training Program to be a more functional and educational\nexperience for new umpires. This impressive training program is now the basis for current\ntraining. CHSBUA New Umpire Training continues to be one of the best training programs in the\nstate of Colorado. Myran also established an evaluation program using senior umpires."
  },
  {
    "Name": "Don Hegi",
    "Year": 2020,
    "Image": "Don_Hegi.jpg",
    "Bio URL": "Don_Hegi",
    "bio": "\n"
  },
  {
    "Name": "Dan Ringsby",
    "Year": 2020,
    "Image": "Dan_Ringsby.jpg",
    "Bio URL": "Dan_Ringsby",
    "bio": "\n"
  },
  {
    "Name": "Dave \"Chick\" Baker",
    "Year": 2023,
    "Image": "Dave_Baker.jpg",
    "Bio URL": "Dave_Chick_Baker",
    "bio": "\nDave “Chick” Baker’s journey began in the small town of Snyder, Colorado, but his impact has stretched across continents and generations. In 1960, while stationed in Aviano, Italy as a member of the United States Air Force, he became a registered official with the Italian Sports Federation. Rather than soaring in the “Wild Blue Yonder,” Baker found his calling grounded on baseball diamonds, basketball courts, and volleyball courts—where his versatility and passion truly shined.\n\nUpon his final duty post at Lowry Air Force Base in Aurora, Colorado, Baker launched his Colorado officiating career in 1971—one that would span nearly fifty years and seven generations. Known for his consistency and professionalism, he officiated five state championship baseball games and numerous state football title contests. His reputation for excellence extended to basketball as well, where he contributed to 37 combined football and basketball postseason tournaments.\n\nA true pillar of CHSBUA, Baker served as President from 1984 to 1987, contributed on the Executive Committee, and dedicated decades as Secretary/Treasurer. He played a key role in organizing Master Clinics and was instrumental in supporting Joe Rossi in establishing the Hall of Fame.\n\nDave “Chick” Baker exemplifies leadership, integrity, and dedication. His legacy is woven into the fabric of CHSBUA history, reminding us that from small-town beginnings come great and lasting contributions."
  },
  {
    "Name": "Joe Bonacquista",
    "Year": 2023,
    "Image": "Joe_Bonacquista.jpg",
    "Bio URL": "Joe_Bonacquista",
    "bio": "\nJoe Bonacquista was born in 1942, with a shortstop’s glove on one hand and a ticket to a World\nSeries in the other…or so it seemed. In reality, it took twenty years for Joe to make his first\nCollege World Series appearance in Omaha with the 1962 University of Northern Colorado\nBears. As youthful player, Joe’s skills were razor sharp, earning him the top hitter award\nvirtually everywhere he played. Later in life, on the senior baseball league circuit, He was\nnamed most valuable player on his World Series champion Denver Zephyrs 50+ MSBL team as a\n69-year-old.\nStarting with those early days in Trinidad, Colorado, what was to follow in Joe’s sterling playing\ncareer would be a total of nineteen amateur World Series appearances beginning at age twenty\nand ending a remarkable forty-nine years later in three different classifications. He started with\nthe College World Series in Omaha and ended with Senior League World Series stops in Phoenix\nand Ft. Myers. As a senior player, Joe collected five national age-group championships and eight\ndivision championships thanks to the Denver Men’s Senior Baseball League and the Roy Hobbs\nLeague of Ft. Myers. In his “prime”, Joe was named his team’s top hitter five times and was\nnamed to all-star teams nine times. Later in life, Joe was a senior league MVP twice, named\nComeback Player of the Year once, and earned the Denver Zephyr Team Spirit Award.\nOff the field, Joe was a championship coach. Over a ten-year period, his teams, both high school\nand summer, claimed another seventeen championships. He was named South-Central (HS)\nLeague coach of the year three times with a startling total of one hundred seventy-five wins to\nhis credit, not to mention his youth baseball coaching record of another sixty wins. In short,\nfrom his first coaching job in 1964 in Keenesburg, Colorado to his last coaching stint in 1971 at\nPueblo East High School, Joe was the gold standard of coaching excellence. Three of his former\nplayers went on to have careers in professional baseball. Joe’s son, Jeff, who led the South High\nColts to a state championship in 1984, went on to play for Wichita State. Together the\nBonacquista’s are one of only nine father-son combinations to every appear in the College\nWorld Series. Both have been inducted into the Greater Pueblo Sports Association Hall of Fame.\nJoe is enshrined in five different halls of fame from Pueblo to Greeley and has been honored\nfour times with induction into Who’s Who Among America’s Teachers during his 33-year tenure\nteaching United States and Colorado History. His civic involvement didn’t stray far from the\nbaseball diamond either. Joe was a featured clinician at coaching clinics in Southern Colorado,\nserved on the Runyon Field Board of Directors as a member and president, and for a change of\nscenery was a volunteer coach in the local YMCA basketball program."
  },
  {
    "Name": "Joey Borjon",
    "Year": 2023,
    "Image": "Joey_Borjon.jpg",
    "Bio URL": "Joey_Borjon",
    "bio": "\nJoey Borjon was a well-known figure to literally every student/athlete in Pueblo. was a security guard at Pueblo Central High School for 30 years and patrolled the\nbaseball diamond for seven more. Widely recognized for excellence, he was\nselected to work state championship baseball games for 32 of those years.\nHe\nAfter breaking in as a rookie umpire starting in 1983 with the Pueblo study group of CHSBUA, Joey later\nwas elected to the post of Pueblo Area Director in charge of umpire recruitment and training. In the “off-\nseason”, he umpired high school softball and refereed basketball as well.\nDuring the summer season, Joey served as the Runyon Field Sports Complex Training Coordinator for\nbaseball umpires of all ages along with handling assignments at the prestigious Tony Andenucio\nMemorial Classic.\nJoey was an inspiration and mentor to new and veteran umpires alike. He combined a sharp\nappearance and command of the rules of the game and their interpretations with a veteran’s expert\ncontrol when handling difficult situations on the diamond. His calm demeanor earned the respect of\ncoaches and players throughout Southern Colorado.\nJoey was best known for his guarantee given to the coaches at the pregame plate meeting. “We will\nwork hard for your teams this game!”\nHis most cherished role, however, was that of a dedicated family man to his\ncherished and loving wife, Rita, and children; Ann, Josh and Buddy (who followed in\nJoey footsteps umpiring high school baseball) and grandchildren, Hannah, Brooklyn,\nRemi, Avery, and Bostyn."
  },
  {
    "Name": "Mike Doohan",
    "Year": 2023,
    "Image": "Mike_Doohan.jpg",
    "Bio URL": "Mike_Doohan",
    "bio": "\nMike Doohan says he “just stumbled across an opportunity.” And for the next thirty years, he\ntook full advantage of it. Long-time CHSBUA umpire Gene Crusan recruited Mike in 1982 from a\nsoftball field in Commerce City. It was an offer Mike couldn’t refuse; nine-year old softball for\neight dollars a game.\nMike’s story was no different than most career arbiters. Eventually, he registered with the\nCHSBUA umpire group in Boulder, Colorado and came under the mentorship of Ken Furman and\nDoug Graham, both noted umpires, CHSBUA Boulder Area Directors, and CHSBUA Executive\nCommittee members. Four years later, Mike attended The Harry Wendelstedt Professional\nUmpire School and returned to Boulder to continue what was to become a very successful\ncareer on the diamond.\nEventually, Mike followed his mentors off the field as well becoming the CHSBUA Boulder Area\nDirector in the early 1990’s. Before it was all over, Mike also sat on the CHSBUA Executive\nCommittee and developed into an umpire of note being selected to umpire post-season\ncontests for twenty-five years, working fifteen state tournament contests.\nLooking back, Mike comments that for him the most important job of an area director was to\nkeep people engaged and positive. He did both and what he accomplished as an area director\ncan serve as a blueprint for CHSBUA area directors across the state today. He sought out\nprofessional training and returned to his local group and developed a training regimen based on\nsound, professional fundamentals instead of the usual anecdotal “strategies” which were often\n“tried but not often true” by most area directors of the past. Mike was among the first to bring\nprofessional umpiring to amateur umpires. CHSBUA area directors follow his example to this\nday.\nAlong the way, Mike says he got to know a great group of people. But a lot of those people also\ngot to know a great mentor who took the proper steps to help them improve both on and off\nthe diamond."
  },
  {
    "Name": "William \"Bill\" Fanning",
    "Year": 1991,
    "Image": "Bill_Fanning.jpg",
    "Bio URL": "William_Bill_Fanning",
    "bio": "\n**William \"Bill\" Fanning – Grand Junction**\n\nA legendary figure in Western Slope athletics, William “Bill” Fanning made a lasting impact as both a coach and official during his decades-long career in Colorado high school sports.\n\nBill arrived in Grand Junction in 1954 to play for the Grand Junction Eagles semipro baseball team. Shortly after, he was appointed as a teacher and the head baseball coach at Grand Junction High School. His coaching tenure was marked by remarkable success, culminating in **three state championships** and **six state runner-up finishes**.\n\nFrom 1956 to 1995, Bill also distinguished himself as a multi-sport official, refereeing **baseball, basketball, football, and softball** across the Western Slope. His officiating career included a historic moment in 1958 when he umpired the **very first National Junior College World Series (JUCO)** in Grand Junction. He continued working JUCO games for fifteen consecutive years—longer than any of his peers from that inaugural crew.\n\nBill’s contributions were not limited to the field and court. Following his officiating career, he served as a well-known voice in the community as a **radio announcer for KREX** for over a decade.\n\nHis dedication to student-athletes and high school sports has been recognized through numerous accolades, including induction into the:\n- **Colorado High School Athletic American Hall of Fame**\n- **Colorado Coaches Sports Hall of Fame**\n- **National High School Sports Hall of Fame**\n\nIn recognition of his enduring legacy, the **practice field at Grand Junction High School** proudly bears his name.\n"
  },
  {
    "Name": "Ken Zetner",
    "Year": "Pre 1990",
    "Image": "Ken_Zetner.jpg",
    "Bio URL": "Ken_Zetner",
    "bio": "\n"
  },
  {
    "Name": "Bert Borgmann",
    "Year": 2024,
    "Image": "Bert_Borgmann.jpg",
    "Bio URL": "Bert_Borgmann",
    "bio": "\nA proud graduate of Broomfield High School, Bert Borgmann dedicated his career to championing high school athletics and activities in Colorado. His journey began in the sports information offices at Colorado State University and the University of Northern Colorado, before embarking on a decades-long career with CHSAA.\n\nOver his tenure, Bert oversaw nearly every CHSAA-sanctioned sport as well as music, becoming a cornerstone of the organization. Revered for his institutional knowledge and passion for storytelling, Bert became the caretaker of CHSAA’s rich history and a trusted leader within the Association and at the National Federation of State High School Associations (NFHS).\n\nFormer CHSAA commissioner Bob Ottewill praised Bert’s character, saying, “He never hesitated to take on any assignment – from basketball czar to snow shoveling duties – and did so with enthusiasm, a desire to learn and improve, and an uncommon ability to work with athletes, coaches, officials, event managers, and even parents.”\n\nNationally, Bert served with distinction on numerous committees, including chairing the NFHS National Records Committee and contributing to the NFHS Baseball and Softball Rules Committees, Sportsmanship Committee, and National High School Hall of Fame Screening Committee. He also helped institutionalize the annual sports information directors gathering at the NFHS summer meeting — a tradition that fostered community and camaraderie across the country.\n\nBert's commitment and excellence earned him numerous accolades, including:\n- The Jim Saccomano Award (National Football Federation – Colorado Chapter)  \n- The Ray Lutz Award (Rocky Mountain Athletic Conference)  \n- Induction into the Colorado Dugout Club Hall of Fame  \n- The NFHS Section 6 “Citation Award”  \n- Lifetime Honorary Membership in the IAABO Board 4  \n\n“His heart was so big. Bert was everyone’s biggest cheerleader and he helped make CHSAA what it is today,” said a colleague. “He was an incredible advocate for high school athletics, activities, and media. His legacy will live on for many years to come.”"
  },
  {
    "Name": "Dan Weikle",
    "Year": 2024,
    "Image": "Dan_Weikle.jpg",
    "Bio URL": "Dan_Weikle",
    "bio": "\nTo say that Dan Weikle’s ongoing umpiring career, which began in 1975, is saturated with\naccomplishments would be an understatement. Dan’s focus as the CHSBUA President (2000-2003) was\nto improve CHSBUA umpiring through on-going training and evaluation. His philosophy was simple; give\nany CHSBUA umpire a path leading to the elevation of their talent; to meet and exceed expected\nstandards of performance. The creation of the advanced training and professional standards for\nCHSBUA umpires was taken from the NCAA Umpire Development Program presented almost 40 years\nago when Dan and Keith Bailey attended the first NCAA National Umpire Development Meeting in\nKansas City, MO in the dead of winter. The next year this duo, with the help of Ray Belfiore, convinced\nNCAA Umpire Development to come to Denver, knowing it was better to bring the training here rather\nthan have Colorado umpires brave the frozen hazards he and Bailey had endured on I-70 in January.\nDan took this a step further by inviting Jon Bible, the first NCAA Umpire Coordinator, to come to Denver\nand meet with all interested umpires, some of whom were on the cusp of entering into the college\nranks, but most of whom were interested in improving their skills as CHSBUA umpires. Following an\nopen-invitation meet and greet dinner, Bible attended local Connie Mack and Stan Musial summer\ngames to observe some of Colorado’s best CHSBUA umpires. Fast forward a few years with Dan, Keith,\nRay, and Jim Paronto organizing The Mile High Advanced Umpire Clinic featuring instruction from the\nfinest nationally recognized umpires in America featuring Bob Jones, the first NCAA Umpire\nDevelopment representative assigned to the Mid-west who functioned much like Bible had done earlier.\nThe program eventually became a success with over two-thirds of CHSBUA umpires selected for high\nschool post-season games receiving continued professional development through the Mile High\nAdvanced Umpire Clinic.\nWhile Dan’s resume never compared to many of the MHAUC grads, it was evident that his greatest\ncontribution was organizing opportunities for umpires to learn and develop their craft. Toward this end,\nduring the late 1980’s, Dan met with the AAA Denver Zephyrs general manager Tom Mahoney and\nlobbied for the members of the advanced training clinic to be guests of the Zephyrs so they could watch\nand learn from professional umpires. Dan’s request was for a game or two; the Zephyrs G.M. responded\nwith season passes for all umpires in the development program. Later, as a CHSBUA Area Director, Dan\nsuccessfully organized and scheduled Denver Area Umpire meetings to be held in a suite at Mile High\nStadium in conjunction with Zephyrs games.\nDuring a career spanning six decades, Dan was responsible for creating several umpire instructional\nclinics, both locally and nationally. The Mile High Advanced Umpire Camp was one of his first. After\ndeveloping the MHAUC and the Umpire Training, Evaluation, and Promotion (UTEP) arm of CHSBUA, Dan\nwent on to develop a national umpire training and evaluation program in his new (2010-16) position as\nthe NCAA Division II National Umpire Coordinator. Dan’s mandate from the NCAA was to insure the best\numpires from around the nation were observed, evaluated, and promoted to the eight Division II post-\nseason tournaments including the national championship. The creation of two separate NCAA clinics,\nThe Palm Beach Challenge in Florida and The Desert Challenge in Phoenix helped meet that mandate.\nBoth clinics featured first-ever Division II Regional Advisors headed by Tim Hatfield, Dennis Whalen, and\nKirk Knowles-all former MHAUC instructors and CHSBUA members, who were largely responsible for the\nselection process leading to the naming of the NCAA Division II National Championship umpire staff."
  },
  {
    "Name": "Jim Paronto",
    "Year": 2024,
    "Image": "Jim_Paronto.jpg",
    "Bio URL": "Jim_Paronto",
    "bio": "\nJim Paronto built a solid reputation as a football player and coach before becoming one of Colorado’s premier umpires. A multi-sport athlete, Jim played quarterback at Adams State University where he earned Academic All-Conference, Academic All-American, and All-Conference honors, while also playing on the baseball team. He graduated in 1966 after serving as team captain his senior year, and later returned to serve as the head coach for both football and baseball at his alma mater.\n\nHis career in coaching and officiating began at Central Union High School in California before he returned to Alamosa, Colorado to teach and coach at Monte Vista High School. Jim soon moved into the collegiate ranks with coaching roles at Adams State, Brigham Young University—where he helped the Cougars win a Division I National Championship and earned a doctorate in athletic administration—followed by positions at Oregon State and Colorado Mesa University. At CMU, he led the Mavericks to the NAIA football championship game in his first season.\n\nIn addition to his accomplishments in education and coaching, Jim established himself as one of the top umpires in the state. He served as CHSBUA President from 1999 to 2001 and co-directed the CHSBUA Umpire Training, Evaluation, and Promotion (UTEP) program. He was also instrumental in founding the Mile High Advanced Umpire Clinic, where he trained over 200 high school umpires across a decade of service.\n\nJim’s umpiring career was as extensive as it was distinguished. He worked countless league, regional, and state championships and was a fixture at the AABC Connie Mack World Series in Farmington, New Mexico. At the college level, he represented CHSBUA in the Rocky Mountain Athletic Conference and Scenic West Conference as both an umpire and supervisor, while also officiating in the WAC, MWC, and West Coast Conference. He later served as a coordinator in the MWC and held the position of NCAA Secretary Rules Editor for 12 years—the only CHSBUA umpire to ever serve in a national NCAA rules capacity.\n\nA lifelong educator, coach, mentor, and leader, Jim Paronto is an exemplary figure whose career has left an indelible mark on Colorado high school and collegiate baseball. His induction into the Joe Rossi CHSBUA Hall of Fame is a tribute to his unwavering dedication and excellence in sport."
  },
  {
    "Name": "Tom Robinson",
    "Year": 2024,
    "Image": "Tom_Robinson.jpg",
    "Bio URL": "Tom_Robinson",
    "bio": "\n> “Beyond the impact Tom Robinson has made in this Association, our state and nationally over the course of his 30-plus year career as a coach, teacher, administrator, white hat referee, Hall of Famer, Big 12 replay expert, husband, father and grandfather, we are all better people for having had Tom in our lives,” said CHSAA commissioner Rhonda Blanford-Green.\n\nHired by former commissioner Bob Ottewill, Tom became the first African-American administrator in the history of CHSAA.\n\nOver 20 years with the Association, Tom oversaw officials — becoming the first to assign a female official to a boys’ basketball Final Four — as well as the sportsmanship program, and boys’ and girls’ golf. A role model and respected leader, Tom was widely admired for his passion, integrity, and mentorship.\n\n> “Tom was an inspiration in so many ways,” said CHSAA assistant commissioner Bethany Brookens. “He taught me how to play golf, he and Cleo taught us all about love and marriage, he taught me the mechanics of officiating, and he gave me loyal friendship and a deep respect for all people. An incredible, ethical, good man and mentor — I already miss him dearly.”\n\nA graduate of Regis Jesuit High School, Tom attended Colorado State University where he played football, basketball, and track and field. He began officiating in the summer of 1969, and that same year started his teaching and coaching career at Regis Jesuit. He remained there for 31 years, serving as head basketball coach from 1983 to 1993, before joining CHSAA in 2001.\n\nTom and his wife, Cleo Parker Robinson, were married for 51 years. Tom stood as a stalwart behind the scenes of Cleo's dream: the formation and rise of the nationally recognized Cleo Parker Robinson Dance (CPRD). As a co-founder, board member, and business manager, Tom contributed to every facet of the organization’s success.\n\nBeyond CHSAA, Tom served as president of the National Association of Sports Officials and worked as the Big 12 Conference’s replay coordinator. He announced his retirement on December 15, 2021.\n\nTom’s passing leaves an enduring void, but his legacy of compassion, leadership, and service lives on.\n\n> “Even from the outside looking in, Tom was a person to aspire to be,” said Rashaan Davis, CHSAA’s first assistant commissioner for activities. “He always seemed cool, calm, and collected — something I know I needed. Now, as a staff member, I understand that Tom laid the foundation for me, a Black male in this role, to be patient and to recognize all voices. Nobody did it better.”\n\nTom is survived by his wife, Cleo Parker Robinson; his son, Malik Robinson, executive director of CPRD; and his beloved grandchildren. He looked forward to playing golf with Cleo and being present in his grandchildren’s lives."
  },
  {
    "Name": "Ray Belfiore",
    "Year": 2025,
    "Image": "Ray_Belfiore.jpg",
    "Bio URL": "Ray_Belfiore",
    "bio": "\n**A lifelong student of the game,** Ray Belfiore’s journey behind the plate began immediately after high school, when he took the Colorado high school umpiring test in 1982. In those formative years, he developed his craft alongside the respected Aurora-based crew led by Mert and Dave Letofsky. Starting in sub-varsity high school games, Ray quickly grew his skills through the rigors of the American Amateur Baseball Congress (AABC), calling games in the competitive Connie Mack (18+) and Stan Musial (collegiate) circuits.\n\n**It wasn’t long before Ray was recognized as a standout new talent**. His professionalism, consistency, and dedication earned him numerous championship assignments and set him apart among his peers. Over 30 years, he became a fixture in these elite leagues.\n\nIn 1987, Ray took a major step forward by attending the *Brinkman Professional Umpire School***, an experience he credits as transformative. There, he learned what it truly takes to excel in the profession. Upon returning to Colorado, Ray brought that knowledge home, becoming an instructor at the CHSBUA-sponsored Mile High Advanced Umpire Clinic. He became a vital asset to the clinic, training not only aspiring umpires but also the instructors—sharing cutting-edge professional techniques and his personal blueprint for success: \n\n>***“Work hard every game, no matter the score. Listen to the veterans. Always be learning.”***\n>\n>**Ray's success continued to climb**, as he entered the collegiate officiating ranks with assignments in the Rocky Mountain Athletic Conference (D-II) and major Division I conferences like the Mountain West, Big XII, WAC, and West Coast Conference. Though his high school schedule lessened over time, his passion for mentoring never waned. He remained a pillar of the CHSBUA’s instructional efforts for over two decades, particularly through the UTEP/Mile High Advanced Umpire Clinic and Master Clinics.\n\n>*Ray’s dedication to the game has earned him numerous prestigious assignments and awards:*\n\n## **Career Highlights:**\n\n- **2× Connie Mack World Series umpire**\n- **2× JUCO World Series umpire**\n- **12× Mountain West Championships umpire**\n- **10× NCAA Division I Regionals umpire**\n- **2× NCAA Division II Regionals umpire**\n- **AAA alternate umpire (Zephyrs, PCL Sky Sox) – 15+ years**\n\n## **Legacy Among Peers**\nFellow umpire Keith Bailey fondly remembers Ray as *“fearless”* and *“passionate,”* known for holding his crew—and himself—to the highest standard.\n\n> ***“If Ray was on your crew, you were going to have fun—but you were also going to be accountable. He made you better.”***\n\n# **Giving Back to the Umpiring Community** #\nRay’s career was defined not only by his achievements but also by his relentless desire to give back to the umpiring community. Through **20+ years of clinics, mentorship, and leadership**, Ray became the very definition of an *“umpire’s umpire.”*\n\n---\n\n*Ray’s career continues to inspire and uplift the next generation of umpires, a testament to his passion, professionalism, and his unwavering commitment to the craft.*"
  },
  {
    "Name": "Steve Heuer",
    "Year": 2025,
    "Image": "Steve_Heuer.jpg",
    "Bio URL": "Steve_Heuer",
    "bio": "\n**Steve Heuer’s name is synonymous with commitment, endurance, and excellence in Colorado high school officiating.** After arriving in Denver in 1967, Steve embarked on a legendary career that would span over six decades and touch nearly every sport sanctioned by the Colorado High School Activities Association (CHSAA).\n\nSteve’s officiating career began even earlier, at age 16, umpiring little league games. By 1962, while attending the University of Illinois on a football and track scholarship, he registered with the National Federation and began officiating intramurals—an effort to help pay for school while also honing his skills. His dedication to officiating only grew from there.\n\nUpon moving to Colorado, Steve joined the Aurora Sports Officials under the guidance of Dave and Mert Letofsky and was later welcomed into the Jefferson County Baseball Umpires’ Association. There, he worked alongside future CHSBUA Hall of Fame legends like Julius Carabello, Lou Nolin, Bud Schoepflin, and Joe Rossi. Despite limited on-field training in those days, Steve’s natural leadership and dedication quickly earned him championship-level assignments.\n\n**Over the years, Steve would become known for his precision, professionalism, and unwavering commitment to the game.** He has officiated multiple district, regional, and state finals—most notably a state championship baseball game in 2023 at the age of 79, where he served as the plate umpire. His remarkable estimate: over 10,000 baseball games officiated, and nearly 30,000 total across all sports.\n\nOutside of officiating, Steve’s career as a **chemical engineer** took him to Amoco Oil, where he led hazardous waste recovery projects and earned patents for innovative oil treatment technologies. During his assignment at the Rocky Mountain Arsenal, he received a direct commission to captain and oversaw critical operations.\n\nToday, Steve remains the senior member of CHSBUA and continues to umpire both baseball and softball. His encyclopedic knowledge of the rules has made him a respected authority—often the go-to person for resolving rule disputes both on and off the field.\n\n> ***“It’s easier to just ask Steve than to search the rule book. He’s always right, and no one has ever disagreed with him. He’s the final word.”***\n\n---\n\n**Steve Heuer isn’t just an umpire.** He is a steward of the game, a mentor, and a living archive of the evolution of officiating in Colorado. His contributions have inspired generations—and continue to shape the CHSBUA today."
  },
  {
    "Name": "Terry Reed",
    "Year": 2025,
    "Image": "Terry_Reed.jpg",
    "Bio URL": "Terry_Reed",
    "bio": "\n**Terry Reed has called thousands of games across decades — but his greatest victories came off the field.**\n\nWith a career spanning over 40 years, Terry Reed has become a pillar of Colorado’s officiating community. From district and regional matchups to the intensity of state championship games, Terry earned respect with every pitch, every call, and every show of quiet professionalism. His calm demeanor, sharp judgment, and deep knowledge of the game made him a trusted presence behind the plate and on the court.\n\n**His impact was felt far beyond Colorado's borders.**  \nIn 2018, Terry was invited to umpire at the prestigious Dreams Park Tournament in Cooperstown, NY — a personal and professional highlight that allowed him to visit the National Baseball Hall of Fame. He’s also been awarded bronze, silver, and gold medals from ASA/USA Softball, holds National Indicator Fraternity honors, and has received multiple Umpire of the Year awards.\n\nBorn and raised in Kansas, Terry moved to Colorado in 1976. A player in both men’s fast pitch and slow pitch softball, he eventually found his true calling in officiating. Over the years, he became a versatile 3-sport official in baseball, softball, and basketball under CHSAA, and also served two terms as a softball area director. Off the field, he’s a proud husband to Penny (married since 1977), father to three daughters, and grandfather to six.\n\n> ***“Terry’s character has always been his strongest trait,”***  \n> says fellow official and longtime friend.  \n> ***“Even in the toughest moments, you could count on him to show up with strength, faith, and grace.”***\n\n## **A Fight Bigger Than the Game**\n\nIn 2023, Terry faced an opponent tougher than any he’d seen on the field: cancer. After experiencing severe abdominal pain, doctors discovered a tumor in his hip and pelvis — bone cancer that had originated in his kidney. The diagnosis was dire. Terry stepped away from officiating, believing his time was short. CHSAA honored him at the 5A state championship with a ceremonial first pitch, surrounded by family, friends, and fellow officials.\n\nBut in true Terry Reed fashion, **he refused to quit.**  \nThanks to an experimental surgery and an indomitable spirit, Terry defied the odds. By mid-2023, he was walking and jogging again. By 2024, he was back on the field — whistle in hand, smile on his face.\n\n## **Faith, Family, and the Future**\n\nTerry credits his miraculous recovery to God, the unwavering love of his family, and the support of the officiating community. He continues to receive monthly treatments, with his cancer now in remission. Through it all, his perspective remains grounded in gratitude and hope.\n\n> ***“I believe I’m here for a reason,”*** he says.  \n> ***“There’s more to give, more to teach, and more to live.”***\n\n---\n\n*With every game he calls today, Terry Reed is a living testament to resilience, faith, and the enduring love of the game.*"
  }
]